{
    "spartan": {
        "example": "denial After losing everything in a fire, Tim decided to live in spartan conditions, sleeping on the floor and owning as little furniture as a possible.",
        "part": "adjective",
        "definition": "unsparing and uncompromising in discipline or judgment; practicing great self-",
        "level": "Advanced Words"
    },
    "morose": {
        "example": "After Stanley found out he was no longer able to go on vacation with his friends, he sat in his room morosely.",
        "part": "adjective",
        "definition": "ill-tempered and not inclined to talk; gloomy",
        "level": "Basic Words"
    },
    "vitriolic": {
        "example": "While the teacher was more moderate in her criticism of the other student's papers, she was vitriolic toward Peter's paper, casting every flaw in the harshest light.",
        "part": "adjective",
        "definition": "harsh or corrosive in tone",
        "level": "Advanced Words"
    },
    "snide": {
        "example": "The chairman interpreted Taylor's question about promotions as a snide remark, but in all innocence Taylor was trying to figure out the company's process.",
        "part": "adjective",
        "definition": "expressive of contempt; derogatory or mocking in an indirect way",
        "level": "Basic Words"
    },
    "delegate": {
        "example": "Since the senior manager had to go on many international business trips, she was forced to delegate many of her responsibilities to two lower-level managers.",
        "part": "verb",
        "definition": "give an assignment to (a person)",
        "level": "Basic Words"
    },
    "affluent": {
        "example": "The center of the city had sadly become a pit of penury, while, only five miles away, multi-million dollar homes spoke of affluence.",
        "part": "adjective",
        "definition": "wealthy",
        "level": "Basic Words"
    },
    "flux": {
        "example": "Ever since Elvira resigned as the head of marketing, everything about our sales strategy has been in a state of flux.",
        "part": "noun",
        "definition": "a state of uncertainty about what should be done (usually following some important event)",
        "level": "Common (High-frequency) Words"
    },
    "thrifty": {
        "example": "He was economical, spending his money thriftily and on items considered essential.",
        "part": "adjective",
        "definition": "spending money wisely",
        "level": "Basic Words"
    },
    "preclude": {
        "example": "The manager specified that all other gates be locked, to preclude the possibility of persons without tickets entering the arena undetected.",
        "part": "verb",
        "definition": "keep from happening or arising; make impossible",
        "level": "Common (High-frequency) Words"
    },
    "platitude": {
        "example": "The professor argued that many statements regarded as wise in previous times, such as the Golden Rule, are now regarded as mere platitudes.",
        "part": "noun",
        "definition": "a trite or obvious remark",
        "level": "Common (High-frequency) Words"
    },
    "boon": {
        "example": "He was a boon companion to many, and will be sadly missed.",
        "part": "adjective",
        "definition": "very close and convivial",
        "level": "Basic Words"
    },
    "frugal": {
        "example": "Monte was no miser, but was simply frugal, wisely spending the little that he earned.",
        "part": "adjective",
        "definition": "not spending much money (but spending wisely)",
        "level": "Common (High-frequency) Words"
    },
    "exacting": {
        "example": "Though his childhood piano teacher was so exacting, Max is thankful now, as a professional pianist.",
        "part": "adjective",
        "definition": "requiring and demanding accuracy",
        "level": "Common (High-frequency) Words"
    },
    "idiosyncrasy": {
        "example": "Peggy's numerous idiosyncrasies include wearing mismatched shoes, laughing loudly to herself, and owning a pet aardvark.",
        "part": "noun",
        "definition": "a behavioral attribute that is distinctive and peculiar to an individual",
        "level": "Common (High-frequency) Words"
    },
    "limpid": {
        "example": "Her limpid prose made even the most recondite subjects accessible to all.",
        "part": "adjective",
        "definition": "clarity in terms of expression",
        "level": "Advanced Words"
    },
    "deliberate": {
        "example": "Emergency situations such as this call for immediate action and leave no room to deliberate over options.",
        "part": "verb",
        "definition": "think about carefully; weigh the pros and cons of an issue",
        "level": "Basic Words"
    },
    "sanction": {
        "example": "International sanctions have been placed on certain shipping lanes that were thought to be involved in human trafficking.",
        "part": "noun",
        "definition": "a legal penalty for a forbidden action",
        "level": "Common (High-frequency) Words"
    },
    "impartial": {
        "example": "The judge was not impartial since he had been bribed by the witness's family.",
        "part": "adjective",
        "definition": "free from undue bias or preconceived opinions",
        "level": "Common (High-frequency) Words"
    },
    "constituent": {
        "example": "The constituents of the metal alloy are nickle, copper, and tin.",
        "part": "noun",
        "definition": "an abstract part of something",
        "level": "Common (High-frequency) Words"
    },
    "crystallize": {
        "example": "Only after fifteen minutes of brainstorming did Samantha's ideas for the essay crystallize.",
        "part": "verb",
        "definition": "cause to take on a definite and clear shape",
        "level": "Advanced Words"
    },
    "chauvinism": {
        "example": "groups/causes Vegetarians argue that man is chauvinistic in his belief that animals do not consciously feel the pain we humans do.",
        "part": "noun",
        "definition": "fanatical patriotism; belief that one's group/cause is superior to all other",
        "level": "Advanced Words"
    },
    "dispensation": {
        "example": "Since her father is a billionaire, she is given dispensation from many of the school's policies.",
        "part": "noun",
        "definition": "an exemption from a rule or obligation",
        "level": "Advanced Words"
    },
    "stymie": {
        "example": "The engineers found their plans stymied at every turn and were ultimately able to make amlost no progress on the project.",
        "part": "verb",
        "definition": "hinder or prevent the progress or accomplishment of",
        "level": "Basic Words"
    },
    "discord": {
        "example": "Despite all their talented players, the team was filled with discord--some players refused to talk to others--and lost most of their games.",
        "part": "noun",
        "definition": "lack of agreement or harmony",
        "level": "Basic Words"
    },
    "apotheosis": {
        "example": "As difficult as it is to imagine, the apotheosis of Mark Zuckerberg's career, many believe, is yet to come.",
        "part": "noun",
        "definition": "exaltation to divine status; the highest point of development",
        "level": "Advanced Words"
    },
    "hoodwink": {
        "example": "Someone tried to hoodwink Marty with an email telling him that his uncle had just passed away, and to collect the inheritance he should send his credit card information.",
        "part": "verb",
        "definition": "to deceive or trick someone",
        "level": "Advanced Words"
    },
    "martial": {
        "example": "Americans tend to remember Abraham Lincoln as kindly and wise, not at all martial, despite the fact that he was involved in the fiercest war America has even fought.",
        "part": "adjective",
        "definition": "suggesting war or military life",
        "level": "Basic Words"
    },
    "panegyric": {
        "example": "Dave asked Andrew to do just a simple toast, but Andrew launched into a full panegyric, enumerating a complete list of Dave's achievements and admirable qualities.",
        "part": "noun",
        "definition": "a formal expression of praise",
        "level": "Advanced Words"
    },
    "factious": {
        "part": "adjective",
        "definition": "produced by, or characterized by internal dissension",
        "level": "Advanced Words"
    },
    "craven": {
        "example": "Though the man could have at least alerted the police, he crouched cravenly in the corner as the old woman was mugged.",
        "part": "adjective",
        "definition": "pathetically cowardly",
        "level": "Common (High-frequency) Words"
    },
    "consecrate": {
        "example": "At the church of Notre Dame in France, the new High Altar was consecrated in 1182.",
        "part": "verb",
        "definition": "to make holy or set apart for a high purpose",
        "level": "Basic Words"
    },
    "diligent": {
        "example": "Michael was a diligent gardener, never leaving a leaf on the ground and regularly watering each plant.",
        "part": "adjective",
        "definition": "characterized by care and perseverance in carrying out tasks",
        "level": "Basic Words"
    },
    "hedge": {
        "example": "When asked why he had decided to buy millions of shares at the very moment the tech companies stock soared, the CEO hedged, mentioning something vague about gut instinct.",
        "part": "verb",
        "definition": "to limit or qualify a statement; to avoid making a direct statement",
        "level": "Advanced Words"
    },
    "posit": {
        "example": "Initially, Einstein posited a repulsive force to balance Gravity, but then rejected that idea as a blunder.",
        "part": "verb",
        "definition": "assume as fact",
        "level": "Common (High-frequency) Words"
    },
    "impudent": {
        "example": "In an impudent move, the defendant spoke out of order to say terribly insulting things to the judge.",
        "part": "adjective",
        "definition": "improperly forward or bold",
        "level": "Common (High-frequency) Words"
    },
    "patent": {
        "part": "adjective",
        "definition": "glaringly obvious",
        "level": "Advanced Words"
    },
    "autonomously": {
        "example": "Many of the factory workers are worried about being replaced by machines and computers that will work completely autonomously.",
        "part": "adverb",
        "definition": "In an autonomous or self-governing manner.",
        "level": "Basic Words"
    },
    "reticent": {
        "example": "When asked about her father, Helen lost her outward enthusiasm and became rather reticent.",
        "part": "adjective",
        "definition": "reluctant to draw attention to yourself; temperamentally disinclined to talk",
        "level": "Common (High-frequency) Words"
    },
    "untoward": {
        "example": "Some professors find teaching untoward as having to prepare for lectures and conduct office hours prevents them from focusing on their research.",
        "part": "adjective",
        "definition": "unfavorable; inconvenient",
        "level": "Advanced Words"
    },
    "tortuous": {
        "example": "Because the logic behind McMahon's side of the debate was so tortuous, his audience came out either completely confused or, worse, feeling they'd been tricked.",
        "part": "adjective",
        "definition": "marked by repeated turns and bends; not straightforward",
        "level": "Common (High-frequency) Words"
    },
    "catalyst": {
        "example": "Rosa Park's refusal to give up her bus seat acted as a catalyst for the Civil Rights Movement, setting into motion historic changes for African-Americans.",
        "part": "noun",
        "definition": "something that speeds up an event",
        "level": "Basic Words"
    },
    "retract": {
        "example": "under pressure Email is wonderfully efficient, but once something awkward or damaging has been sent, there is no way to retract it.",
        "part": "verb",
        "definition": "pull inward or towards a center; formally reject or disavow a formerly held belief, usually",
        "level": "Basic Words"
    },
    "desiccated": {
        "example": "Few novelists over 80 are able to produce anything more than desiccated works--boring shadows of former books.",
        "part": "adjective",
        "definition": "uninteresting, lacking vitality",
        "level": "Advanced Words"
    },
    "robust": {
        "example": "Chris preferred bland and mild beers, but Bhavin preferred a beer with more robust flavor.",
        "part": "adjective",
        "definition": "sturdy and strong in form, constitution, or construction",
        "level": "Basic Words"
    },
    "misogynist": {
        "example": "Many have accused Hemingway of being a quiet misogynist, but recently unearthed letters argue against this belief.",
        "part": "noun",
        "definition": "a person who dislikes women in particular",
        "level": "Basic Words"
    },
    "impute": {
        "example": "He imputed his subpar performance on the test to a combination of stress and poor sleep.",
        "part": "verb",
        "definition": "attribute (responsibility or fault) to something",
        "level": "Advanced Words"
    },
    "evenhanded": {
        "example": "Teachers often have trouble being evenhanded to all of their varied students.",
        "part": "adjective",
        "definition": "without partiality",
        "level": "Basic Words"
    },
    "acme": {
        "example": "The new Cessna airplanes will be the acme of comfort, offering reclining seats and ample legroom.",
        "part": "noun",
        "definition": "the highest point of achievement",
        "level": "Basic Words"
    },
    "exiguity": {
        "example": "After two months at sea, the exiguity of the ship's supplies forced them to search for fresh water and food.",
        "part": "noun",
        "definition": "the quality of being meager",
        "level": "Advanced Words"
    },
    "obsequious": {
        "example": "influential people by flattery The obsequious waiter did not give the couple a moment's peace all through the meal, constantly returning to their table to refill their water glasses and to tell them what a handsome pair they made.",
        "part": "adjective",
        "definition": "attentive in an ingratiating or servile manner; attempting to win favor from",
        "level": "Common (High-frequency) Words"
    },
    "taciturn": {
        "example": "While the CEO enthusiastically shares his plans and agenda with all who will listen, the CFO is far more taciturn, rarely revealing his perspective.",
        "part": "adjective",
        "definition": "habitually reserved and uncommunicative",
        "level": "Common (High-frequency) Words"
    },
    "callow": {
        "example": "Both Los Angeles and New York are known for callow out-of-towners hoping to make it big.",
        "part": "adjective",
        "definition": "young and inexperienced",
        "level": "Advanced Words"
    },
    "spurn": {
        "example": "She spurned all his flattery and proposals, and so he walked off embarrassed and sad.",
        "part": "verb",
        "definition": "reject with contempt",
        "level": "Basic Words"
    },
    "taxing": {
        "example": "The hike to the summit of Mt. Whitney was so taxing that I could barely speak or stand up.",
        "part": "adjective",
        "definition": "use to the limit; exhaust",
        "level": "Basic Words"
    },
    "besotted": {
        "example": "Never before have I seen my mom so besotted, and honestly, I hope it's the last time she drinks so much.",
        "part": "adjective",
        "definition": "very drunk",
        "level": "Advanced Words"
    },
    "behooves": {
        "part": "verb",
        "definition": "to be one's duty or obligation",
        "level": "Basic Words"
    },
    "ornate": {
        "example": "The ornate Victorian and Edwardian homes spread throughout San Francisco are my favorite part of the city.",
        "part": "adjective",
        "definition": "marked by elaborate rhetoric and elaborated with decorative details",
        "level": "Basic Words"
    },
    "check": {
        "example": "When government abuses are not kept in check, that government is likely to become autocratic.",
        "part": "noun",
        "definition": "the condition of being held back or limited",
        "level": "Basic Words"
    },
    "didactic": {
        "example": "Tolstoy's The Death of Ivan Illyich is a didactic novel, instructing the reader on how to live a good life.",
        "part": "adjective",
        "definition": "instructive (especially excessively)",
        "level": "Common (High-frequency) Words"
    },
    "sentimental": {
        "example": "I don't like romanticism for the same reason I don't like melodramatic acting and soap operas--overly sentimental.",
        "part": "adjective",
        "definition": "effusively or insincerely emotional, especially in art, music, and literature",
        "level": "Basic Words"
    },
    "complicit": {
        "example": "nature. While the grand jury cleared the senator of all criminal charges, in the public mind he was still complicit in the corruption.",
        "part": "adjective",
        "definition": "Associated with or participating in an activity, especially one of a questionable",
        "level": "Advanced Words"
    },
    "wax": {
        "example": "Her enthusiasm for the diva's new album only waxed with each song; by the end of the album, it was her favorite CD yet.",
        "part": "verb",
        "definition": "to gradually increase in size or intensity",
        "level": "Basic Words"
    },
    "cumbersome": {
        "example": "Only ten years ago, being an avid reader and a traveler meant carrying a cumbersome backpack stuffed with books--these days we need only an e-reader.",
        "part": "adjective",
        "definition": "difficult to handle or use especially because of size or weight",
        "level": "Basic Words"
    },
    "inveterate": {
        "example": "He is an inveterate smoker and has told his family and friends that there is no way he will ever quit.",
        "part": "adjective",
        "definition": "habitual",
        "level": "Common (High-frequency) Words"
    },
    "docile": {
        "example": "Barnyard animals are considerably more docile than the wild animals.",
        "part": "adjective",
        "definition": "easily handled or managed; willing to be taught or led or supervised or directed",
        "level": "Basic Words"
    },
    "qualm": {
        "example": "While he could articulate no clear reason why Harkner's plan would fail, he neverless felt qualms about committing any resources to it.",
        "part": "noun",
        "definition": "uneasiness about the fitness of an action",
        "level": "Basic Words"
    },
    "contrite": {
        "example": "Though he stole his little sister's licorice stick with malevolent glee, Chucky soon became contrite when his sister wouldn't stop crying.",
        "part": "adjective",
        "definition": "to be remorseful",
        "level": "Basic Words"
    },
    "diatribe": {
        "example": "Steve's mom launched into a diatribe during the PTA meeting, contending that the school was little more than a daycare in which students stare at the wall and teachers stare at the chalkboard.",
        "part": "noun",
        "definition": "a strong verbal attack against a person or institution",
        "level": "Advanced Words"
    },
    "punctilious": {
        "example": "The colonel was so punctilious about enforcing regulations that men fell compelled to polish even the soles of their shoes.",
        "part": "adjective",
        "definition": "marked by precise accordance with details",
        "level": "Advanced Words"
    },
    "enormity": {
        "example": "The enormity of Pol Pot's regime is hard to capture in words--within months hundreds of thousands of Cambodians lost their lives.",
        "part": "noun",
        "definition": "an act of extreme wickedness",
        "level": "Advanced Words"
    },
    "demur": {
        "example": "Wallace disliked the cold, so he demurred when his friends suggested they going skiing in the Alps.",
        "part": "verb",
        "definition": "to object or show reluctance",
        "level": "Common (High-frequency) Words"
    },
    "edifying": {
        "example": "I recently read an article in the Times about whether good literature is edifying or not; specifically, does reading more make a person more moral.",
        "part": "adjective",
        "definition": "enlightening or uplifting so as to encourage intellectual or moral improvement",
        "level": "Common (High-frequency) Words"
    },
    "irk": {
        "example": "My little sister has a way of irking and annoying me like no other person.",
        "part": "verb",
        "definition": "irritate or vex",
        "level": "Basic Words"
    },
    "curmudgeon": {
        "example": "Since Uncle Mike was the family curmudgeon, each Thanksgiving he was plied with copious amounts of wine, in the hope that she would become less grouchy.",
        "part": "noun",
        "definition": "a grouchy, surly person",
        "level": "Advanced Words"
    },
    "genteel": {
        "example": "A live string quartet would provide a more genteel air to the wedding than would a folk singer.",
        "part": "adjective",
        "definition": "marked by refinement in taste and manners",
        "level": "Basic Words"
    },
    "restive": {
        "example": "The crowd grew restive as the comedian's opening jokes fell flat.",
        "part": "adjective",
        "definition": "restless",
        "level": "Common (High-frequency) Words"
    },
    "invidious": {
        "example": "At a time when many others in the office were about to be laid off, many considered Cheryl's fine clothes that day an invidious display.",
        "part": "adjective",
        "definition": "likely to cause resentment",
        "level": "Advanced Words"
    },
    "precipitous": {
        "example": "He was expecting a precipitous rise in the value of a \"hot\" tech stock, so he was disappointed when it only inched up a dollar or two each day.",
        "part": "adjective",
        "definition": "done with very great haste and without due deliberation",
        "level": "Common (High-frequency) Words"
    },
    "urbane": {
        "example": "experience Because of his service as an intelligence officer and his refined tastes, W. Somerset Maugham became the inspiration for the urbane and sophistcate spy James Bond.",
        "part": "adjective",
        "definition": "showing a high degree of refinement and the assurance that comes from wide social",
        "level": "Basic Words"
    },
    "esoteric": {
        "example": "Map collecting is an esoteric hobby to most, but to geography geeks it is a highly enjoyable pasttime.",
        "part": "adjective",
        "definition": "confined to and understandable by only an enlightened inner circle",
        "level": "Common (High-frequency) Words"
    },
    "becoming": {
        "example": "Her dress was becoming and made her look even more beautiful.",
        "part": "adjective",
        "definition": "appropriate, and matches nicely",
        "level": "Basic Words"
    },
    "specious": {
        "example": "He made a career out of specious arguments and fictional lab results, but lost his job and reputation when his lies were exposed by an article in The New York Times.",
        "part": "adjective",
        "definition": "plausible but false",
        "level": "Common (High-frequency) Words"
    },
    "quisling": {
        "example": "History looks unfavorably upon quislings; indeed they are accorded about the same fondness as Nero--he who watched his city burn down while playing the violin.",
        "part": "noun",
        "definition": "a traitor",
        "level": "Advanced Words"
    },
    "tractable": {
        "example": "taught or molded) Compared to middle school students, who have an untamed wildness about them, high school students are somewhat more tractable.",
        "part": "adjective",
        "definition": "readily reacting to suggestions and influences; easily managed (controlled or",
        "level": "Common (High-frequency) Words"
    },
    "unimpeachable": {
        "example": "After his long and unimpeachable service to the company, Sharat felt that a gold watch was a slap in the face rather than an honor.",
        "part": "adjective",
        "definition": "free of guilt; not subject to blame; beyond doubt or reproach",
        "level": "Advanced Words"
    },
    "unstinting": {
        "example": "Helen is unstinting with her time, often spending hours at the house of a sick friend.",
        "part": "adjective",
        "definition": "very generous",
        "level": "Advanced Words"
    },
    "moment": {
        "example": "Despite the initial hullabaloo, the play was of no great moment in Hampton's writing career, and within a few years the public quickly forgot his foray into theater arts.",
        "part": "noun",
        "definition": "significant and important value",
        "level": "Basic Words"
    },
    "perfunctory": {
        "example": "The short film examines modern perfunctory cleaning rituals such as washing dishes, doing laundry and tooth-brushing.",
        "part": "adjective",
        "definition": "done routinely and with little interest or care",
        "level": "Advanced Words"
    },
    "stem": {
        "example": "To stem the tide of applications, the prestigious Ivy requires that each applicant score at least 330 on the Revised GRE.",
        "part": "verb",
        "definition": "to hold back or limit the flow or growth of something",
        "level": "Basic Words"
    },
    "germane": {
        "example": "The professor wanted to tell the jury in detail about his new book, but the lawyer said it wasn't germane to the charges in the cases.",
        "part": "adjective",
        "definition": "relevant and appropriate",
        "level": "Common (High-frequency) Words"
    },
    "palaver": {
        "example": "During the rain delay, many who had come to see the game palavered, probably hoping that idle chatter would make the time go by faster.",
        "part": "verb",
        "definition": "speak (about unimportant matters) rapidly and incessantly",
        "level": "Advanced Words"
    },
    "semblance": {
        "example": "While the banker maintained a semblance of respectability in public, those who knew him well were familiar with his many crimes.",
        "part": "noun",
        "definition": "an outward or token appearance or form that is deliberately misleading",
        "level": "Advanced Words"
    },
    "harangue": {
        "example": "Tired of his parents haranguing him about his laziness and lack of initiative, Tyler finally moved out of home at the age of thirty-five.",
        "part": "verb",
        "definition": "to deliver a long pompous speech or tirade",
        "level": "Common (High-frequency) Words"
    },
    "scrupulous": {
        "example": "Everyone trusted what he said and followed his example because he was scrupulous and honest.",
        "part": "adjective",
        "definition": "having a sense of right and wrong; principled",
        "level": "Common (High-frequency) Words"
    },
    "snub": {
        "example": "Wheeler was completely qualified for the committee, but the board snubbed him, choosing an obviously lesser qualified candidate instead.",
        "part": "verb",
        "definition": "refuse to acknowledge; reject outright and bluntly",
        "level": "Basic Words"
    },
    "epiphany": {
        "example": "Gary one day had an epiphany that he was a people person; he prompty quit his factory job and began working as a salesman.",
        "part": "noun",
        "definition": "a sudden revelation or moment of insight",
        "level": "Advanced Words"
    },
    "mordant": {
        "example": "While Phil frequently made mordant remarks about company policy overall, he always was considerably gentler in discussing any person in particular.",
        "part": "adjective",
        "definition": "biting and caustic in thought, manner, or style",
        "level": "Advanced Words"
    },
    "bemoan": {
        "example": "While the CFO carefully explained all the reasons for the cuts in benefits, after the meeting employees bemoaned the cuts as further evidence that management was against them.",
        "part": "verb",
        "definition": "express discontent or a stong regret",
        "level": "Advanced Words"
    },
    "buck": {
        "example": "The profits at our firm bucked the general downturn that effected the real estate industry.",
        "part": "verb",
        "definition": "resist",
        "level": "Basic Words"
    },
    "inarticulate": {
        "example": "Although a brilliant economist, Professor Black was completely inarticulate, a terrible lecturer.",
        "part": "adjective",
        "definition": "without or deprived of the use of speech or words",
        "level": "Basic Words"
    },
    "anomalous": {
        "example": "According to those who do not believe in climate change, the extreme weather over the last five years is simply anomalous--average temps should return to average, they believe.",
        "part": "adjective",
        "definition": "not normal",
        "level": "Common (High-frequency) Words"
    },
    "languid": {
        "example": "As the sun beat down and the temperature climbed higher, we spent a languid week lying around the house.",
        "part": "adjective",
        "definition": "not inclined towards physical exertion or effort; slow and relaxed",
        "level": "Common (High-frequency) Words"
    },
    "appease": {
        "example": "Neville Chamberlain, the British prime minister during WWII, tried to appease Hitler and in doing so sent a clear message: you can walk all over us.",
        "part": "verb",
        "definition": "pacify by acceding to the demands of",
        "level": "Common (High-frequency) Words"
    },
    "tumult": {
        "example": "Riots broke out just in front of our apartment building, and the tumult continued late into the night.",
        "part": "noun",
        "definition": "a state of chaos, noise and confusion",
        "level": "Basic Words"
    },
    "travesty": {
        "example": "What I expected to be an intelligent, nuanced historical documentary turned out to be a poorly-produced travesty of the form.",
        "part": "noun",
        "definition": "an absurd presentation of something; a mockery",
        "level": "Common (High-frequency) Words"
    },
    "effacing": {
        "example": "The most admirable teachers and respected leaders are those who are self-effacing, directing attention and praise to their students and workers.",
        "part": "adjective",
        "definition": "reluctant to draw attention to yourself",
        "level": "Advanced Words"
    },
    "decorum": {
        "example": "You will obey the rules of decorum for this courtroom or spend the night in a jail cell, said the judge to the prosecutor.",
        "part": "noun",
        "definition": "propriety in manners and conduct",
        "level": "Common (High-frequency) Words"
    },
    "myriad": {
        "example": "There are a myriad of internet sites hawking pills that claim to boost energy for hours on end.",
        "part": "noun",
        "definition": "a large indefinite number",
        "level": "Common (High-frequency) Words"
    },
    "dogmatic": {
        "example": "Bryan is dogmatic in his belief that the earth is flat, claiming that all pictures of a spherical earth are computer generated.",
        "part": "adjective",
        "definition": "highly opinionated, not accepting that your belief may not be correct",
        "level": "Common (High-frequency) Words"
    },
    "apex": {
        "example": "The Ivy League is considered the apex of the secondary education system.",
        "part": "noun",
        "definition": "the highest point",
        "level": "Basic Words"
    },
    "precedent": {
        "example": "The principal explained that even though one student had done modelling work outside of school, the outfits that student wore in those photographs in no way established a precedent for what could be worn at school dances.",
        "part": "noun",
        "definition": "an example that is used to justify similar occurrences at a later time",
        "level": "Basic Words"
    },
    "spendthrift": {
        "example": "Taking weekly trips to Vegas, Megan was a spendthrift whose excesses eventually caught up to her.",
        "part": "noun",
        "definition": "one who spends money extravagantly",
        "level": "Basic Words"
    },
    "relegate": {
        "example": "When Dexter was unable to fulfill his basic duties, instead of firing him, the boss relegated him to kitchen cleanup.",
        "part": "verb",
        "definition": "assign to a lower position",
        "level": "Basic Words"
    },
    "squelch": {
        "example": "After the dictator consolidated his power, he took steps to squelch all criticism, often arresting any journalist who said anything  that could be interpreted as negative about his regime.",
        "part": "verb",
        "definition": "suppress or crush completely",
        "level": "Advanced Words"
    },
    "contrive": {
        "example": "Despite a low GPA, he contrived to get into college, going so far as to write his own glowing letters of recommendation.",
        "part": "verb",
        "definition": "to pull off a plan or scheme, usually through skill or trickery",
        "level": "Common (High-frequency) Words"
    },
    "deter": {
        "example": "The government's primary job should invlove deterring paths to war, not finding ways to start them.",
        "part": "verb",
        "definition": "try to prevent; show opposition to",
        "level": "Basic Words"
    },
    "begrudge": {
        "example": "We never begrudge money spent on ourselves.",
        "part": "verb",
        "definition": "to give reluctantly",
        "level": "Basic Words"
    },
    "extant": {
        "example": "Despite many bookstores closing, experts predict that some form of book dealing will still be extant generations from now.",
        "part": "adjective",
        "definition": "the opposite of extinct",
        "level": "Common (High-frequency) Words"
    },
    "futile": {
        "example": "I thought I could repair the car myself, but after two days of work with no success, I have to admit that my efforts were futile.",
        "part": "adjective",
        "definition": "producing no result or effect; unproductive of success",
        "level": "Basic Words"
    },
    "egregious": {
        "example": "The dictator's abuse of human rights was so egregious that many world leaders asked that he be tried in an international court for genocide.",
        "part": "adjective",
        "definition": "standing out in negative way; shockingly bad",
        "level": "Common (High-frequency) Words"
    },
    "noisome": {
        "example": "Each August, when the winds moved in a south easterly direction, the garbage dump would spread noisome vapors through the small town.",
        "part": "adjective",
        "definition": "having an extremely bad smell",
        "level": "Advanced Words"
    },
    "differentiate": {
        "example": "environment Animals on Madagascar differentiated from other similar animal species due to many years of isolation on the island.",
        "part": "verb",
        "definition": "evolve so as to lead to a new species or develop in a way most suited to the",
        "level": "Basic Words"
    },
    "abrogate": {
        "example": "As part of the agreement between the labor union and the company, the workers abrogated their right to strike for four years in exchange for better health insurance.",
        "part": "verb",
        "definition": "revoke formally",
        "level": "Advanced Words"
    },
    "negligible": {
        "example": "The GRE tests cumulative knowledge, so if you cram the night before it is, at best, likely to only have a negligible impact on your score.",
        "part": "adjective",
        "definition": "so small as to be meaningless; insignificant",
        "level": "Common (High-frequency) Words"
    },
    "disingenuous": {
        "example": "Many adults think that they can lie to children, but kids are smart and know when people are disingenuous.",
        "part": "adjective",
        "definition": "not straightforward; giving a false appearance of frankness",
        "level": "Advanced Words"
    },
    "objurgate": {
        "example": "The manager spent an hour objurgating the employee in the hopes that he would not make these mistakes again.",
        "part": "verb",
        "definition": "express strong disapproval of",
        "level": "Advanced Words"
    },
    "quip": {
        "part": "noun",
        "definition": "a witty saying or remark",
        "level": "Basic Words"
    },
    "abysmal": {
        "example": "Coach Ramsey took his newest player off the field after watching a few painful minutes of her abysmal performance.",
        "part": "adjective",
        "definition": "extremely bad",
        "level": "Basic Words"
    },
    "atavism": {
        "example": "Much of the modern art movement was an atavism to a style of art found only in small villages through Africa and South America.",
        "part": "noun",
        "definition": "a reappearance of an earlier characteristic; throwback",
        "level": "Advanced Words"
    },
    "arrant": {
        "example": "An arrant fool, Lawrence surprised nobody when he lost all his money in a pyramid scheme that was every bit as transparent as it was corrupt.",
        "part": "adjective",
        "definition": "complete and wholly (usually modifying a noun with negative connotation)",
        "level": "Advanced Words"
    },
    "demure": {
        "example": "The portrait of her in a simple white blouse was sweet and demure.",
        "part": "adjective",
        "definition": "to be modest and shy",
        "level": "Basic Words"
    },
    "kowtow": {
        "example": "Paul kowtowed to his boss so often the boss herself became nauseated by his sycophancy.",
        "part": "verb",
        "definition": "to bow or act in a subservient manner",
        "level": "Advanced Words"
    },
    "nadir": {
        "example": "For many pop music fans, the rap and alternative-rock dominated 90s were the nadir of musical expression.",
        "part": "noun",
        "definition": "the lowest point",
        "level": "Advanced Words"
    },
    "umbrage": {
        "example": "Since he was so in love with her, he took umbrage at her comments, even though she had only meant to gently tease him.",
        "part": "noun",
        "definition": "a feeling of anger caused by being offended",
        "level": "Advanced Words"
    },
    "steadfast": {
        "example": "A good captain needs to be steadfast, continuing to hold the wheel and stay the course even during the most violent storm.",
        "part": "adjective",
        "definition": "marked by firm determination or resolution; not shakable",
        "level": "Basic Words"
    },
    "meander": {
        "example": "A casual observer might have thought that Peter was meandering through the city, but that day he was actually seeking out those places where he and his long lost love had once visited.",
        "part": "verb",
        "definition": "to wander aimlessly",
        "level": "Basic Words"
    },
    "inscrutable": {
        "example": "His speech was so dense and confusing that many in the audience found it inscrutable.",
        "part": "adjective",
        "definition": "not easily understood; unfathomable",
        "level": "Common (High-frequency) Words"
    },
    "sententious": {
        "part": "adjective",
        "definition": "to be moralizing, usually in a pompous sense",
        "level": "Advanced Words"
    },
    "panache": {
        "example": "Jim, with his typical panache, came to the wedding reception with a top hat, a cane, and a long cape covered in sequins.",
        "part": "noun",
        "definition": "distinctive and stylish elegance",
        "level": "Common (High-frequency) Words"
    },
    "dilatory": {
        "example": "Lawyers use dilatory tactics so that it takes years before the case is actually decided.",
        "part": "adjective",
        "definition": "wasting time",
        "level": "Common (High-frequency) Words"
    },
    "ossify": {
        "example": "Even as a young man, Bob had some bias against poor people, but during his years in social services, his bad opinions ossified into unshiftable views.",
        "part": "verb",
        "definition": "make rigid and set into a conventional pattern",
        "level": "Advanced Words"
    },
    "affable": {
        "example": "For all his surface affability, Marco was remarkably glum when he wasn't around other people.",
        "part": "adjective",
        "definition": "likeable; easy to talk to",
        "level": "Basic Words"
    },
    "apprehension": {
        "example": "Test day can be one of pure apprehension, as many students worry about their test scores.",
        "part": "noun",
        "definition": "fearful expectation",
        "level": "Basic Words"
    },
    "reservation": {
        "example": "I was initially excited by the idea of a trip to Washington, D.C.  but now that I have read about the high crime statistics there, I have some reservations.",
        "part": "noun",
        "definition": "an unstated doubt that prevents you from accepting something wholeheartedly",
        "level": "Basic Words"
    },
    "ollyannaish": {
        "example": "Even in the midst of a lousy sales quarter, Debbie remained Pollyannaish, never losing her shrill voice and wide smile, even when prospective customers hung up on her.",
        "part": "adjective",
        "definition": "extremely optimistic",
        "level": "Advanced Words"
    },
    "apostate": {
        "example": "An apostate of the Republican Party, Sheldon has yet to become affiliated with any party and dubs himself an independent.",
        "part": "noun",
        "definition": "a person who has abandoned a religious faith or cause",
        "level": "Advanced Words"
    },
    "erudite": {
        "example": "Before the Internet, the library was typically were you would find erudite readers.",
        "part": "adjective",
        "definition": "having or showing profound knowledge",
        "level": "Common (High-frequency) Words"
    },
    "sardonic": {
        "example": "A stand-up comedian walks a fine line when making jokes about members of the audience; such fun and joking can quickly become sardonic and cutting.",
        "part": "adjective",
        "definition": "disdainfully or ironically humorous; scornful and mocking",
        "level": "Advanced Words"
    },
    "lampoon": {
        "example": "Mark Twain understood that lampooning a bad idea with humor was the most effective criticism.",
        "part": "verb",
        "definition": "ridicule with satire",
        "level": "Advanced Words"
    },
    "tendentious": {
        "example": "Because political mudslinging has become a staple of the 24-hour media cycle, most of us, despite protestations to the contrary, are tendentious on many of today's pressing issues.",
        "part": "adjective",
        "definition": "likely to lean towards a controversial view",
        "level": "Advanced Words"
    },
    "lacerate": {
        "example": "The teacher was fired for lacerating a student who wrote a poor essay.",
        "part": "verb",
        "definition": "deeply hurt the feelings of; distress",
        "level": "Advanced Words"
    },
    "arduous": {
        "example": "In order to deal with the arduous cross-country journey, truck drivers often survive on a string of caffeinated drinks, staying awake for up to 30 hours at a time.",
        "part": "adjective",
        "definition": "demanding considerable mental effort and skill; testing powers of endurance",
        "level": "Common (High-frequency) Words"
    },
    "exorbitant": {
        "example": "Shelley made one exorbitant purchase after another, buying new clothes and taking vacations even though she earned a limited salary.",
        "part": "adjective",
        "definition": "greatly exceeding bounds of reason or moderation",
        "level": "Advanced Words"
    },
    "splenetic": {
        "example": "Ever since the car accident, Frank has been unable to walk without a cane, and so he has become splenetic and unpleasant to be around.",
        "part": "adjective",
        "definition": "very irritable",
        "level": "Advanced Words"
    },
    "culpability": {
        "example": "Since John had left his banana peel at the top of the stairwell, he accepted culpability for Martha's broken leg.",
        "part": "noun",
        "definition": "a state of guilt",
        "level": "Common (High-frequency) Words"
    },
    "choleric": {
        "example": "While a brilliant lecturer, Mr. Dawson came across as choleric and unapproachable--very rarely did students come to his office hours.",
        "part": "adjective",
        "definition": "prone to outbursts of temper; easily angered",
        "level": "Advanced Words"
    },
    "castigate": {
        "example": "Drill sergeants are known to castigate new recruits so mercilessly that the latter often break down during their first week in training.",
        "part": "verb",
        "definition": "to reprimand harshly",
        "level": "Common (High-frequency) Words"
    },
    "gainsay": {
        "example": "I can't gainsay a single piece of evidence James has presented, but I still don't trust his conclusion.",
        "part": "verb",
        "definition": "deny or contradict; speak against or oppose",
        "level": "Common (High-frequency) Words"
    },
    "treacherous": {
        "example": "The bridge built from twine and vine is treacherous to walk across, and so I think I will stay put right here.",
        "part": "adjective",
        "definition": "dangerously unstable and unpredictable",
        "level": "Common (High-frequency) Words"
    },
    "blinkered": {
        "example": "In gambling, the addict is easily blinkered by past successes and/or past failures, forgetting that the outcome of any one game is independent of the games that preceded it.",
        "part": "adjective",
        "definition": "to have a limited outlook or understanding",
        "level": "Advanced Words"
    },
    "vilify": {
        "example": "Todd was noble after the divorce, choosing to say only complimentary things about Barbara, but Barbara did not hesitate to vilify Todd.",
        "part": "verb",
        "definition": "spread negative information about",
        "level": "Common (High-frequency) Words"
    },
    "attenuate": {
        "example": "Her animosity towards Bob attenuated over the years, and she even went so far as to invite him to her party.",
        "part": "verb",
        "definition": "to weaken (in terms of intensity); to taper off/become thinner.",
        "level": "Advanced Words"
    },
    "peremptory": {
        "example": "My sister used to peremptorily tell me to do the dishes, a chore I would either do perfunctorily or avoid doing altogether.",
        "part": "adjective",
        "definition": "bossy and domineering",
        "level": "Advanced Words"
    },
    "guileless": {
        "example": "At first I thought my niece was guileless, but I then found myself buying her ice cream every time we passed a shop.",
        "part": "adjective",
        "definition": "free of deceit",
        "level": "Common (High-frequency) Words"
    },
    "advocate": {
        "part": "noun",
        "definition": "a person who pleads for a cause or propounds an idea",
        "level": "Basic Words"
    },
    "provisional": {
        "example": "Until the corporate office hands down a definitive decision on use of the extra offices, we will share their use in a provisional arrangement.",
        "part": "adjective",
        "definition": "under terms not final or fully worked out or agreed upon",
        "level": "Basic Words"
    },
    "histrionic": {
        "example": "Though she received a B- on the test, she had such a histrionic outburst that one would have thought that she'd been handed a death sentence.",
        "part": "adjective",
        "definition": "to be overly theatrical",
        "level": "Advanced Words"
    },
    "subsume": {
        "example": "Don Quixote of La Mancha subsumes all other modern novels, demonstrating modern literary devices and predating even the idea of a postmodern, metanarrative.",
        "part": "verb",
        "definition": "consider (an instance of something) as part of a general rule or principle",
        "level": "Common (High-frequency) Words"
    },
    "haphazard": {
        "example": "Many golf courses are designed with great care, but the greens on the county golf course seem entirely haphazard.",
        "part": "adjective",
        "definition": "marked by great carelessness; dependent upon or characterized by chance",
        "level": "Common (High-frequency) Words"
    },
    "penurious": {
        "example": "Warren Buffett, famous multi-billionaire,  still drives a cheap sedan, not because he is penurious, but because luxury cars are gaudy and impractical.",
        "part": "adjective",
        "definition": "miserly",
        "level": "Advanced Words"
    },
    "solicitude": {
        "example": "I walked to his house in the rain to make sure he had enough to eat while he was sick, but he seemed not to appreciate my solicitude.",
        "part": "noun",
        "definition": "a feeling of excessive concern",
        "level": "Advanced Words"
    },
    "pariah": {
        "example": "The once eminent scientist, upon being found guilty of faking his data, has become a pariah in the research community.",
        "part": "noun",
        "definition": "an outcast",
        "level": "Advanced Words"
    },
    "demean": {
        "example": "At first the soccer players bantered back and forth, but as soon as one of the players became demeaning, calling the other's mother a water buffalo, the ref whipped out a red card.",
        "part": "verb",
        "definition": "to insult; to cause someone to lose dignity or respect",
        "level": "Basic Words"
    },
    "inanity": {
        "example": "Bill's poem was nothing more than a list of impressive sounding words, so there was no point in trying to take meaning from the inanity.",
        "part": "noun",
        "definition": "total lack of meaning or ideas",
        "level": "Advanced Words"
    },
    "tender": {
        "example": "The government was loath to tender more money in the fear that it might set off inflation.",
        "part": "verb",
        "definition": "offer up something formally",
        "level": "Basic Words"
    },
    "placate": {
        "example": "I was able to placate the angry mob of students by promising to bring cookies on Monday.",
        "part": "verb",
        "definition": "cause to be more favorably inclined; gain the good will of",
        "level": "Common (High-frequency) Words"
    },
    "ersatz": {
        "example": "The car dealer's ersatz laughter was immediately followed by a price quote, one that Shelley found highly inflated.",
        "part": "adjective",
        "definition": "not real or genuine; phony",
        "level": "Advanced Words"
    },
    "appropriate": {
        "example": "The committe appropriated the funds to its various members.",
        "part": "verb",
        "definition": "to allocate",
        "level": "Advanced Words"
    },
    "nonchalant": {
        "example": "The twenty-somethings at the coffee shop always irked Sheldon, especially the way in which they acted nonchalantly towards everything, not even caring when Sheldon once spilled his mocha on them.",
        "part": "adjective",
        "definition": "coming across as cooly uninterested",
        "level": "Advanced Words"
    },
    "pith": {
        "example": "When Cynthia hears a speaker presenting a complex argument, she is always able to discard the irrelevant details and extract the pith of what the speaker is trying to convey.",
        "part": "noun",
        "definition": "the most essential part of something",
        "level": "Advanced Words"
    },
    "forlorn": {
        "example": "After her third pet dog died, Marcia was simply forlorn: this time even the possibility of buying a new dog no longer held any joy.",
        "part": "adjective",
        "definition": "marked by or showing hopelessness",
        "level": "Common (High-frequency) Words"
    },
    "start": {
        "example": "All alone in the mansion, Henrietta started when she heard a sound.",
        "part": "verb",
        "definition": "to suddenly move in a particular direction",
        "level": "Basic Words"
    },
    "denouement": {
        "example": "outcome of a complex sequence of events At the denouement of the movie, all questions were answered, and the true identity of the robber was revealed.",
        "part": "noun",
        "definition": "the final resolution of the many strands of a literary or dramatic work; the",
        "level": "Advanced Words"
    },
    "banality": {
        "example": "Herbert regarded the minister's remark as a mere banality until Sharon pointed out profound implications to the seemingly obvious words.",
        "part": "noun",
        "definition": "a trite or obvious remark",
        "level": "Common (High-frequency) Words"
    },
    "obstinate": {
        "example": "The coach suggested improvements Sarah might make on the balance beam, but she remained obstinate, unwilling to modify any of the habits that made her successful in the past.",
        "part": "adjective",
        "definition": "resistant to guidance or discipline; stubbornly persistent",
        "level": "Basic Words"
    },
    "circumscribe": {
        "example": "Their tour of South America was circumscribed so that they saw only popular destinations and avoided the dangerous parts of cities.",
        "part": "verb",
        "definition": "restrict or confine",
        "level": "Common (High-frequency) Words"
    },
    "construe": {
        "example": "The author's inability to take a side on the issue was construed by both his opponents and supporters as a sign of weakness.",
        "part": "verb",
        "definition": "interpreted in a particular way",
        "level": "Common (High-frequency) Words"
    },
    "machinate": {
        "example": "The rebels met at night in an abandoned barn to machinate.",
        "part": "verb",
        "definition": "engage in plotting or enter into a conspiracy, swear together",
        "level": "Advanced Words"
    },
    "arrogate": {
        "example": "Arriving at the small town, the outlaw arrogated the privileges of a lord, asking the frightened citizens to provide food, drink, and entertainment.",
        "part": "verb",
        "definition": "seize and control without authority",
        "level": "Advanced Words"
    },
    "tempestuous": {
        "example": "changing or fluctuating Chuck and Kathy had always been stable and agreeable people on their own, but when they got involved, it was a tempestuous relationship.",
        "part": "adjective",
        "definition": "as if driven by turbulent or conflicting emotions; highly energetic and wildly",
        "level": "Advanced Words"
    },
    "incisive": {
        "example": "The lawyer had an incisive mind, able in a flash to dissect a hopelessly tangled issue and isolate the essential laws at play.",
        "part": "adjective",
        "definition": "having or demonstrating ability to recognize or draw fine distinctions",
        "level": "Common (High-frequency) Words"
    },
    "credence": {
        "example": "He placed no credence in psychics, claiming that they offered no special powers beyond the ability to make people part with their money.",
        "part": "noun",
        "definition": "belief in something",
        "level": "Basic Words"
    },
    "vindicate": {
        "example": "Even seven Tour de France wins cannot vindicate Lance Armstrong in the eyes of the public--that the athlete used performance enhancing drugs invalidates all those wins.",
        "part": "verb",
        "definition": "to clear of accusation, blame, suspicion, or doubt with supporting arguments or proof",
        "level": "Common (High-frequency) Words"
    },
    "pedestrian": {
        "example": "While Nan was always engaged in philosophical speculation, her brother was occupied with far more pedestrian concerns: how to earn a salary and run a household.",
        "part": "adjective",
        "definition": "lacking imagination",
        "level": "Common (High-frequency) Words"
    },
    "fleece": {
        "example": "Many people have been fleeced by Internet scams and never received their money back.",
        "part": "verb",
        "definition": "to deceive",
        "level": "Basic Words"
    },
    "vociferous": {
        "example": "In giving Marcia a particular vociferous response, Paul caused people at every other table in the restaurant to turn around an look at them angrily.",
        "part": "adjective",
        "definition": "conspicuously and offensively loud; given to vehement outcry",
        "level": "Common (High-frequency) Words"
    },
    "indict": {
        "example": "The bankrobber was indicted on several major charges, including possession of a firearm.",
        "part": "verb",
        "definition": "to formally charge or accuse of wrong-doing",
        "level": "Basic Words"
    },
    "expurgate": {
        "example": "The censor expurgated every reference to sex and drugs, converting the rapper's raunchy flow into a series of bleeps.",
        "part": "verb",
        "definition": "to remove objectionable material",
        "level": "Advanced Words"
    },
    "quotidian": {
        "example": "Phil gets so involved thinking about Aristotle's arguments that he totally forgets quotidian concerns, such as exercising and eating regularly.",
        "part": "adjective",
        "definition": "found in the ordinary course of events",
        "level": "Common (High-frequency) Words"
    },
    "elaborate": {
        "example": "Most high school physics teachers find themselves elaborating the same point over and over again, since many concepts confuse students.",
        "part": "verb",
        "definition": "explain in more detail",
        "level": "Basic Words"
    },
    "sartorial": {
        "example": "Monte was astute at navigating the world of finance; sartorially, however, he was found wanting--he typically would attempt to complement his beige tie with a gray suit and white pants.",
        "part": "adjective",
        "definition": "related to fashion or clothes",
        "level": "Advanced Words"
    },
    "dupe": {
        "example": "The charlatan mistook the crowd for a bunch of dupes, but the crowd was quickly on to him and decried his bald-faced attempt to bilk them.",
        "part": "noun",
        "definition": "a person who is easily tricked or swindled",
        "level": "Basic Words"
    },
    "abstruse": {
        "example": "Physics textbooks can seem so abstruse to the uninitiated that readers feel as though they are looking at hieroglyphics.",
        "part": "adjective",
        "definition": "difficult to understand; incomprehensible",
        "level": "Common (High-frequency) Words"
    },
    "malfeasance": {
        "example": "Not even the mayor's trademark pearly-toothed grin could save him from charges of malfeasance: while in power, he'd been running an illegal gambling rink in the room behind his office.",
        "part": "adjective",
        "definition": "misconduct or wrongdoing (especially by a public official)",
        "level": "Advanced Words"
    },
    "fortuitous": {
        "example": "While the real objects are vastly different sizes in space, the sun and the moon seem to have the same fortuitous size in the sky.",
        "part": "adjective",
        "definition": "occurring by happy chance; having no cause or apparent cause",
        "level": "Common (High-frequency) Words"
    },
    "defray": {
        "example": "In order for Sean to attend the prestigious college, his generous uncle helped defray the excessive tuition with a monthly donation.",
        "part": "verb",
        "definition": "to help pay the cost of, either in part of full",
        "level": "Advanced Words"
    },
    "recondite": {
        "example": "knowledge I found Ulysses recondite and never finished the book, waiting instead to read it with someone else so we could penetrate its meaning together.",
        "part": "adjective",
        "definition": "difficult to penetrate; incomprehensible to one of ordinary understanding or",
        "level": "Common (High-frequency) Words"
    },
    "misanthrope": {
        "example": "Hamilton had been deceived so many times in his life that he hid behind the gruff exterior of a misanthrope, lambasting perfect strangers for no apparent reason.",
        "part": "noun",
        "definition": "a hater of mankind",
        "level": "Basic Words"
    },
    "doughty": {
        "example": "I enjoy films in which a doughty group comes together to battle a force of evil.",
        "part": "adjective",
        "definition": "brave; bold; courageous",
        "level": "Advanced Words"
    },
    "stultify": {
        "example": "As an undergraduate Mark felt stultified by classes outside his area of study; only in grad school, in which he could focus solely on literary analysis, did he regain his scholarly edge.",
        "part": "verb",
        "definition": "cause one, through routine, to lose energy and enthusiasm",
        "level": "Advanced Words"
    },
    "ponderous": {
        "example": "Laden with 20 kilograms of college text books, the freshman moved ponderously across the campus.",
        "part": "adjective",
        "definition": "weighed-down; moving slowly",
        "level": "Advanced Words"
    },
    "venality": {
        "example": "Even some of the most sacrosanct sporting events are not immune to venality, as many of the officials have received substantial bribes to make biased calls.",
        "part": "noun",
        "definition": "the condition of being susceptible to bribes or corruption",
        "level": "Common (High-frequency) Words"
    },
    "eschew": {
        "example": "Politicians are the masters of eschewing morals; academics are the masters of eschewing clarity.",
        "part": "verb",
        "definition": "avoid and stay away from deliberately; stay clear of",
        "level": "Common (High-frequency) Words"
    },
    "wanton": {
        "example": "appetites Due to wanton behavior and crude language, the drunk man was thrown out of the bar and asked to never return.",
        "part": "adjective",
        "definition": "without check or limitation; showing no moral restraints to one's anger, desire, or",
        "level": "Basic Words"
    },
    "deleterious": {
        "example": "The BP oil spill in the Gulf of Mexico was deleterious to the fishing industry in the southern states.",
        "part": "adjective",
        "definition": "harmful to living things",
        "level": "Common (High-frequency) Words"
    },
    "approbatory": {
        "example": "Although it might not be her best work, Hunter's new novel has received generally approbatory reviews.",
        "part": "adjective",
        "definition": "expressing praise or approval",
        "level": "Advanced Words"
    },
    "aboveboard": {
        "example": "The mayor, despite his avuncular face plastered about the city, was hardly aboveboard -- some concluded that it was his ingratiating smile that allowed him to engage in corrupt behavior and get away with it.",
        "part": "adjective",
        "definition": "open and honest",
        "level": "Basic Words"
    },
    "inimical": {
        "example": "Venus, with a surface temperature that would turn rubber to liquid, is inimical to any form of life.",
        "part": "adjective",
        "definition": "hostile (usually describes conditions or environments)",
        "level": "Common (High-frequency) Words"
    },
    "amply": {
        "example": "The boat was amply supplied for its year at sea--no man would go hungry or thirst.",
        "part": "adverb",
        "definition": "more than is adequate",
        "level": "Basic Words"
    },
    "sporadic": {
        "example": "The signals were at first sporadic, but now we detect a clear, consistent pattern of electromagnetic radiation eminating from deep space.",
        "part": "adjective",
        "definition": "recurring in scattered and irregular or unpredictable instances",
        "level": "Common (High-frequency) Words"
    },
    "iconoclastic": {
        "example": "Jackson Pollack was an iconoclastic artist, totally breaking with tradition by splashing paint on a blank canvas.",
        "part": "adjective",
        "definition": "defying tradition or convention",
        "level": "Common (High-frequency) Words"
    },
    "disheartened": {
        "example": "After the visiting team scored nine times, the home team's fans were disheartened, some leaving the game early.",
        "part": "adjective",
        "definition": "made less hopeful or enthusiastic",
        "level": "Basic Words"
    },
    "remiss": {
        "example": "Remiss in his duty to keep the school functioning efficiently, the principle was relieved of his position after only three months.",
        "part": "adjective",
        "definition": "to be negligent in one\"s duty",
        "level": "Basic Words"
    },
    "euphoria": {
        "example": "The euphoria of winning her first gold medal in the 100 meter dash overwhelmed Shelly-Ann Fraser and she wept tears of immense joy.",
        "part": "noun",
        "definition": "a feeling of great (usually exaggerated) elation",
        "level": "Basic Words"
    },
    "bastardization": {
        "example": "The movie World War Z is a complete bastardization of the book with little more in common than zombies and a title.",
        "part": "noun",
        "definition": "an act that debases or corrupts",
        "level": "Advanced Words"
    },
    "whimsical": {
        "example": "Adults look to kids and envy their whimsical nature at times, wishing that they could act without reason and play without limitation.",
        "part": "adjective",
        "definition": "determined by impulse or whim rather than by necessity or reason",
        "level": "Basic Words"
    },
    "ineluctable": {
        "example": "For those who smoke cigarettes for years, a major health crisis brought on by smoking is ineluctable.",
        "part": "adjective",
        "definition": "impossible to avoid or evade:",
        "level": "Advanced Words"
    },
    "mundane": {
        "example": "Though we think of the pope as someone always dealing in holy matters, he is also concerned with mundane events, such as deciding when to set his alarm each morning.",
        "part": "adjective",
        "definition": "relating to the ordinary world",
        "level": "Common (High-frequency) Words"
    },
    "precipitate": {
        "example": "The government's mishandling the hurricane's aftermath precipitated a widespread outbreak of looting and other criminal activity.",
        "part": "verb",
        "definition": "to cause to happen",
        "level": "Advanced Words"
    },
    "provincial": {
        "example": "Maggie's enthusiasm about her high school teams seemed provincial to her college classmates, all of whom were following a nationally ranked college team.",
        "part": "adjective",
        "definition": "characteristic of the a limited perspective; not fashionable or sophisticated",
        "level": "Common (High-frequency) Words"
    },
    "enamor": {
        "example": "She is completely enamored with Justin Bieber, and goes to all his concerts on the East coast.",
        "part": "verb",
        "definition": "attraction or feeling of love",
        "level": "Advanced Words"
    },
    "dilettante": {
        "part": "noun",
        "definition": "an amateur who engages in an activity without serious intentions and who pretends",
        "level": "Common (High-frequency) Words"
    },
    "foment": {
        "example": "After having his pay cut, Phil spread vicious rumors about his boss, hoping to foment a general feeling of discontent.",
        "part": "verb",
        "definition": "try to stir up public opinion",
        "level": "Common (High-frequency) Words"
    },
    "dog": {
        "example": "Throughout his life, he was dogged by insecurities that inhibited personal growth.",
        "part": "verb",
        "definition": "to pursue relentlessly; to hound",
        "level": "Basic Words"
    },
    "perspicacious": {
        "example": "Many modern observers regard Eisenhower as perspicacious, particularly in his accurate prediction of the growth of the military.",
        "part": "adjective",
        "definition": "acutely insightful and wise",
        "level": "Advanced Words"
    },
    "indignant": {
        "part": "adjective",
        "definition": "feeling anger over a perceived injustice",
        "level": "Basic Words"
    },
    "stalwart": {
        "example": "Despite all the criticism directed at the President during this scandal, Lisa has remained his stalwart supporter.",
        "part": "adjective",
        "definition": "dependable; inured to fatigue or hardships",
        "level": "Advanced Words"
    },
    "elicit": {
        "example": "Just smiling--even if you are depressed--can elicit feelings of pleasure and happiness.",
        "part": "verb",
        "definition": "call forth (emotions, feelings, and responses)",
        "level": "Common (High-frequency) Words"
    },
    "inimitable": {
        "example": "Mozart's music follows a clear pattern that, anyone could imitate, but his music gives an overall sense of effortlessness that is inimitable.",
        "part": "adjective",
        "definition": "defying imitation; matchless",
        "level": "Advanced Words"
    },
    "bromide": {
        "part": "noun",
        "definition": "a trite or obvious remark",
        "level": "Advanced Words"
    },
    "nuance": {
        "example": "Because of the nuances involved in this case, I hired an outside consultant to advice us and help.",
        "part": "noun",
        "definition": "a subtle difference in meaning or opinion or attitude",
        "level": "Common (High-frequency) Words"
    },
    "amorphous": {
        "example": "His study plan for the GRE was at best amorphous; he would do questions from random pages in any one of seven test prep books.",
        "part": "adjective",
        "definition": "shapeless",
        "level": "Common (High-frequency) Words"
    },
    "trenchant": {
        "example": "penetration in thought, expression, or intellect Jill presented a rather superficial treatment of sales in Asia, but her trenchant analysis of sales in Europe inspired a number of insights into how to proceed in that market.",
        "part": "adjective",
        "definition": "characterized by or full of force and vigor; having keenness and forcefulness and",
        "level": "Advanced Words"
    },
    "artless": {
        "example": "Despite the president's seemingly artless speeches, he was a skilled and ruthless negotiator.",
        "part": "adjective",
        "definition": "without cunning or deceit",
        "level": "Advanced Words"
    },
    "coterminous": {
        "example": "The border of the state is coterminous with geographic limits on travel; the east and north are surrounded by a nearly uncrossable river and the south by a desert.",
        "part": "adjective",
        "definition": "being of equal extent or scope or duration",
        "level": "Advanced Words"
    },
    "veritable": {
        "example": "Frank is a veritable life-saver -- last year, on two different occasions, he revived people using CPR.",
        "part": "adjective",
        "definition": "truthfully, without a doubt",
        "level": "Advanced Words"
    },
    "impervious": {
        "example": "I am not impervious to your insults; they cause me great pain.",
        "part": "adjective",
        "definition": "not admitting of passage or capable of being affected",
        "level": "Advanced Words"
    },
    "complacent": {
        "example": "After the water polo team won their sixth championship, they became complacent and didn't even make it to the playoffs the next year.",
        "part": "adjective",
        "definition": "contented to a fault with oneself or one's actions",
        "level": "Basic Words"
    },
    "chivalrous": {
        "example": "Marco's chivalrous ways, like opening doors and pulling out chairs, was much appreciated by his date.",
        "part": "adjective",
        "definition": "being attentive to women like an ideal knight",
        "level": "Basic Words"
    },
    "truncate": {
        "example": "The soccer game was truncated when the monsoon rain began to fall.",
        "part": "verb",
        "definition": "reduce the length of something",
        "level": "Common (High-frequency) Words"
    },
    "untenable": {
        "example": "With the combination of Kepler's brilliant theories and Galileo's telescopic observations, the old geocentric theory became untenable to most of the educated people in Europe.",
        "part": "adjective",
        "definition": "(of theories etc) incapable of being defended or justified",
        "level": "Advanced Words"
    },
    "heyday": {
        "example": "During the heyday of Prohibition, bootlegging had become such a lucrative business that many who had been opposed to the 18th Amendment began to fear it would be repealed.",
        "part": "noun",
        "definition": "the pinnacle or top of a time period or career",
        "level": "Basic Words"
    },
    "loath": {
        "example": "I was loath to leave the concert before my favorite band finished playing.",
        "part": "adjective",
        "definition": "unwillingness to do something contrary to your custom (usually followed by 'to')",
        "level": "Advanced Words"
    },
    "exalt": {
        "example": "The teenagers exalted the rock star, covering their bedrooms with posters of him.",
        "part": "verb",
        "definition": "praise or glorify",
        "level": "Common (High-frequency) Words"
    },
    "calumny": {
        "example": "With the presidential primaries well under way, the air is thick with calumny, and the mud already waist- high.",
        "part": "noun",
        "definition": "making of a false statement meant to injure a person\"s reputation",
        "level": "Common (High-frequency) Words"
    },
    "prescience": {
        "example": "Baxter's warnings about investing in technology stocks seemed like an act of prescience after the whole market declined significantly.",
        "part": "noun",
        "definition": "the power to foresee the future",
        "level": "Common (High-frequency) Words"
    },
    "palimpsest": {
        "example": "iterations can still be seen The downtown was a palimpsest of the city's checkered past: a new Starbucks had opened up next to an abandoned, shuttered building, and a freshly asphalted road was inches away from a pothole large enough to swallow a small dog.",
        "part": "noun",
        "definition": "something that has been changed numerous times but on which traces of former",
        "level": "Advanced Words"
    },
    "conciliate": {
        "example": "His opponents believed his gesture to be conciliatory, yet as soon as they put down their weapons, he unsheathed a hidden sword.",
        "part": "verb",
        "definition": "to make peace with",
        "level": "Advanced Words"
    },
    "maladroit": {
        "example": "As a child she was quite maladroit, but as an adult, she has become an adept dancer.",
        "part": "adjective",
        "definition": "clumsy",
        "level": "Common (High-frequency) Words"
    },
    "archaic": {
        "example": "Hoping to sound intelligent, Mary spoke in archaic English that was right out of Jane Austen's Pride and Prejudice--needless to say, she didn't have many friends.",
        "part": "adjective",
        "definition": "so old as to appear to belong to a different period",
        "level": "Basic Words"
    },
    "muted": {
        "example": "Helen preferred muted earth colors, such as green and brown, to the bright pinks and red her sister liked.",
        "part": "adjective",
        "definition": "softened, subdued",
        "level": "Basic Words"
    },
    "impeccable": {
        "example": "He was impeccably dressed in the latest fashion without a single crease or stain.",
        "part": "adjective",
        "definition": "without fault or error",
        "level": "Basic Words"
    },
    "maudlin": {
        "part": "adjective",
        "definition": "overly emotional and sad",
        "level": "Advanced Words"
    },
    "byzantine": {
        "example": "Getting a driver's license is not simply a matter of taking a test; the regulations and procedures are so byzantine that many have found themselves at the mercy of the Department of Motor Vehicles.",
        "part": "adjective",
        "definition": "intricate and complex",
        "level": "Advanced Words"
    },
    "jocular": {
        "example": "My uncle was always in a jocular mood at family gatherings, messing up people's hair and telling knock- knock jokes to anyone who would listen.",
        "part": "adjective",
        "definition": "characterized by jokes and good humor",
        "level": "Basic Words"
    },
    "mendicant": {
        "example": "Tolstoy was an aristocrat, but he strove to understand the Christianity of the Russian peasants by wandering among them as a mendicant.",
        "part": "noun",
        "definition": "a pauper who lives by begging",
        "level": "Advanced Words"
    },
    "effrontery": {
        "example": "The skateboarders acted with effrontery, skating through the church grounds and spray-painting signs warning trespassers.",
        "part": "noun",
        "definition": "audacious (even arrogant) behavior that you have no right to",
        "level": "Advanced Words"
    },
    "endemic": {
        "example": "Irish cuisine makes great use of potatoes, but ironically, the potato is not endemic to Ireland.",
        "part": "adjective",
        "definition": "native; originating where it is found",
        "level": "Basic Words"
    },
    "simulacrum": {
        "example": "The early days of computer graphics made real people into a simalacrum that now seems comical.",
        "part": "noun",
        "definition": "a bad imitation",
        "level": "Advanced Words"
    },
    "solicitous": {
        "example": "Our neighbors are constantly knocking on our door to make sure we are ok, and I don't know how to ask them to stop being so solicitous about our health.",
        "part": "adjective",
        "definition": "showing hovering attentiveness",
        "level": "Advanced Words"
    },
    "broadside": {
        "example": "Political broadsides are usually strongest in the weeks leading up to a national election.",
        "part": "noun",
        "definition": "a strong verbal attack",
        "level": "Advanced Words"
    },
    "raffish": {
        "example": "The men found him raffish, but the women adored his smart clothes and casual attitude.",
        "part": "adjective",
        "definition": "marked by a carefree unconventionality or disreputableness",
        "level": "Basic Words"
    },
    "smattering": {
        "example": "I know only a smattering of German, but Helen is able to read German newspapers and converse with natives.",
        "part": "noun",
        "definition": "a slight or superficial understanding of a subject; a small amount of something",
        "level": "Basic Words"
    },
    "malodorous": {
        "example": "Some thermally active fountains spew sulfur fumes--the air around them is sometimes so malodorous that many have to plug their noses.",
        "part": "adjective",
        "definition": "having an unpleasant smell",
        "level": "Basic Words"
    },
    "brazen": {
        "example": "Their large \"donations\" to the local police department gave the drug cartel the brazen confidence to do their business out in the open.",
        "part": "adjective",
        "definition": "unrestrained by convention or propriety",
        "level": "Common (High-frequency) Words"
    },
    "frivolous": {
        "example": "Compared to Juliet's passionate concern for human rights, Jake's non-stop concern about football seems somewhat frivolous.",
        "part": "adjective",
        "definition": "not serious in content or attitude or behavior",
        "level": "Common (High-frequency) Words"
    },
    "nonplussed": {
        "example": "Shirley was totally nonplussed when the angry motorist cut her off and then stuck his finger out the window.",
        "part": "verb",
        "definition": "unsure how to act or respond",
        "level": "Common (High-frequency) Words"
    },
    "mesmerize": {
        "example": "The plot and the characters were so well developed that many viewers were mesmerized, unable to move their eyes from the screen for even a single second.",
        "part": "verb",
        "definition": "to spellbind or enthrall",
        "level": "Basic Words"
    },
    "winsome": {
        "example": "She was winsome by nature, and many people were drawn to this free and playful spirit.",
        "part": "adjective",
        "definition": "charming in a childlike or naive way",
        "level": "Common (High-frequency) Words"
    },
    "chortle": {
        "example": "Walking past the bar, I could hear happy, chortling people and the blast of horns from a jazz band.",
        "part": "verb",
        "definition": "to chuckle, laugh merrily",
        "level": "Common (High-frequency) Words"
    },
    "betray": {
        "example": "With the gold medal at stake, the gymnast awaited his turn, his quivering lip betraying his intense emotions.",
        "part": "verb",
        "definition": "to reveal or make known something, usually unintentionally",
        "level": "Common (High-frequency) Words"
    },
    "pyrrhic": {
        "example": "George W. Bush's win in the 2000 election was in many ways a pyrrhic victory: the circumstances of his win alienated half of the U.S. population.",
        "part": "adjective",
        "definition": "describing a victory that comes at such a great cost that the victory is not worthwhile",
        "level": "Advanced Words"
    },
    "cornucopia": {
        "example": "The International Food Expo was a cornucopia of culinary delights: gourmet foods from every continent were under one roof.",
        "part": "noun",
        "definition": "an abundant supply of something good",
        "level": "Basic Words"
    },
    "ascendancy": {
        "example": "The ascendancy of the Carlsbad water polo team is clear--they have a decade of championships behind them.",
        "part": "noun",
        "definition": "the state that exists when one person or group has power over another",
        "level": "Basic Words"
    },
    "recapitulation": {
        "example": "Every point of the professors lesson was so clear that the students felt his concluding recapitulation was not necessary.",
        "part": "noun",
        "definition": "a summary (think of recap)",
        "level": "Advanced Words"
    },
    "supplant": {
        "example": "For many, a cell phone has supplanted a traditional phone; in fact, most 20-somethings don't even have a traditional phone anymore.",
        "part": "verb",
        "definition": "take the place or move into the position of",
        "level": "Common (High-frequency) Words"
    },
    "morph": {
        "example": "The earnestness of the daytime talk shows of the 1970's has morphed into something far more sensational and vulgar: today guests actually standup and threaten to take swings at one another.",
        "part": "verb",
        "definition": "To undergo dramatic change in a seamless and barely noticeable fashion.",
        "level": "Basic Words"
    },
    "emulate": {
        "example": "To really become fluent in a new language, emulate the speech patterns and intonation of people who speak the language.",
        "part": "verb",
        "definition": "strive to equal or match, especially by imitating; compete with successfully",
        "level": "Basic Words"
    },
    "timorous": {
        "example": "Since this was her first time debating on stage and before an audience, Di's voice was timorous and quiet for the first 10 minutes.",
        "part": "adjective",
        "definition": "timid by nature or revealing fear and nervousness",
        "level": "Common (High-frequency) Words"
    },
    "base": {
        "example": "She was not so base as to begrudge the beggar the unwanted crumbs from her dinner plate.",
        "part": "adjective",
        "definition": "the lowest, class were without any moral principles",
        "level": "Advanced Words"
    },
    "indecorous": {
        "example": "society Eating with elbows on the table is considered indecorous in refined circles.",
        "part": "adjective",
        "definition": "not in keeping with accepted standards of what is right or proper in polite",
        "level": "Common (High-frequency) Words"
    },
    "unprepossessing": {
        "example": "World leaders coming to meet Gandhi would expect a towering sage, and often would be surprised by the unprepossessing little man dressed only in a loincloth and shawl.",
        "part": "adjective",
        "definition": "creating an unfavorable or neutral first impression",
        "level": "Advanced Words"
    },
    "smug": {
        "example": "When Phil was dating the model, he had a smug attitude that annoyed his buddies.",
        "part": "adjective",
        "definition": "marked by excessive complacency or self-satisfaction",
        "level": "Basic Words"
    },
    "gall": {
        "example": "In an act of gall, Leah sent compromising photos of her ex-boyfriend to all his co-workers and professional contacts.",
        "part": "noun",
        "definition": "feeling of deep and bitter anger and ill-will",
        "level": "Common (High-frequency) Words"
    },
    "raillery": {
        "example": "The new recruit was not bothered by the raillery, finding most of it light-hearted and good-natured.",
        "part": "noun",
        "definition": "light teasing",
        "level": "Advanced Words"
    },
    "laudable": {
        "example": "To say that Gandhi's actions were laudable is the greatest understatement; he overthrew an empire without violence.",
        "part": "adjective",
        "definition": "worthy of high praise",
        "level": "Common (High-frequency) Words"
    },
    "epigram": {
        "part": "noun",
        "definition": "a witty saying",
        "level": "Advanced Words"
    },
    "conundrum": {
        "example": "Computers have helped solve some of the mathematical conundrums which have puzzled man for many centuries.",
        "part": "noun",
        "definition": "a difficult problem",
        "level": "Basic Words"
    },
    "incorrigible": {
        "example": "Tom Sawyer seems like an incorrigible youth until Huck Finn enters the novel; even Sawyer can't match his fierce individual spirit.",
        "part": "adjective",
        "definition": "impervious to correction by punishment",
        "level": "Common (High-frequency) Words"
    },
    "gauche": {
        "example": "Sylvester says the most gauche things, such as telling a girl he liked that she was much prettier when she wore makeup.",
        "part": "adjective",
        "definition": "lacking social polish",
        "level": "Common (High-frequency) Words"
    },
    "maxim": {
        "example": "Johnson initially suggests that the secret to business can be summarized in a single maxim but then requires a 300-page book to explain exactly what he means.",
        "part": "noun",
        "definition": "a short saying expressing a general truth",
        "level": "Basic Words"
    },
    "inflammable": {
        "example": "It only takes one person to leave an inflammable comment on an Internet thread for that thread to blow up into pages upon pages of reader indignation.",
        "part": "adjective",
        "definition": "extremely controversial, incendiary",
        "level": "Basic Words"
    },
    "quixotic": {
        "example": "For every thousand startups with quixotic plans to be the next big name in e-commerce, only a handful ever become profitable.",
        "part": "adjective",
        "definition": "wildly idealistic; impractical",
        "level": "Advanced Words"
    },
    "thwart": {
        "example": "I wanted to spend a week in New York this autumn, but the high costs of travel and lodging thwarted my plans.",
        "part": "verb",
        "definition": "hinder or prevent (the efforts, plans, or desires) of",
        "level": "Basic Words"
    },
    "apathy": {
        "example": "Widespread apathy among voters led to a very small turnout on election day.",
        "part": "noun",
        "definition": "an absence of emotion or enthusiasm",
        "level": "Common (High-frequency) Words"
    },
    "inkling": {
        "example": "Lynne speaks four Romance languages, but she doesn't have an inkling about how East Asian languages are structured.",
        "part": "noun",
        "definition": "a slight suggestion or vague understanding",
        "level": "Basic Words"
    },
    "renege": {
        "example": "We will no longer work with that vendor since it has reneged on nearly every agreement.",
        "part": "verb",
        "definition": "fail to fulfill a promise or obligation",
        "level": "Basic Words"
    },
    "implacable": {
        "example": "Win or lose, the coach was always implacable, never giving the athletes an easy practice or a break.",
        "part": "adjective",
        "definition": "incapable of making less angry or hostile",
        "level": "Common (High-frequency) Words"
    },
    "zenith": {
        "example": "At the zenith of his artistic career, Elvis was outselling any other artist on the charts.",
        "part": "noun",
        "definition": "the highest point; culmination",
        "level": "Basic Words"
    },
    "tarnish": {
        "example": "Pete Rose was one of the best baseball players of his generation, but his involvement with gambling on baseball games has tarnished his image in the eyes of many.",
        "part": "verb",
        "definition": "make dirty or spotty, as by exposure to air; also used metaphorically",
        "level": "Basic Words"
    },
    "miser": {
        "example": "Monte was no miser, but was simply frugal, wisely spending the little that he earned.",
        "part": "noun",
        "definition": "a person who doesn't like to spend money (because they are greedy)",
        "level": "Basic Words"
    },
    "admonish": {
        "example": "Before the concert began, security personel admonished the crowd not to come up on stage during the performance.",
        "part": "verb",
        "definition": "to warn strongly, even to the point of reprimanding",
        "level": "Common (High-frequency) Words"
    },
    "humdrum": {
        "example": "Having grown up in a humdrum suburb, Jacob relished life in New York City after moving.",
        "part": "adjective",
        "definition": "dull and lacking excitement",
        "level": "Basic Words"
    },
    "conducive": {
        "example": "Studying in a quiet room is conducive to learning; studying in a noisy environment makes learning more difficult.",
        "part": "adjective",
        "definition": "making a situation or outcome more likely to happen",
        "level": "Basic Words"
    },
    "underwrite": {
        "example": "The latest symphony broadcast was made possible with underwriting from the Carnegie Endowment.",
        "part": "verb",
        "definition": "to support financially",
        "level": "Basic Words"
    },
    "jovial": {
        "example": "The political candidate and his supporters were jovial once it was clear that she had won.",
        "part": "adjective",
        "definition": "full of or showing high-spirited merriment",
        "level": "Common (High-frequency) Words"
    },
    "soporific": {
        "example": "Although the professor is brilliant, his bland monotone gives his lectures a soporific effect.",
        "part": "adjective",
        "definition": "inducing mental lethargy; sleep inducing",
        "level": "Common (High-frequency) Words"
    },
    "inchoate": {
        "example": "Inchoate ideas about the relation of humans to other animals had been discussed since the Middle Ages but the modern theory really began with Darwin.",
        "part": "adjective",
        "definition": "only partly in existence; imperfectly formed",
        "level": "Advanced Words"
    },
    "serene": {
        "example": "I'd never seen him so serene; usually, he was a knot of stress and anxiety from hours of trading on the stock exchange.",
        "part": "adjective",
        "definition": "calm and peaceful",
        "level": "Basic Words"
    },
    "implicate": {
        "example": "The crime boss was implicated for a long list of crimes, ranging from murder to disturbing the peace.",
        "part": "verb",
        "definition": "to indicate in wrongdoing, usually a crime",
        "level": "Basic Words"
    },
    "redress": {
        "example": "Barry forgot his wife's birthday two years in a row, and was only able to redress his oversight by surprising his wife with a trip to Tahiti.",
        "part": "noun",
        "definition": "an act of making something right",
        "level": "Basic Words"
    },
    "disinterested": {
        "example": "The potential juror knew the defendant, and therefore could not serve on the jury, which must consist only of disinterested members.",
        "part": "adjective",
        "definition": "unbiased; neutral",
        "level": "Common (High-frequency) Words"
    },
    "resurgent": {
        "example": "The team sank to fourth place in June, but is now resurgent and about to win the division.",
        "part": "adjective",
        "definition": "rising again as to new life and vigor",
        "level": "Common (High-frequency) Words"
    },
    "ingenuity": {
        "example": "Daedalus was famous for his ingenuity; he was able to fashion his son Icarus with a pair of wings, using wax to hold them together.",
        "part": "noun",
        "definition": "the power of creative imagination",
        "level": "Basic Words"
    },
    "ingenuous": {
        "example": "Two-years in Manhattan had changed Jenna from an ingenuous girl from the suburbs to a jaded urbanite, unlikely to fall for any ruse, regardless of how elaborate.",
        "part": "adjective",
        "definition": "to be naÃ¯ve and innocent",
        "level": "Common (High-frequency) Words"
    },
    "overweening": {
        "example": "Mark was so convinced of his basketball skills that in his overweening pride he could not fathom that his name was not on the varsity list; he walked up to the basketball coach and told her she had forgotten to add his name.",
        "part": "adjective",
        "definition": "arrogant; presumptuous",
        "level": "Advanced Words"
    },
    "excoriate": {
        "example": "Entrusted with the prototype to his company's latest smartphone, Larry, during a late night karaoke bout, let the prototype slip into the hands of a rival company--the next day Larry was excoriated, and then fired.",
        "part": "verb",
        "definition": "to criticize very harshly",
        "level": "Advanced Words"
    },
    "melancholy": {
        "example": "Hamlet is a figure of tremendous melancholy: he doesn't have a truly cheerful scene throughout the entire play.",
        "part": "noun",
        "definition": "a deep, long-lasting sadness",
        "level": "Basic Words"
    },
    "sybarite": {
        "example": "Despite the fact that he'd maxed out fifteen credit cards, Max was still a sybarite at heart: when the police found him, he was at a $1,000 an hour spa in Manhattan, getting a facial treatment.",
        "part": "noun",
        "definition": "a person who indulges in luxury",
        "level": "Advanced Words"
    },
    "candid": {
        "example": "Even with a perfect stranger, Charles was always candid and would rarely hold anything back.",
        "part": "adjective",
        "definition": "a straightforward and honest look at something",
        "level": "Basic Words"
    },
    "rapprochement": {
        "example": "Although Ann hoped that her mother and her aunt would have a rapprochement, each one's bitter accusations against the other made any reconciliation unlikely.",
        "part": "noun",
        "definition": "the reestablishing of cordial relations",
        "level": "Advanced Words"
    },
    "brook": {
        "example": "While she was at the chalkboard, the teacher did not brook any form of talking--even a tiny peep resulted in afternoon detention.",
        "part": "verb",
        "definition": "put up with something or somebody unpleasant",
        "level": "Advanced Words"
    },
    "chastise": {
        "example": "Though chastised for his wanton abuse of the pantry, Lawrence shrugged off his mother's harsh words, and continued to plow through jars of cookies and boxes of donuts.",
        "part": "verb",
        "definition": "to reprimand harshly",
        "level": "Common (High-frequency) Words"
    },
    "dissipate": {
        "example": "Kathleen's perfume was overwhelming in the cramped apartment, but once we stepped outside the smell dissipated and we could breathe once again.",
        "part": "verb",
        "definition": "to disperse or scatter",
        "level": "Advanced Words"
    },
    "hoary": {
        "example": "Most workout gurus are young, fit people, whereas most yoga gurus are hoary men with long white beards.",
        "part": "adjective",
        "definition": "ancient",
        "level": "Advanced Words"
    },
    "pittance": {
        "example": "Vinny's uncle beamed smugly about how he'd offered his nephew fifty dollars for his Harvard tuition; even twice the amount would have been a mere pittance.",
        "part": "noun",
        "definition": "a small amount (of money)",
        "level": "Basic Words"
    },
    "expunge": {
        "example": "When I turned 18, all of the shoplifting and jaywalking charges were expunged from my criminal record.",
        "part": "verb",
        "definition": "to eliminate completely",
        "level": "Advanced Words"
    },
    "ploy": {
        "example": "Dennis arranged an elaborate ploy, involving 14 different people lying for him in different situations, so that it could appear that he was meeting Mary completely by chance at the wedding reception.",
        "part": "noun",
        "definition": "a clever plan to turn a situation to one's advantage",
        "level": "Basic Words"
    },
    "disenfranchise": {
        "example": "The U.S. Constitution disenfranchised women until 1920 when they were given the right to vote.",
        "part": "verb",
        "definition": "deprive of voting rights",
        "level": "Basic Words"
    },
    "amalgam": {
        "example": "The band's music was an amalgam of hip-hop, flamenco and jazz, blending the three styles with surprising results.",
        "part": "noun",
        "definition": "a mixture of multiple things",
        "level": "Common (High-frequency) Words"
    },
    "gossamer": {
        "example": "The gossamer wings of a butterfly, which allow it to fly, are also a curse, so delicate that they are often damaged.",
        "part": "adjective",
        "definition": "characterized by unusual lightness and delicacy",
        "level": "Common (High-frequency) Words"
    },
    "economical": {
        "example": "Journalists favor an economical style of writing, in which no unnecessary words are used and every sentence is as short as possible.",
        "part": "adjective",
        "definition": "avoiding waste, efficient",
        "level": "Common (High-frequency) Words"
    },
    "verisimilitude": {
        "example": "All bad novels are bad for numerous reasons; all good novels are good for their verisimilitude of reality, placing the readers in a world that resembles the one they know.",
        "part": "noun",
        "definition": "the appearance of truth",
        "level": "Advanced Words"
    },
    "cerebral": {
        "example": "A cerebral analysis of most pop music finds it to be simple and childish, but that ignores the point--the music's effect on the listener.",
        "part": "adjective",
        "definition": "involving intelligence rather than emotions or instinct",
        "level": "Basic Words"
    },
    "cohesive": {
        "example": "A well-written, cohesive essay will keep on topic at all times, never losing sight of the main argument.",
        "part": "adjective",
        "definition": "well integrated, forming a united whole",
        "level": "Basic Words"
    },
    "adjudicate": {
        "example": "Only those with the most refined palates were able to adjudicate during the barbeque competition.",
        "part": "verb",
        "definition": "to serve as a judge in a competition; to arrive at a judgment or conclusion",
        "level": "Advanced Words"
    },
    "facile": {
        "example": "Many news shows provide facile explanations to complex politics, so I prefer to read the in-depth reporting of The New York Times.",
        "part": "adjective",
        "definition": "arrived at without due care or effort; lacking depth",
        "level": "Advanced Words"
    },
    "intrepid": {
        "example": "Captain Ahab was an intrepid captain whose reckless and fearless style ultimate leads to his downfall.",
        "part": "adjective",
        "definition": "fearless",
        "level": "Common (High-frequency) Words"
    },
    "peripatetic": {
        "example": "Jim always preferred a peripatetic approach to discovering a city: he felt that he could see so many more details while walking.",
        "part": "adjective",
        "definition": "traveling by foot",
        "level": "Advanced Words"
    },
    "improvident": {
        "example": "Marty was improvident, never putting money aside for the future but spending it on decorating the interior of his home.",
        "part": "adjective",
        "definition": "not given careful consideration",
        "level": "Advanced Words"
    },
    "sinecure": {
        "example": "The position of Research Director is a sinecure: the job entails almost no responsibilities, nor does the person in that position have to answer to anyone.",
        "part": "noun",
        "definition": "an office that involves minimal duties",
        "level": "Advanced Words"
    },
    "tantamount": {
        "example": "In many situations, remaining silent is tantamount to admitting guilt, so speak to prove your innocence.",
        "part": "adjective",
        "definition": "being essentially equal to something",
        "level": "Common (High-frequency) Words"
    },
    "reproach": {
        "example": "At first, Sarah was going to yell at the boy, but she didn't want to reproach him for telling the truth about the situation.",
        "part": "verb",
        "definition": "to express criticism towards",
        "level": "Common (High-frequency) Words"
    },
    "pedantic": {
        "example": "Professor Thompson was regarded as an expert in his field, but his lectures were utterly pedantic, focused on rigorous details of the most trivial conventions in the field.",
        "part": "adjective",
        "definition": "marked by a narrow focus on or display of learning especially its trivial aspects",
        "level": "Common (High-frequency) Words"
    },
    "fawn": {
        "example": "The media fawned over the handsome new CEO, praising his impeccable sense of style instead of asking more pointed questions.",
        "part": "verb",
        "definition": "try to gain favor by extreme flattery",
        "level": "Basic Words"
    },
    "boorish": {
        "example": "Bukowski was known for being a boorish drunk and alienating close friends and family.",
        "part": "adjective",
        "definition": "ill-mannered and coarse or contemptible in behavior or appearance",
        "level": "Basic Words"
    },
    "slapdash": {
        "example": "The office building had been constructed in a slapdash manner, so it did not surprise officials when, during a small earthquake, a large crack emerged on the faÃ§ade of the building.",
        "part": "adjective",
        "definition": "carelessly and hastily put together",
        "level": "Basic Words"
    },
    "prevail": {
        "example": "Before the cricket match, Australia was heavily favored, but India prevailed.",
        "part": "verb",
        "definition": "prove superior",
        "level": "Basic Words"
    },
    "constraint": {
        "example": "He found pop music a constraint on his ability to learn and preferred to listen to classical musical while studying.",
        "part": "noun",
        "definition": "something that limits or restricts",
        "level": "Basic Words"
    },
    "transient": {
        "example": "The unpredictable and transient nature of deja vu makes it a very difficult phenomenon to study properly.",
        "part": "adjective",
        "definition": "lasting a very short time",
        "level": "Common (High-frequency) Words"
    },
    "culminate": {
        "example": "Beethoven's musical genius culminated in the 9th Symphony, which many consider his greatest work.",
        "part": "verb",
        "definition": "reach the highest or most decisive point",
        "level": "Common (High-frequency) Words"
    },
    "transitory": {
        "part": "adjective",
        "definition": "lasting a very short time",
        "level": "Basic Words"
    },
    "plucky": {
        "example": "Some scouts initially doubted Pedroia because of his short stature, but he is a plucky player, surprising everyone with his boundless energy and fierce determination.",
        "part": "adjective",
        "definition": "marked by courage and determination",
        "level": "Advanced Words"
    },
    "fecund": {
        "example": "The artist had entered a fecund period, producing three masterpieces in the span of two months.",
        "part": "adjective",
        "definition": "intellectually productive",
        "level": "Advanced Words"
    },
    "profuse": {
        "example": "During mile 20 of the Hawaii Marathon, Dwayne was sweating so profusely that he stopped to take off his shirt, and ran the remaining six miles wearing nothing more than skimpy shorts.",
        "part": "adjective",
        "definition": "plentiful; pouring out in abundance",
        "level": "Basic Words"
    },
    "concomitant": {
        "example": "connection with another Concomitant with his desire for nature was a desire for the culture and energy of a big city.",
        "part": "adjective",
        "definition": "describing an event or situation that happens at the same time as or in",
        "level": "Advanced Words"
    },
    "incessant": {
        "example": "I don't mind small children in brief doses, but I think the incessant exposure that their parents have to them would quickly wear me down.",
        "part": "adjective",
        "definition": "uninterrupted in time and indefinitely long continuing",
        "level": "Basic Words"
    },
    "denote": {
        "example": "Even if the text is not visible, the red octagon denotes \"stop\" to all motorists in America.",
        "part": "verb",
        "definition": "be a sign or indication of; have as a meaning",
        "level": "Common (High-frequency) Words"
    },
    "hauteur": {
        "example": "As soon as she won the lottery, Alice begin displaying a hauteur to her friends, calling them dirty-clothed peasants behind their backs.",
        "part": "noun",
        "definition": "overbearing pride evidenced by a superior manner toward inferiors",
        "level": "Advanced Words"
    },
    "resignation": {
        "example": "Since Jack could not think of a convincing reason why he had to miss the seminar, he attended it with a sense of resignation.",
        "part": "noun",
        "definition": "the acceptance of something unpleasant that can't be avoided",
        "level": "Basic Words"
    },
    "jargon": {
        "example": "To those with little training in medicine, the jargon of doctors can be very difficult to understand.",
        "part": "noun",
        "definition": "a characteristic language of a particular group",
        "level": "Basic Words"
    },
    "anachronism": {
        "example": "Dressed in 15th century clothing each day, Edward was a walking anachronism.",
        "part": "noun",
        "definition": "something that is inappropriate for the given time period (usually something old).",
        "level": "Advanced Words"
    },
    "antic": {
        "example": "The clown's antic act was too extreme for the youngest children, who left the room in tears.",
        "part": "adjective",
        "definition": "ludicrously odd",
        "level": "Advanced Words"
    },
    "cupidity": {
        "example": "Some believe people that amassing as much wealth as possible is the meaning to life--yet they often realize that cupidity brings anything but happiness.",
        "part": "noun",
        "definition": "greed for money",
        "level": "Advanced Words"
    },
    "perfidy": {
        "example": "The lowest circles in Dante's Inferno were for those who had practiced perfidy, and among these, the very lowest was for those, such as Judas, who had been treacherous to one of their benefactors.",
        "part": "noun",
        "definition": "an act of deliberate betrayal; a breach of a trust",
        "level": "Common (High-frequency) Words"
    },
    "inexorable": {
        "example": "The rise of the computer was an inexorable shift in technology and culture.",
        "part": "adjective",
        "definition": "impossible to stop or prevent",
        "level": "Common (High-frequency) Words"
    },
    "assiduously": {
        "example": "The top college football program recruits new talent assiduously, only choosing those who were the top in their county.",
        "part": "adverb",
        "definition": "with care and persistence",
        "level": "Advanced Words"
    },
    "repudiate": {
        "example": "Many in the public believed the rumors of a UFO crash outside town, so the chief of police did everything he could to repudiate the rumors.",
        "part": "verb",
        "definition": "reject as untrue or unfounded",
        "level": "Common (High-frequency) Words"
    },
    "anathema": {
        "example": "Hundreds of years ago, Galileo was anathema to the church; today the church is anathema to some on the left side of the political spectrum.",
        "part": "noun",
        "definition": "a detested person; the source of somebody's hate",
        "level": "Advanced Words"
    },
    "empathetic": {
        "example": "emotions Most discrimination and hatred is based on a lack of empathetic awareness of people that have the same aspitations and fears.",
        "part": "adjective",
        "definition": "showing understanding and ready comprehension of other peoples' states and",
        "level": "Basic Words"
    },
    "temerity": {
        "example": "No child has the temerity to go in the rundown house at the end of the street and see if it is haunted.",
        "part": "noun",
        "definition": "fearless daring",
        "level": "Advanced Words"
    },
    "puerile": {
        "example": "Helen enjoyed blowing soap bubbles, but Jim regarded this as puerile, totally unworthy of a woman with a Ph.D.",
        "part": "adjective",
        "definition": "of or characteristic of a child; displaying or suggesting a lack of maturity",
        "level": "Advanced Words"
    },
    "banish": {
        "example": "The most difficult part of the fast was banishing thoughts of food.",
        "part": "verb",
        "definition": "expel from a community, residence, or location; drive away",
        "level": "Basic Words"
    },
    "austere": {
        "example": "The principal of my elementary school was a cold, austere woman; I could never understand why she chose to work with children.",
        "part": "adjective",
        "definition": "harsh in manner of temperament",
        "level": "Common (High-frequency) Words"
    },
    "incumbent": {
        "example": "Middle managers at times make important decisions, but real responsibility for the financial well-being of the corporation is ultimately incumbent on the CEO.",
        "part": "adjective",
        "definition": "necessary (for someone) as a duty or responsibility",
        "level": "Basic Words"
    },
    "effervescent": {
        "example": "After the sales result, the manager was in an effervescent mood, letting several employees leave work early that day.",
        "part": "adjective",
        "definition": "marked by high spirits or excitement",
        "level": "Advanced Words"
    },
    "chimera": {
        "example": "Many believe that a world free of war is a chimera--a dream that ignores humanity's violent tendancies.",
        "part": "noun",
        "definition": "something desired or wished for but is only an illusion and impossible to achieve",
        "level": "Advanced Words"
    },
    "insolvent": {
        "example": "With credit card bills skyrocketing, a shockingly large number of Americans are truly insolvent.",
        "part": "adjective",
        "definition": "unable to pay one's bills; bankrupt",
        "level": "Basic Words"
    },
    "insipid": {
        "example": "The movie director was known for hiring beautiful actors in order to deflect attention away from the insipid scripts he would typically use.",
        "part": "adjective",
        "definition": "dull and uninteresting",
        "level": "Basic Words"
    },
    "veneer": {
        "example": "Mark Twain referred to the Victorian Period in America as the \"Gilded Age\", implying the ample moral corruption that lay beneath a mere veneer of respectability.",
        "part": "noun",
        "definition": "covering consisting of a thin superficial layer that hides the underlying substance",
        "level": "Basic Words"
    },
    "quandary": {
        "example": "unfavorable options Steve certainly is in a quandary: if he doesn't call Elaine, she will blame him for everything, but if he does call her, the evidence of where he currently is could cost him his job.",
        "part": "noun",
        "definition": "state of uncertainty or perplexity especially as requiring a choice between equally",
        "level": "Basic Words"
    },
    "beg": {
        "example": "By assuming that Charlie was headed to college--which he was not--Maggie begged the question when she asked him to which school he was headed in the Fall.",
        "part": "verb",
        "definition": "to evade or dodge (a question)",
        "level": "Advanced Words"
    },
    "auspicious": {
        "example": "Despite an auspicious beginning, Mike's road trip became a series of mishaps, and he was soon stranded and penniless, leaning against his wrecked automobile.",
        "part": "adjective",
        "definition": "favorable, the opposite of sinister",
        "level": "Common (High-frequency) Words"
    },
    "pecuniary": {
        "example": "The defendent was found guilty and had to serve a period of community service as well as pay pecuniary damages to the client.",
        "part": "adjective",
        "definition": "relating to or involving money",
        "level": "Advanced Words"
    },
    "eradicate": {
        "example": "I tried eradicating the mosquitos in my apartment with a rolled up newspaper, but there were too many of them.",
        "part": "verb",
        "definition": "to completely destroy",
        "level": "Common (High-frequency) Words"
    },
    "balk": {
        "example": "The students were willing to clean up the broken glass, but when the teacher asked them to mop the entire floor, they balked, citing reasons why they needed to leave.",
        "part": "verb",
        "definition": "refuse to comply",
        "level": "Basic Words"
    },
    "aphoristic": {
        "example": "Sometimes I can't stand Nathan because he tries to impress everyone by being aphoristic, but he just states the obvious.",
        "part": "adjective",
        "definition": "something that is a concise and instructive of a general truth or principle",
        "level": "Basic Words"
    },
    "mellifluous": {
        "example": "Chelsea's grandmother thought Franz Schubert's music to be the most mellifluous ever written; Chelsea demurred, and to her grandmother's chagrin, would blast Rihanna on the home stereo speakers.",
        "part": "adjective",
        "definition": "smooth and sweet-sounding",
        "level": "Advanced Words"
    },
    "lucid": {
        "example": "Though Walters writes about physics and time travel, his writing is always lucid, so readers with little scientific training can understand difficult concepts.",
        "part": "adjective",
        "definition": "(of language) transparently clear; easily understandable",
        "level": "Basic Words"
    },
    "screed": {
        "example": "Joey had difficulty hanging out with his former best friend Perry, who, during his entire cup of coffee, enumerated all of the government's deficiencies--only to break ranks and launch into some screed against big business.",
        "part": "noun",
        "definition": "an abusive rant (often tedious)",
        "level": "Basic Words"
    },
    "autocratic": {
        "example": "The manager was finally fired for his autocratic leadership, which often bordered on rude and offensive.",
        "part": "adjective",
        "definition": "offensively self-assured or given to exercising usually unwarranted power",
        "level": "Advanced Words"
    },
    "convivial": {
        "example": "The wedding reception was convivial; friends who hadn't seen each other for ages drank and ate together before heading to the dance floor.",
        "part": "adjective",
        "definition": "describing a lively atmosphere",
        "level": "Basic Words"
    },
    "enervate": {
        "example": "John preferred to avoid equatorial countries; the intense sun would always leave him enervated after he'd spent the day sightseeing.",
        "part": "verb",
        "definition": "to sap energy from",
        "level": "Common (High-frequency) Words"
    },
    "prodigal": {
        "example": "Successful professional athletes who do not fall prey to prodigality seem to be the exception--most live decadent lives.",
        "part": "adjective",
        "definition": "rashly or wastefully extravagant",
        "level": "Common (High-frequency) Words"
    },
    "enjoin": {
        "example": "The government agency enjoined the chemical company to clean up the hazardous dump it had created over the years.",
        "part": "verb",
        "definition": "give instructions to or direct somebody to do something with authority",
        "level": "Advanced Words"
    },
    "perpetuate": {
        "example": "If you do not let him do things for himself, you are merely perpetuating bad habits that will be even harder to break in the future.",
        "part": "verb",
        "definition": "cause to continue",
        "level": "Basic Words"
    },
    "assuage": {
        "example": "Her fear that the new college would be filled with unknown faces was assuaged when she recognized her childhood friend standing in line.",
        "part": "verb",
        "definition": "make something intense less severe",
        "level": "Basic Words"
    },
    "devolve": {
        "example": "The dialogue between the two academics devolved into a downright bitter argument.",
        "part": "verb",
        "definition": "grow worse (usually \"devolve into\")",
        "level": "Basic Words"
    },
    "clemency": {
        "example": "administering justice In the final moments of the trial, during his closing speech, Phillips was nearly begging the judge for clemency.",
        "part": "noun",
        "definition": "leniency and compassion shown toward offenders by a person or agency charged with",
        "level": "Basic Words"
    },
    "recrudesce": {
        "example": "After years of gamblers anonymous, Tony thought he'd broken his compulsive slot machine playing, but it took only one trip to the Atlantic City for a full recrudescence--he lost $5k on the one armed bandit.",
        "part": "verb",
        "definition": "to break out or happen again",
        "level": "Advanced Words"
    },
    "eccentric": {
        "example": "Mozart was well-known for his eccentricities, often speaking words backward to confuse those around him.",
        "part": "adjective",
        "definition": "highly unconventional or usual (usually describes a person)",
        "level": "Basic Words"
    },
    "maunder": {
        "example": "After drinking two expressos each, the animated couple would maunder loudly, annoying the other patrons in the coffee shop.",
        "part": "verb",
        "definition": "speak (about unimportant matters) rapidly and incessantly",
        "level": "Advanced Words"
    },
    "desecrate": {
        "example": "After desecrating the pharaoh's tomb, the archaeologist soon fell victim to a horrible illness.",
        "part": "verb",
        "definition": "to willfully violate or destroy a sacred place",
        "level": "Basic Words"
    },
    "obliging": {
        "example": "Even after all his success, I found him to be accommodating and obliging, sharing with me his \"secret tips\" on how to gain wealth and make friends.",
        "part": "adjective",
        "definition": "showing a cheerful willingness to do favors for others",
        "level": "Basic Words"
    },
    "grovel": {
        "example": "Every time Susan comes to the office, Frank grovels as if she were about to fire.",
        "part": "verb",
        "definition": "show submission or fear",
        "level": "Basic Words"
    },
    "propitiate": {
        "example": "The two sons, plying their angry father with cheesy neckties for Christmas, were hardly able to propitiate him -- the father already had a drawer full of ones he had never worn before or ever planned to.",
        "part": "verb",
        "definition": "to placate or appease",
        "level": "Advanced Words"
    },
    "rudimentary": {
        "example": "principles I would love to be able to present a fully polished proposal to the board, but right now, our plans for the product are still in the most rudimentary stages.",
        "part": "adjective",
        "definition": "being in the earliest stages of development; being or involving basic facts or",
        "level": "Common (High-frequency) Words"
    },
    "dovetail": {
        "example": "Although Darwin's evolution and Mendel's genetics were developed in isolation from one another, they dovetail each other very well.",
        "part": "verb",
        "definition": "fit together tightly, as if by means of a interlocking joint",
        "level": "Advanced Words"
    },
    "uncompromising": {
        "example": "The relationship between Bart and Hilda ultimately failed because they were both so uncompromising, never wanting to change their opinions.",
        "part": "adjective",
        "definition": "not making concessions",
        "level": "Basic Words"
    },
    "desideratum": {
        "example": "The desideratum of the environmental group is that motorists should rely on carpooling.",
        "part": "noun",
        "definition": "something desired as a necessity",
        "level": "Advanced Words"
    },
    "artifice": {
        "example": "The mayoral candidates both spent much of the campaign accusing each other of artifices designed to mislead the voting public.",
        "part": "noun",
        "definition": "cunning tricks used to deceive others",
        "level": "Advanced Words"
    },
    "avid": {
        "example": "Martin is an avid birdwatcher, often taking long hikes into remote mountains to see some rare eagle.",
        "part": "adjective",
        "definition": "marked by active interest and enthusiasm",
        "level": "Basic Words"
    },
    "pine": {
        "example": "Standing forlornly by the window, she pined for her lost love.",
        "part": "verb",
        "definition": "to yearn for",
        "level": "Basic Words"
    },
    "prevaricate": {
        "example": "The cynic quipped, \"There is not much variance in politicians; they all seem to prevaricate\".",
        "part": "verb",
        "definition": "to speak in an evasive way",
        "level": "Common (High-frequency) Words"
    },
    "concede": {
        "example": "The Spanish were forced to concede much of the territory they had previously conquered.",
        "part": "verb",
        "definition": "give over; surrender or relinquish to the physical control of another",
        "level": "Common (High-frequency) Words"
    },
    "virago": {
        "example": "Poor Billy was the victim of the virago's invective--she railed at him for a good 30-minutes about how he is the scum of the earth for speaking loudly on his cellphone in public.",
        "part": "noun",
        "definition": "an ill-tempered or violent woman",
        "level": "Basic Words"
    },
    "impecunious": {
        "example": "In extremely trying times, even the moderately wealthy, after a few turns of ill-fortune, can become impecunious.",
        "part": "adjective",
        "definition": "lacking money; poor",
        "level": "Advanced Words"
    },
    "pontificate": {
        "example": "The vice-president would often pontificate about economic theory, as if no one else in the room were qualified to speak on the topic.",
        "part": "verb",
        "definition": "talk in a dogmatic and pompous manner",
        "level": "Advanced Words"
    },
    "peruse": {
        "example": "Instead of perusing important documents, people all too often rush to the bottom of the page and plaster their signatures at the bottom.",
        "part": "verb",
        "definition": "to read very carefully",
        "level": "Basic Words"
    },
    "belligerent": {
        "example": "Tom said that he was arguing the matter purely for philosophical reasons, but his belligerent tone indicated an underlying anger about the issue.",
        "part": "adjective",
        "definition": "characteristic of one eager to fight",
        "level": "Common (High-frequency) Words"
    },
    "solecism": {
        "example": "Mother Anna was always on guard against any solecism from her children and scolded them immediately if any of them talked out of place in public.",
        "part": "noun",
        "definition": "a socially awkward or tactless act",
        "level": "Advanced Words"
    },
    "staunch": {
        "example": "No longer a staunch supporter of the movement, Todd now will openly question whether its goals are worthwhile.",
        "part": "adjective",
        "definition": "firm and dependable especially in loyalty",
        "level": "Common (High-frequency) Words"
    },
    "decorous": {
        "example": "Sally's parties are decorous affairs, and instead of the usual beer and music, there is tea and intellectual conversation.",
        "part": "adjective",
        "definition": "characterized by good taste in manners and conduct",
        "level": "Common (High-frequency) Words"
    },
    "insolent": {
        "example": "Lilian could not help herself from being insolent, commenting that the Queen's shoes were showing too much toe.",
        "part": "adjective",
        "definition": "rude and arrogant",
        "level": "Common (High-frequency) Words"
    },
    "equivocal": {
        "example": "The findings of the study were equivocal--the two researchers had different opinions on what the results signified.",
        "part": "adjective",
        "definition": "confusing or ambiguous",
        "level": "Common (High-frequency) Words"
    },
    "percipient": {
        "example": "Even the most percipient editor will make an occasional error when proofreading.",
        "part": "adjective",
        "definition": "highly perceptive",
        "level": "Advanced Words"
    },
    "conflagration": {
        "example": "In the summer months, conflagrations are not uncommon in the southwest, do to the heat and lack of rain.",
        "part": "noun",
        "definition": "a very intense and uncontrolled fire",
        "level": "Advanced Words"
    },
    "irrevocable": {
        "example": "Once you enter your plea to the court, it is irrevocable so think carefully about what you will say.",
        "part": "adjective",
        "definition": "incapable of being retracted or revoked",
        "level": "Common (High-frequency) Words"
    },
    "flounder": {
        "example": "Sylvia has excelled at advanced calculus, but ironically, when she has deal with taxes, she flounders.",
        "part": "verb",
        "definition": "behave awkwardly; have difficulties",
        "level": "Basic Words"
    },
    "paradoxical": {
        "example": "That light could be both a particle and a wave seems paradoxical, but nonetheless, it is true.",
        "part": "adjective",
        "definition": "seemingly contradictory but nonetheless possibly true",
        "level": "Basic Words"
    },
    "checkered": {
        "example": "One by one, the presidential candidates dropped out of the race, their respective checkered pasts-- from embezzlement to infidelity--sabotaging their campaigns.",
        "part": "adjective",
        "definition": "one that is marked by disreputable happenings",
        "level": "Basic Words"
    },
    "corroborate": {
        "example": "Her claim that frog populations were falling precipitously in Central America was corroborated by locals, who reported that many species of frogs had seemingly vanished overnight.",
        "part": "verb",
        "definition": "to confirm or lend support to (usually an idea or claim)",
        "level": "Basic Words"
    },
    "subversive": {
        "part": "adjective",
        "definition": "in opposition to a civil authority or government",
        "level": "Common (High-frequency) Words"
    },
    "munificent": {
        "example": "Uncle Charley was known for his munificence, giving all seven of his nephews lavish Christmas presents each year.",
        "part": "adjective",
        "definition": "very generous",
        "level": "Common (High-frequency) Words"
    },
    "compound": {
        "example": "Her headache was compounded by the construction crew outside, which had six jackhammers going at the same time.",
        "part": "verb",
        "definition": "make more intense, stronger, or more marked",
        "level": "Basic Words"
    },
    "rustic": {
        "example": "The vacation cabin had no electricity and no indoor plumbing, but despite these inconveniences, Nigel adored its rustic charm.",
        "part": "adjective",
        "definition": "characteristic of rural life; awkwardly simple and provincial",
        "level": "Common (High-frequency) Words"
    },
    "exemplify": {
        "example": "Please present some case studies that exemplify the results that you claim in your paper.",
        "part": "verb",
        "definition": "clarify by giving an example of",
        "level": "Basic Words"
    },
    "impede": {
        "example": "Since the police sergeant had to train the pair of new hires, progress in his own case was impeded.",
        "part": "verb",
        "definition": "be a hindrance or obstacle to",
        "level": "Basic Words"
    },
    "ineffable": {
        "example": "While art critics can occasionally pinpoint a work's greatness, much of why a piece captures our imaginations is completely ineffable.",
        "part": "adjective",
        "definition": "too sacred to be uttered; defying expression or description",
        "level": "Advanced Words"
    },
    "bucolic": {
        "example": "The noble families of England once owned vast expanses of beautiful, bucolic land.",
        "part": "adjective",
        "definition": "relating to the pleasant aspects of the country",
        "level": "Common (High-frequency) Words"
    },
    "dispatch": {
        "example": "As soon as the angry peasants stormed the castle, they caught the king and swiftly dispatched him.",
        "part": "verb",
        "definition": "dispose of rapidly and without delay and efficiently",
        "level": "Basic Words"
    },
    "paragon": {
        "example": "Some say that Athens was the paragon of democracy, but these people often forget that slaves and women were still not allowed to vote.",
        "part": "noun",
        "definition": "an ideal instance; a perfect embodiment of a concept",
        "level": "Advanced Words"
    },
    "officious": {
        "example": "The professor had trouble concentrating on her new theorem, because her officious secretary would barge in frequently reminding her of some trivial detail involving departmental paperwork.",
        "part": "adjective",
        "definition": "intrusive in a meddling or offensive manner",
        "level": "Advanced Words"
    },
    "telling": {
        "example": "Her unbecoming dress was very telling when it came to her sense of fashion.",
        "part": "adjective",
        "definition": "significant and revealing of another factor",
        "level": "Basic Words"
    },
    "bumbling": {
        "example": "Within a week of starting, the bumbling new waiter was unceremoniously fired.",
        "part": "adjective",
        "definition": "lacking physical movement skills, especially with the hands",
        "level": "Common (High-frequency) Words"
    },
    "intermittent": {
        "example": "The intermittent thunder continued and the night was punctuated by cracks of lightning--a surreal sleepless night.",
        "part": "adjective",
        "definition": "stopping and starting at irregular intervals",
        "level": "Basic Words"
    },
    "malingerer": {
        "example": "At one time, our country was full of hardworking respectful people, but now it seems that everyone is a malingerer with little inclination to work.",
        "part": "noun",
        "definition": "someone shirking their duty by pretending to be sick or incapacitated",
        "level": "Advanced Words"
    },
    "indigenous": {
        "example": "The plants and animals indigenous to Australia are notably different from those indigenous to the U.S-- one look at a duckbill platypus and you know you're not dealing with an opossum.",
        "part": "adjective",
        "definition": "originating in a certain area",
        "level": "Basic Words"
    },
    "encumber": {
        "example": "The costume encumbered all my movements and caused me to sweat profusely.",
        "part": "verb",
        "definition": "hold back",
        "level": "Advanced Words"
    },
    "prognostication": {
        "example": "When the Senator was asked about where the negotiations would lead, he said that any guess he could make would be an unreliable prognostication.",
        "part": "noun",
        "definition": "a statement made about the future",
        "level": "Advanced Words"
    },
    "canard": {
        "example": "The public will always be fooled by the media's canards.",
        "part": "noun",
        "definition": "a deliberately misleading fabrication",
        "level": "Advanced Words"
    },
    "candidness": {
        "example": "Although I was unhappy that the relationship ended, I appreciated her candidness about why she was ready to move on from the relationship.",
        "part": "noun",
        "definition": "the quality of being honest and straightforward in attitude and speech",
        "level": "Basic Words"
    },
    "baleful": {
        "example": "Movies often use storms or rain clouds as a baleful omen of evil events that will soon befall the main character.",
        "part": "adjective",
        "definition": "threatening or foreshadowing evil or tragic developments",
        "level": "Advanced Words"
    },
    "retiring": {
        "example": "Nelson was always the first to leave soirees--rather than mill about with \"fashionable\" folk, he was retiring, and preferred the solitude of his garret.",
        "part": "adjective",
        "definition": "to be shy, and to be inclined to retract from company",
        "level": "Basic Words"
    },
    "contrition": {
        "example": "Those who show contrition during their prison terms--especially when under review by a parole board-- often get shortened sentences.",
        "part": "noun",
        "definition": "the feeling of remorse or guilt that comes from doing something bad",
        "level": "Common (High-frequency) Words"
    },
    "parsimonious": {
        "example": "Katie is so parsimonious that she only buys a pair of socks if all of her other socks have holes in them.",
        "part": "adjective",
        "definition": "extremely frugal; miserly",
        "level": "Common (High-frequency) Words"
    },
    "forthcoming": {
        "example": "As a husband, Larry was not forthcoming: if Jill didn't demand to know details, Larry would never share them with her.",
        "part": "adjective",
        "definition": "at ease in talking to others",
        "level": "Common (High-frequency) Words"
    },
    "dearth": {
        "example": "I am surprised by the dearth of fast food chains; this is America and I assumed they were on every street.",
        "part": "noun",
        "definition": "a lack or shortage",
        "level": "Basic Words"
    },
    "benign": {
        "example": "The tumor located in your ear lobe seems to be benign and should not cause you any trouble.",
        "part": "adjective",
        "definition": "(medicine) not dangerous to health; not recurrent or progressive",
        "level": "Basic Words"
    },
    "delineate": {
        "example": "After a brief summary of proper swimming technique, the coach delineated the specifics of each stroke, spending 30 minutes alone on the backstroke.",
        "part": "verb",
        "definition": "describe in detail",
        "level": "Common (High-frequency) Words"
    },
    "ephemeral": {
        "example": "The lifespan of a mayfly is ephemeral, lasting from a few hours to a couple of days.",
        "part": "adjective",
        "definition": "lasting a very short time",
        "level": "Common (High-frequency) Words"
    },
    "squander": {
        "example": "Fearing his money would be squandered by his family, he gave all of it to charity when he died.",
        "part": "verb",
        "definition": "spend thoughtlessly; waste time, money, or an opportunity",
        "level": "Basic Words"
    },
    "embryonic": {
        "example": "The Board of Directors is hoping to launch a new product soon, but planning for the Z7 is in an embryonic stages.",
        "part": "adjective",
        "definition": "in an early stage of development",
        "level": "Advanced Words"
    },
    "ascetic": {
        "example": "Historically, ascetics like Ghandi are often considered wise men partially because of their restraint.",
        "part": "noun",
        "definition": "one who practices great self-denial",
        "level": "Common (High-frequency) Words"
    },
    "admonitory": {
        "example": "At the assembly, the high school vice-principal gave the students an admonitory speech, warning them of the many risks and dangers of prom night.",
        "part": "adjective",
        "definition": "serving to warn; expressing reproof or reproach especially as a corrective",
        "level": "Common (High-frequency) Words"
    },
    "intransigent": {
        "example": "Despite many calls for mercy, the judge remained intransigent, citing strict legal precedence.",
        "part": "adjective",
        "definition": "unwilling to change one's beliefs or course of action",
        "level": "Common (High-frequency) Words"
    },
    "halcyon": {
        "example": "prosperity The first decade after WWI was a halcyon period in America with new-found wealth and rapidly improving technology.",
        "part": "adjective",
        "definition": "idyllically calm and peaceful; suggesting happy tranquillity; marked by peace and",
        "level": "Advanced Words"
    },
    "hodgepodge": {
        "example": "Those in attendance represented a hodgepodge of the city's denizens: chimney sweepers could be seen sitting elbow to elbow with stockbrokers.",
        "part": "noun",
        "definition": "a confusing mixture or jumble",
        "level": "Basic Words"
    },
    "superfluous": {
        "example": "Everything in this closet is superfluous and can be given to charity.",
        "part": "adjective",
        "definition": "more than is needed, desired, or required",
        "level": "Common (High-frequency) Words"
    },
    "hamstrung": {
        "example": "The FBI has made so many restriction on the local police that they are absolutely hamstrung, unable to accomplish anything.",
        "part": "verb",
        "definition": "made ineffective or powerless",
        "level": "Basic Words"
    },
    "confound": {
        "example": "Americans often confound sweet potatoes with yams, and refer to both vegetables by the same name.",
        "part": "verb",
        "definition": "mistake one thing for another",
        "level": "Common (High-frequency) Words"
    },
    "obdurate": {
        "example": "No number of pleas and bribes would get him to change his obdurate attitude.",
        "part": "adjective",
        "definition": "stubbornly persistent in changing an opinion or action",
        "level": "Basic Words"
    },
    "vehement": {
        "example": "While the other employees responded to the bad news in a measured way, Andrew responded in a vehement manner, tipping over his desk and shouting at the top of his lungs.",
        "part": "adjective",
        "definition": "marked by extreme intensity of emotions or convictions",
        "level": "Common (High-frequency) Words"
    },
    "unconscionable": {
        "example": "The lawyer's demands were so unconscionable that rather than pay an exorbitant sum or submit himself to any other inconveniences, the defendant decided to find a new lawyer.",
        "part": "adjective",
        "definition": "unreasonable; unscrupulous; excessive",
        "level": "Basic Words"
    },
    "raconteur": {
        "example": "Jude is entertaining, but he is no raconteur: beyond the handful of amusing stories he has memorized, he has absolutely no spontaneous story-telling ability.",
        "part": "noun",
        "definition": "a person skilled in telling anecdotes",
        "level": "Advanced Words"
    },
    "galvanize": {
        "example": "At mile 23 of his first marathon, Kyle had all but given up, until he noticed his friends and family holding a banner that read, \"Go Kyle\"; galvanized, he broke into a gallop, finishing the last three miles in less than 20 minutes.",
        "part": "verb",
        "definition": "to excite or inspire (someone) to action",
        "level": "Common (High-frequency) Words"
    },
    "vindictive": {
        "example": "Though the other girl had only lightly poked fun of Vanessa's choice in attire, Vanessa was so vindictive that she waited for an entire semester to get the perfect revenge.",
        "part": "adjective",
        "definition": "to have a very strong desire for revenge",
        "level": "Basic Words"
    },
    "brusquely": {
        "example": "Not one for social pleasantries, the Chief of Staff would brusquely ask his subordinates anything he wanted, even coffee.",
        "part": "adverb",
        "definition": "in a blunt, direct manner",
        "level": "Basic Words"
    },
    "champion": {
        "example": "Martin Luther King Jr. championed civil rights fiercely throughout his short life.",
        "part": "verb",
        "definition": "protect or fight for as a champion",
        "level": "Basic Words"
    },
    "avert": {
        "example": "The struggling videogame company put all of its finances into one final, desperate project to avert bankrupcy.",
        "part": "verb",
        "definition": "ward off or prevent",
        "level": "Basic Words"
    },
    "redoubtable": {
        "example": "On television basketball players don't look that tall, but when you stand in front of a seven-foot tall NBA player, he is truly redoubtable.",
        "part": "adjective",
        "definition": "inspiring fear or awe",
        "level": "Advanced Words"
    },
    "cogent": {
        "example": "A cogent argument will change the minds of even the most skeptical audience.",
        "part": "adjective",
        "definition": "clear and persuasive",
        "level": "Basic Words"
    },
    "apathetic": {
        "example": "Mr. Thompson was so talented at teaching math that even normally apathetic students took interest.",
        "part": "adjective",
        "definition": "marked by a lack of interest",
        "level": "Common (High-frequency) Words"
    },
    "impermeable": {
        "example": "The sand bags placed on the river formed an impermeable barrier, protecting the town from flooding.",
        "part": "adjective",
        "definition": "does not allow fluids to pass through",
        "level": "Basic Words"
    },
    "collusion": {
        "example": "Many have argued that Lee Harvey Oswald, JFK's assassin, was in collusion with other criminals; others maintain that Oswald was a lone gunman.",
        "part": "noun",
        "definition": "agreement on a secret plot",
        "level": "Basic Words"
    },
    "malady": {
        "example": "The town was struck by a malady throughout the winter that left most people sick in bed for two weeks.",
        "part": "noun",
        "definition": "a disease or sickness",
        "level": "Basic Words"
    },
    "inure": {
        "example": "Three years of Manhattan living has inured her to the sound of wailing sirens; she could probably sleep through the apocalypse.",
        "part": "verb",
        "definition": "to make accustomed to something unpleasant",
        "level": "Advanced Words"
    },
    "incontrovertible": {
        "example": "Unless you can provide incontrovertible evidence, I will remain skeptical.",
        "part": "adjective",
        "definition": "necessarily or demonstrably true; impossible to deny or disprove",
        "level": "Advanced Words"
    },
    "degrade": {
        "example": "Jesse had mockingly pointed out all of Nancy's faults in front of their friends, publicly degrading the poor girl.",
        "part": "verb",
        "definition": "reduce in worth or character, usually verbally",
        "level": "Basic Words"
    },
    "magnanimous": {
        "example": "powerful He was a great sportsman: in defeat he was complementary and in victory he was magnanimous.",
        "part": "adjective",
        "definition": "noble and generous in spirit, especially towards a rival or someone less",
        "level": "Common (High-frequency) Words"
    },
    "maverick": {
        "example": "Officer Kelly was a maverick, rarely following police protocols or adopting the conventions for speech common among his fellow officers.",
        "part": "noun",
        "definition": "someone who exhibits great independence in thought and action",
        "level": "Common (High-frequency) Words"
    },
    "exemplar": {
        "example": "Lena's homework is on the wall because it is an exemplar of clean, neat, and thoughtful work.",
        "part": "noun",
        "definition": "something to be imitated",
        "level": "Advanced Words"
    },
    "raft": {
        "example": "Despite a raft of city ordinances passed by an overzealous council, noise pollution continued unabated in the megalopolis.",
        "part": "noun",
        "definition": "a large number of something",
        "level": "Basic Words"
    },
    "flippant": {
        "example": "Although Sam was trying to honor Mark's sense of humor, many found it quite flippant that he wore a comic nose and glasses mask to Mark's funeral.",
        "part": "adjective",
        "definition": "showing inappropriate levity",
        "level": "Advanced Words"
    },
    "illicit": {
        "example": "Though Al Capone was engaged in many illicit activities, he was finally arrested for income tax evasion, a relatively minor offense.",
        "part": "adjective",
        "definition": "contrary to or forbidden by law",
        "level": "Basic Words"
    },
    "pithy": {
        "example": "I enjoy reading the Daodejing for its pithy and insightful prose; it always gives me something to think about.",
        "part": "adjective",
        "definition": "concise and full of meaning",
        "level": "Basic Words"
    },
    "querulous": {
        "example": "The querulous old woman was begining to wear down even the happier members of the staff with her ceaseless complaining.",
        "part": "adjective",
        "definition": "habitually complaining",
        "level": "Common (High-frequency) Words"
    },
    "antedated": {
        "example": "Harry was so unknowledgable that he was unaware the Egyptian pharaohs antedated the American Revolution.",
        "part": "verb",
        "definition": "precede in time",
        "level": "Basic Words"
    },
    "disseminate": {
        "example": "Before the effects of anaethesia were disseminated, patients had to experience the full pain of a surgery.",
        "part": "verb",
        "definition": "cause to become widely known",
        "level": "Common (High-frequency) Words"
    },
    "unforthcoming": {
        "example": "The teacher demanded to know who broke the window while he was out of the room, but the students understandably were unforthcoming.",
        "part": "adjective",
        "definition": "uncooperative, not willing to give up information",
        "level": "Advanced Words"
    },
    "spurious": {
        "example": "When listening to a politician speak, it is hard to distinguish the spurious claims from the authentic ones.",
        "part": "adjective",
        "definition": "plausible but false",
        "level": "Common (High-frequency) Words"
    },
    "underscore": {
        "example": "While the hiking instructor agreed that carrying a first aid kit could be a good idea under certain circumstances, he underscored the importance of carrying enough water.",
        "part": "verb",
        "definition": "give extra weight to (a communication)",
        "level": "Common (High-frequency) Words"
    },
    "ameliorate": {
        "example": "Three Cups of Tea tells the story of western man who hopes to ameliorate poverty and the lack of education in Afghanistan.",
        "part": "verb",
        "definition": "make something bad better",
        "level": "Common (High-frequency) Words"
    },
    "foolhardy": {
        "example": "The police regularly face dangerous situations, so for a police officer not to wear his bullet-proof vest is foolhardy.",
        "part": "adjective",
        "definition": "marked by defiant disregard for danger or consequences",
        "level": "Basic Words"
    },
    "jejune": {
        "example": "Her boss further cemented his reuptation for being jejune after throwing a fit when the water cooler wasn't refilled.",
        "part": "adjective",
        "definition": "immature; childish",
        "level": "Advanced Words"
    },
    "malleable": {
        "example": "My little brother is so malleable that I can convince him to sneak cookies from the cupboard for me.",
        "part": "adjective",
        "definition": "easily influenced",
        "level": "Basic Words"
    },
    "derive": {
        "example": "From the multiple set of footprints in the living room, the investigator derived an important clue: Sheila was not alone in the room at the time of the murder.",
        "part": "verb",
        "definition": "reason by deduction; establish by deduction",
        "level": "Common (High-frequency) Words"
    },
    "puissant": {
        "example": "Over the years of service, and quite to his surprise, he became a puissant advisor to the community.",
        "part": "adjective",
        "definition": "powerful",
        "level": "Advanced Words"
    },
    "belittle": {
        "example": "A good teacher will never belittle his students, but will instead empower them.",
        "part": "verb",
        "definition": "lessen the importance, dignity, or reputation of",
        "level": "Basic Words"
    },
    "complaisant": {
        "example": "On her first day at the job, Annie was complaisant, fulfilling every request of her new employee and anticipating future requests.",
        "part": "adjective",
        "definition": "showing a cheerful willingness to do favors for others",
        "level": "Advanced Words"
    },
    "mawkish": {
        "example": "The film was incredibly mawkish, introducing highly likeable characters only to have them succumb to a devastating illnesses by the end of the movie.",
        "part": "adjective",
        "definition": "overly sentimental to the point that it is disgusting",
        "level": "Common (High-frequency) Words"
    },
    "ostentatious": {
        "example": "Matt wanted to buy stone lions for front of the house, but Cynthia convinced him that such a display would be too ostentatious for a modest house in an unassuming neighborhood.",
        "part": "adjective",
        "definition": "intended to attract notice and impress others; tawdry or vulgar",
        "level": "Common (High-frequency) Words"
    },
    "cardinal": {
        "example": "Most cultures consider gambling a cardinal sin and thus have outlawed its practice.",
        "part": "adjective",
        "definition": "of primary importance; fundamental",
        "level": "Basic Words"
    },
    "vicarious": {
        "part": "adjective",
        "definition": "felt or undergone as if one were taking part in the experience or feelings of \"tweets\"--vicariously live the life of a famous person.",
        "level": "Basic Words"
    },
    "internecine": {
        "example": "The guerilla group, which had become so powerful as to own the state police, was finally destroyed by an internecine conflict.",
        "part": "adjective",
        "definition": "(of conflict) within a group or organization",
        "level": "Advanced Words"
    },
    "variance": {
        "example": "The cynic quipped, \"There is not much variance in politicians; they all seem to prevaricate\".",
        "part": "noun",
        "definition": "the quality of varying",
        "level": "Basic Words"
    },
    "torpor": {
        "example": "After work, I was expecting my colleagues to be enthusiastic about the outing, but I found them in a state of complete torpor.",
        "part": "noun",
        "definition": "inactivity resulting from lethargy and lack of vigor or energy",
        "level": "Common (High-frequency) Words"
    },
    "petulant": {
        "example": "When Ed first met Ruth, he didn't realize she was so petulant, but now that they are three months into their relationship, Ed feels a day doesn't go by in which she isn't whining about some minor issue.",
        "part": "adjective",
        "definition": "easily irritated or annoyed",
        "level": "Common (High-frequency) Words"
    },
    "fractious": {
        "example": "We rarely invite my fractious Uncle over for dinner; he always complains about the food, and usually launches into a tirade on some touchy subject.",
        "part": "adjective",
        "definition": "irritable and is likely to cause disruption",
        "level": "Advanced Words"
    },
    "importuned": {
        "example": "After weeks of importuning the star to meet for a five-minute interview, the journalist finally got what she wanted.",
        "part": "verb",
        "definition": "beg persistently and urgently",
        "level": "Advanced Words"
    },
    "recrimination": {
        "part": "noun",
        "definition": "mutual accusations",
        "level": "Advanced Words"
    },
    "exonerate": {
        "example": "The document clearly indicated that Nick was out of the state at the time of the crime, and so served to exonerate him of any charges.",
        "part": "verb",
        "definition": "pronounce not guilty of criminal charges",
        "level": "Common (High-frequency) Words"
    },
    "ignoble": {
        "example": "In the 1920s, the World Series was rigged--an ignoble act which baseball took decades to recover from.",
        "part": "adjective",
        "definition": "dishonorable",
        "level": "Common (High-frequency) Words"
    },
    "firebrand": {
        "example": "Freddie is a firebrand: every time he walks into the office, he winds up at the center of heated argument.",
        "part": "noun",
        "definition": "someone who deliberately creates trouble",
        "level": "Advanced Words"
    },
    "indigent": {
        "example": "The indigents, huddled under the overpass, tried to start a small bonfire in the hope of staying warm.",
        "part": "noun",
        "definition": "a poor or needy person",
        "level": "Advanced Words"
    },
    "malapropism": {
        "example": "Whenever I looked glum, my mother would offer to share \"an amusing antidote\" with me--an endearing malapropism of \"anecdote\" that never failed to cheer me up.",
        "part": "noun",
        "definition": "the confusion of a word with another word that sounds similar",
        "level": "Advanced Words"
    },
    "hail": {
        "example": "Many college superstar athletes are hailed as the next big thing, but then flop at the professional level.",
        "part": "verb",
        "definition": "enthusiastically acclaim or celebrate something",
        "level": "Advanced Words"
    },
    "misattribute": {
        "example": "I made a mistake; I misattributed \"Crime and Punishment\" to Leo Tolstoy when it was actually written by Fyodor Dostoyevsky.",
        "part": "verb",
        "definition": "To erroneously attribute; to falsely ascribe; used especially of authorship.",
        "level": "Advanced Words"
    },
    "incongruous": {
        "example": "The vast economic inequality of modern society is incongruous with America's ideals.",
        "part": "adjective",
        "definition": "lacking in harmony or compatibility or appropriateness",
        "level": "Common (High-frequency) Words"
    },
    "ebullient": {
        "example": "Can you blame him for his ebullient mood? He just graduated from medical school.",
        "part": "adjective",
        "definition": "joyously unrestrained",
        "level": "Advanced Words"
    },
    "parochial": {
        "part": "adjective",
        "definition": "narrowly restricted in scope or outlook",
        "level": "Common (High-frequency) Words"
    },
    "inadvertent": {
        "example": "Although Prohibition was rooted in noble ideals, the inadvertent and costly consequences of making alcohol illegal in the U.S. led its the repeal.",
        "part": "adjective",
        "definition": "happening by chance or unexpectedly or unintentionally",
        "level": "Basic Words"
    },
    "unnerve": {
        "example": "At one time unnerved by math problems, she began avidly \"Magoosh-ing\", and soon became adept at even combinations and permutations questions.",
        "part": "verb",
        "definition": "to make nervous or upset",
        "level": "Basic Words"
    },
    "leery": {
        "example": "Without checking his references and talking  to previous employers, I am leery of hiring the candidate.",
        "part": "adjective",
        "definition": "openly distrustful and unwilling to confide",
        "level": "Basic Words"
    },
    "invective": {
        "example": "The Internet has unleashed the invectives in many of us; many people post stinging criticism on the comments section underneath newspaper articles or YouTube videos.",
        "part": "noun",
        "definition": "abusive or denunciatory language",
        "level": "Advanced Words"
    },
    "poignant": {
        "example": "After the Montagues and Capulets discover the dead bodies of Romeo and Juliet,  in the play's most poignant moment, the two griefstricken familes agree to end their feud once and for all.",
        "part": "adjective",
        "definition": "emotionally touching",
        "level": "Common (High-frequency) Words"
    },
    "perennial": {
        "example": "Even at the old-timers games, Stan Musial would get the loudest cheer: he was a perennial favorite of the fans there.",
        "part": "adjective",
        "definition": "lasting an indefinitely long time; eternal; everlasting",
        "level": "Basic Words"
    },
    "enthrall": {
        "example": "She was so enthralled by the movie that she never heard people screaming, \"Fire! Fire!\" in the neighboring theater.",
        "part": "verb",
        "definition": "hold spellbound",
        "level": "Advanced Words"
    },
    "voracious": {
        "example": "Steven was a voracious reader, sometimes finishing two novels in the same day.",
        "part": "adjective",
        "definition": "very hungry; approaching an activity with gusto",
        "level": "Basic Words"
    },
    "flush": {
        "example": "The exam's passage is flush with difficult words, words that you may have learned only yesterday.",
        "part": "adjective",
        "definition": "to be in abundance",
        "level": "Basic Words"
    },
    "animosity": {
        "example": "The governor's animosity toward his rival was only inflamed when the latter spread false lies regarding the governor's first term.",
        "part": "noun",
        "definition": "intense hostility",
        "level": "Basic Words"
    },
    "impugn": {
        "example": "Though many initially tried to impugn Darwin's theory, in scientific circles today, the is idea taken as truth.",
        "part": "verb",
        "definition": "attack as false or wrong",
        "level": "Advanced Words"
    },
    "embellish": {
        "example": "McCartney would write relatively straightforward lyrics, and Lennon would embellish them with puns and poetic images.",
        "part": "verb",
        "definition": "make more attractive by adding ornament, colour, etc.; make more beautiful",
        "level": "Basic Words"
    },
    "qualify": {
        "example": "Chris qualified his love for San Francisco, adding that he didn't like the weather as much as the weather in Los Angeles.",
        "part": "verb",
        "definition": "to make less severe; to limit (a statement)",
        "level": "Common (High-frequency) Words"
    },
    "demonstrative": {
        "example": "When Sally told James that she wanted to break up with him, she expected he would react demonstratively, but he quietly nodded his head and left without saying a word.",
        "part": "adjective",
        "definition": "given to or marked by the open expression of emotion",
        "level": "Advanced Words"
    },
    "pundit": {
        "example": "Steven Pinker's credentials are unquestioned as a pundit; he has taught at MIT and Stanford, teaches at Harvard, and has published a number of influential books on cognition, language, and psychology.",
        "part": "noun",
        "definition": "someone who has been admitted to membership in a scholarly field",
        "level": "Common (High-frequency) Words"
    },
    "embroiled": {
        "example": "These days we are never short of a D.C. politician embroiled in scandal--a welcome phenomenon for those who, having barely finished feasting on the sordid details of one imbroglio, can sink their teeth into a fresh one.",
        "part": "adjective",
        "definition": "involved in argument or contention",
        "level": "Basic Words"
    },
    "pertinent": {
        "example": "While the salaries of the players might draw attention in the media, such monetary figures are not pertinent to the question of who plays the best on the field.",
        "part": "adjective",
        "definition": "having precise or logical relevance to the matter at hand",
        "level": "Basic Words"
    },
    "wanting": {
        "example": "She did not think her vocabulary was wanting, yet there were so many words that inevitably she found a few she didn't know.",
        "part": "adjective",
        "definition": "lacking",
        "level": "Common (High-frequency) Words"
    },
    "censure": {
        "example": "After being caught in bed with a mistress, the mayor was quickly censured by the city council.",
        "part": "verb",
        "definition": "to express strong disapproval",
        "level": "Common (High-frequency) Words"
    },
    "venial": {
        "example": "His traffic violations ran the gamut from the venial to the egregious--on one occasion he simply did not come to a complete stop; another time he tried to escape across state lines at speeds in excess of 140 mph.",
        "part": "adjective",
        "definition": "easily excused or forgiven; pardonable",
        "level": "Advanced Words"
    },
    "opulence": {
        "example": "Russian oligarchs are famous for their opulence, living in fancy homes and dining on expensive cavier.",
        "part": "noun",
        "definition": "wealth as evidenced by sumptuous living",
        "level": "Common (High-frequency) Words"
    },
    "imperious": {
        "example": "unworthy Children are imperious with each other before they learn that earning someone's respect is better than demanding.",
        "part": "adjective",
        "definition": "having or showing arrogant superiority to and disdain of those one views as",
        "level": "Advanced Words"
    },
    "irascible": {
        "example": "If Arthur's dog is not fed adequately, he becames highly irascible, even growling at his own shadow.",
        "part": "adjective",
        "definition": "quickly aroused to anger",
        "level": "Basic Words"
    },
    "audacity": {
        "example": "She surprised her colleagues by having the audacity to publically criticize the findings of an distinguished scientist.",
        "part": "noun",
        "definition": "aggressive boldness in social situations",
        "level": "Common (High-frequency) Words"
    },
    "travail": {
        "example": "While they experienced nothing but travails in refinishing the kitchen, they completed the master bedroom in less than a weekend.",
        "part": "noun",
        "definition": "use of physical or mental energy; hard work; agony or anguish",
        "level": "Basic Words"
    },
    "capitulate": {
        "example": "Paul, losing 19-0 in a ping-pong match against his nimble friend, basically capitulated when he played the last two points with his eyes closed.",
        "part": "noun",
        "definition": "to surrender (usually under agreed conditions)",
        "level": "Advanced Words"
    },
    "inviolate": {
        "example": "While the literary critic subjected most of the classics to the harshest reviews, he regarded Cervantes as inviolate, and had nothing but praise for him.",
        "part": "adjective",
        "definition": "must be kept sacred",
        "level": "Advanced Words"
    },
    "vituperate": {
        "example": "Jason had dealt with disciplinarians before, but nothing prepared him for the first week of boot camp, as drill sergeants vituperated him for petty oversights such as forgetting to double knot the laces on his boots.",
        "part": "adjective",
        "definition": "to criticize harshly; to berate",
        "level": "Advanced Words"
    },
    "piquant": {
        "example": "The chef, with a mere flick of the salt shaker, turned the bland tomato soup into a piquant meal.",
        "part": "adjective",
        "definition": "having an agreeably pungent taste",
        "level": "Basic Words"
    },
    "intimate": {
        "example": "At first Manfred's teachers intimated to his parents that he was not suited to skip a grade; when his parents protested, teachers explicitly told them that, notwithstanding the boy's precocity, he was simply too immature to jump to the 6th grade.",
        "part": "verb",
        "definition": "to suggest something subtly",
        "level": "Common (High-frequency) Words"
    },
    "amuck": {
        "example": "Wherever the bowl haircut teen-idol went, his legions of screaming fans ran through the streets amuck, hoping for a glance at his boyish face.",
        "part": "adverb",
        "definition": "in a frenzied or uncontrolled state",
        "level": "Basic Words"
    },
    "altruism": {
        "example": "Albert Schweitzer spent most of his life doing missionary work as a doctor in Africa, seeking no reward, apparently motivated only by altruism.",
        "part": "noun",
        "definition": "the quality of unselfish concern for the welfare of others",
        "level": "Basic Words"
    },
    "preempt": {
        "example": "A governmental warning about an imminent terrorist attack would preempt ordinary network programming on television.",
        "part": "verb",
        "definition": "take the place of or have precedence over",
        "level": "Basic Words"
    },
    "entrenched": {
        "example": "By the time we reach 60-years old, most of our habits are so entrenched that it is difficult for us to change.",
        "part": "adjective",
        "definition": "fixed firmly or securely",
        "level": "Common (High-frequency) Words"
    },
    "row": {
        "example": "The Prime Minister looked very foolish after his row with the foreign dignitary was caught on video and posted on youtube.",
        "part": "noun",
        "definition": "an angry dispute",
        "level": "Advanced Words"
    },
    "vitriol": {
        "example": "His vitriol spewed forth from a deep-seated racisim that consumed his whole life.",
        "part": "noun",
        "definition": "abusive or venomous language used to express blame or bitter deep-seated ill will",
        "level": "Advanced Words"
    },
    "erratic": {
        "example": "It came as no surprise to pundits that the President's attempt at re-election floundered; even during his term, support for his policies was erratic, with an approval rating jumping anywhere from 30 to 60 percent.",
        "part": "adjective",
        "definition": "unpredictable; strange and unconventional",
        "level": "Basic Words"
    },
    "portentous": {
        "example": "When the captain and more than half the officers were sick on the very first night of the voyage, many of the passengers felt this was portentous, but the rest of the voyage continued without any problems.",
        "part": "adjective",
        "definition": "ominously prophetic",
        "level": "Advanced Words"
    },
    "unprecedented": {
        "example": "When America first created its national parks, the idea of setting aside the most beautiful land in a country was unprecedented in the history of mankind.",
        "part": "adjective",
        "definition": "having never been done or known before; novel",
        "level": "Basic Words"
    },
    "polemic": {
        "example": "The professor launched into a polemic, claiming that Freudian theory was a pack of lies that absolutely destroyed European literary theory.",
        "part": "noun",
        "definition": "a strong verbal or written attack on someone or something.",
        "level": "Common (High-frequency) Words"
    },
    "impertinent": {
        "part": "adjective",
        "definition": "being disrespectful; improperly forward or bold",
        "level": "Common (High-frequency) Words"
    },
    "savvy": {
        "example": "With his savvy business partner, the company was able to turn a profit within a year.",
        "part": "adjective",
        "definition": "well-informed or perceptive",
        "level": "Basic Words"
    },
    "presentiment": {
        "example": "On the night that Lincoln would be fatally shot, his wife had a presentiment about going to Ford's Theater, but Lincoln persuaded her that everything would be fine.",
        "part": "noun",
        "definition": "a feeling of evil to come",
        "level": "Advanced Words"
    },
    "estimable": {
        "example": "After serving thirty years, in which he selflessly served the community, Judge Harper was one of the more estimable people in town.",
        "part": "adjective",
        "definition": "deserving of esteem and respect",
        "level": "Advanced Words"
    },
    "volubility": {
        "example": "The professor's volubility knows no bounds; he could talk through a hurricane and elaborate a point from one St. Patrick's Day to the next.",
        "part": "noun",
        "definition": "the quality of talking or writing easily and continuously",
        "level": "Common (High-frequency) Words"
    },
    "appreciable": {
        "example": "There is an appreciable difference between those who say they can get the job done and those who actually get the job done.",
        "part": "adjective",
        "definition": "large enough to be noticed (usu. refers to an amount)",
        "level": "Basic Words"
    },
    "industrious": {
        "example": "Pete was an industrious student, completing every assignment thoroughly and on time.",
        "part": "adjective",
        "definition": "characterized by hard work and perseverance",
        "level": "Basic Words"
    },
    "provident": {
        "example": "In a move that hardly could be described as provident, Bert spend his entire savings on a luxurious cruise, knowing that other bills would come due a couple months later.",
        "part": "adjective",
        "definition": "careful in regard to your own interests; providing carefully for the future",
        "level": "Advanced Words"
    },
    "flag": {
        "example": "After the three crushing defeats in the last three games, the team's enthusiasm began to flag.",
        "part": "verb",
        "definition": "droop, sink, or settle from or as if from pressure or loss of tautness; become less intense",
        "level": "Advanced Words"
    },
    "corollary": {
        "example": "A corollary of Hurricane Sandy, which ravaged the east coast of the U.S., is a push to build higher sea walls to protect against future hurricanes.",
        "part": "noun",
        "definition": "a practical consequence that follows naturally",
        "level": "Advanced Words"
    },
    "dolorous": {
        "example": "Chopin's ballades are filled with sharp changes in moods--a dolorous melody can give way to a lighthearted tempo.",
        "part": "adjective",
        "definition": "showing sorrow",
        "level": "Advanced Words"
    },
    "afford": {
        "example": "The summit of Mt. Kilimanjaro affords a panoramic view that encompasses both Tanzania and Kenya.",
        "part": "verb",
        "definition": "provide with an opportunity",
        "level": "Advanced Words"
    },
    "irrefutable": {
        "example": "The existence of life on earth is irrefutable; the existence of intelligent life on earth is still hotly debated.",
        "part": "adjective",
        "definition": "impossible to deny or disprove",
        "level": "Advanced Words"
    },
    "flummox": {
        "example": "Mary's behavoir completely flummoxes me: I never have any idea what her motivations might be.",
        "part": "verb",
        "definition": "be a mystery or bewildering to",
        "level": "Advanced Words"
    },
    "besmirch": {
        "example": "The prince's distasteful choice of words besmirched not only his own name, but the reputation of the entire royal family.",
        "part": "verb",
        "definition": "damage the good name and reputation of someone",
        "level": "Basic Words"
    },
    "disparate": {
        "example": "With the advent of machines capable of looking inside the brain, fields as disparate as religion and biology have been brought together by scientists trying to understand what happens in the brain when people have a religious experience.",
        "part": "adjective",
        "definition": "two things are fundamentally different",
        "level": "Basic Words"
    },
    "extenuating": {
        "example": "The jury was hardly moved by the man's plea that his loneliness was an extenuating factor in his crime of dognapping a prized pooch.",
        "part": "adjective",
        "definition": "making less guilty or more forgivable",
        "level": "Basic Words"
    },
    "refractory": {
        "example": "Used to studious high school students, Martha was unprepared for the refractory Kindgergarteners who neither sat still nor listened to a single word she said.",
        "part": "adjective",
        "definition": "stubbornly resistant to authority or control",
        "level": "Common (High-frequency) Words"
    },
    "obtuse": {
        "example": "discernment Jackson was the most obtuse member of the team: the manager's subtle ironies were always lost on him.",
        "part": "adjective",
        "definition": "slow to learn or understand; lacking intellectual acuity; lacking in insight or",
        "level": "Advanced Words"
    },
    "bereft": {
        "example": "You are not bereft if you haven't played on your Xbox in the past week, his mother said.",
        "part": "adjective",
        "definition": "sorrowful through loss or deprivation",
        "level": "Advanced Words"
    },
    "supercilious": {
        "part": "adjective",
        "definition": "haughty and disdainful; looking down on others",
        "level": "Advanced Words"
    },
    "deride": {
        "example": "The nun derided the students for trying to sneak insects and worms into the classroom.",
        "part": "verb",
        "definition": "treat or speak of with contempt",
        "level": "Basic Words"
    },
    "profligate": {
        "example": "Most lottery winners go from being conservative, frugal types to outright profligates who blow millions on fast cars, lavish homes, and giant yachts.",
        "part": "noun",
        "definition": "someone who spends money recklessly or wastefully",
        "level": "Common (High-frequency) Words"
    },
    "bristle": {
        "example": "As we discussed the painting, I noticed the artitst's wife bristling at our criticisms, ready to defend her husband's work.",
        "part": "verb",
        "definition": "react in an offended or angry manner",
        "level": "Advanced Words"
    },
    "forthright": {
        "example": "I did not expect the insurance agent to give us any straight answers, but I was pleasent surprised by how forthright he was.",
        "part": "adjective",
        "definition": "characterized by directness in manner or speech; without subtlety or evasion",
        "level": "Basic Words"
    },
    "contentious": {
        "example": "Since old grandpa Harry became very contentious during the summer when only reruns were on T.V., the grandkids learned to hide from him at every opportunity.",
        "part": "adjective",
        "definition": "likely to argue",
        "level": "Advanced Words"
    },
    "bowdlerize": {
        "example": "To recieve an R rating, the entire movie was bowdlerized because it contained so much violence and grotesque subject matter.",
        "part": "verb",
        "definition": "edit by omitting or modifying parts considered indelicate",
        "level": "Advanced Words"
    },
    "arriviste": {
        "example": "The city center was aflutter with arrivistes who each tried to outdo one another with their ostentatious sports cars and chic evening dress.",
        "part": "noun",
        "definition": "a person who has recently reached a position of power; a social climber",
        "level": "Advanced Words"
    },
    "intimation": {
        "example": "At first the hostess tried intimation, praising the benefits of cutlery; when Cecil continued eating with his hands, the hostess told him to use a fork at dinner.",
        "part": "noun",
        "definition": "an indirect suggestion",
        "level": "Advanced Words"
    },
    "impetuous": {
        "example": "Herbert is rarely impetuous, but on the spur of the moment, he spent thousands of dollars on a motorcycle today.",
        "part": "adjective",
        "definition": "characterized by undue haste and lack of thought or deliberation",
        "level": "Advanced Words"
    },
    "discursive": {
        "example": "Many readers find it tough to read Moby Dick since the author is discursive, often cutting the action short to spend 20 pages on the history of a whale.",
        "part": "adjective",
        "definition": "(of e.g. speech and writing) tending to depart from the main point",
        "level": "Advanced Words"
    },
    "derogative": {
        "example": "Never before have we seen a debate between two political candidates that was so derogative and filthy.",
        "part": "adjective",
        "definition": "expressed as worthless or in negative terms",
        "level": "Basic Words"
    },
    "hubris": {
        "example": "Bill Clinton was criticized for his hubris, since he believed he could get away with anything once in the White House.",
        "part": "noun",
        "definition": "overbearing pride or presumption",
        "level": "Advanced Words"
    },
    "perturb": {
        "example": "Now that Henry is recovering from a major illnesses, he no longer lets the little trivialities, such as late mail, perturb him.",
        "part": "verb",
        "definition": "disturb in mind or cause to be worried or alarmed",
        "level": "Basic Words"
    },
    "stringent": {
        "example": "Most of the students disliked the teacher because of his stringent homework policy, but many students would later thank him for demanding so much from them.",
        "part": "adjective",
        "definition": "demanding strict attention to rules and procedures",
        "level": "Common (High-frequency) Words"
    },
    "miscreant": {
        "example": "Come back you miscreant! yelled the woman who just had her purse stollen.",
        "part": "noun",
        "definition": "a person who breaks the law",
        "level": "Basic Words"
    },
    "derelict": {
        "example": "At one time the waterfront factories were busy and productive, but now they stand derelict and will be torn down.",
        "part": "noun",
        "definition": "(of a building) abandoned",
        "level": "Advanced Words"
    },
    "surreptitious": {
        "example": "Since his mom was a light sleeper, Timmy had to tiptoe surreptitiously through the entire house, careful to not make the floors creak, until he at last was able to enjoy his plunder: a box of chocolate chip cookies.",
        "part": "adjective",
        "definition": "stealty, taking pains not to be caught or detected",
        "level": "Advanced Words"
    },
    "sordid": {
        "example": "and run-down and repulsive The nightly news simply announced that the senator had had an affair, but the tabloid published all the sordid details of the interaction.",
        "part": "adjective",
        "definition": "involving ignoble actions and motives; arousing moral distaste and contempt; foul",
        "level": "Basic Words"
    },
    "debonair": {
        "example": "James Bond is known for his good looks, high tech gadgets, and debonair manner.",
        "part": "adjective",
        "definition": "having a sophisticated charm",
        "level": "Advanced Words"
    },
    "harried": {
        "example": "With a team of new hires to train, Martha was constantly harried with little questions and could not focus on her projects.",
        "part": "adjective",
        "definition": "troubled persistently especially with petty annoyances",
        "level": "Common (High-frequency) Words"
    },
    "cavalier": {
        "example": "Percy dismissed the issue with a cavalier wave of his hand.",
        "part": "adjective",
        "definition": "given to haughty disregard of others",
        "level": "Basic Words"
    },
    "cosmopolitan": {
        "example": "There are few cities in the world as diverse and cosmopolitan as New York.",
        "part": "adjective",
        "definition": "comprising many cultures; global in reach and outlook",
        "level": "Basic Words"
    },
    "contemptuous": {
        "example": "Always on the forefront of fashion, Vanessa looked contemptuously at anyone wearing dated clothing.",
        "part": "adjective",
        "definition": "scornful, looking down at others with a sneering attitude",
        "level": "Basic Words"
    },
    "fallacious": {
        "example": "The widespread belief that Eskimos have forty different words for snow is fallacious, based on one false report.",
        "part": "adjective",
        "definition": "of a belief that is based on faulty reasoning",
        "level": "Common (High-frequency) Words"
    },
    "infelicitous": {
        "example": "During the executive meeting, the marketing director continued to make infelicitous comments about the CEO's gambling habit.",
        "part": "adjective",
        "definition": "inappropriate",
        "level": "Advanced Words"
    },
    "immure": {
        "example": "The modern supermarket experience makes many feel claustrophobic, as they are immured in walls upon walls of products.",
        "part": "verb",
        "definition": "to enclose, usually in walls",
        "level": "Advanced Words"
    },
    "avarice": {
        "example": "The Spanish conquistadors were known for their avarice, plundering Incan land and stealing Incan gold.",
        "part": "noun",
        "definition": "greed (one of the seven deadly sins)",
        "level": "Basic Words"
    },
    "fell": {
        "example": "For fans of the Harry Potter series, the fell Lord Voldemort, who terrorized poor Harry for seven lengthy installments, has finally been vanquished by the forces of good--unless, that is, JK Rowling decides to come out of retirement.",
        "part": "adjective",
        "definition": "terribly evil",
        "level": "Advanced Words"
    },
    "equivocate": {
        "example": "After Sharon brought the car home an hour after her curfew, she equivocated when her parents pointedly asked her where she had been.",
        "part": "verb",
        "definition": "to speak vaguely, usually with the intention to mislead or deceive",
        "level": "Advanced Words"
    },
    "egotist": {
        "example": "An egotist, Natasha had few friends because of her inability to talk about anything except her dream of becoming the next American Idol.",
        "part": "noun",
        "definition": "a conceited and self-centered person",
        "level": "Basic Words"
    },
    "hamper": {
        "example": "As the rain water began to collect in pools on the highway, it began to hamper the flow of traffic.",
        "part": "verb",
        "definition": "prevent the progress or free movement of",
        "level": "Basic Words"
    },
    "factitious": {
        "part": "adjective",
        "definition": "artificial; not natural",
        "level": "Advanced Words"
    },
    "plodding": {
        "example": "Charlie may seem to run at a plodding pace, but he is an ultramarathoner, meaning he runs distances of up to 100 miles, and can run for ten hours at a stretch.",
        "part": "adjective",
        "definition": "(of movement) slow and laborious",
        "level": "Basic Words"
    },
    "meteoric": {
        "example": "The early spectacular successes propelled the pitcher to meteoric stardom, but a terribly injury tragically cut short his career.",
        "part": "adjective",
        "definition": "like a meteor in speed or brilliance or transience",
        "level": "Advanced Words"
    },
    "alacrity": {
        "example": "The first three weeks at his new job, Mark worked with such alacrity that upper management knew it would be giving him a promotion.",
        "part": "noun",
        "definition": "an eager willingness to do something",
        "level": "Advanced Words"
    },
    "tyro": {
        "example": "All great writers, athletes, and artists were tyros at one time--unknown, clumsy, and unskilled with much to learn.",
        "part": "noun",
        "definition": "someone new to a field or activity",
        "level": "Advanced Words"
    },
    "deferential": {
        "example": "If you ever have the chance to meet the president, stand up straight and be deferential.",
        "part": "adjective",
        "definition": "showing respect",
        "level": "Common (High-frequency) Words"
    },
    "glut": {
        "example": "In the middle of economic crises, hiring managers find their inboxes glutted with resumes.",
        "part": "verb",
        "definition": "supply with an excess of",
        "level": "Common (High-frequency) Words"
    },
    "ostracize": {
        "example": "Later in his life, Leo Tolstoy was ostracized from the Russian Orthodox Church for his writings that contradicted church doctrine.",
        "part": "verb",
        "definition": "exclude from a community or group",
        "level": "Common (High-frequency) Words"
    },
    "ethereal": {
        "example": "Because she dances with an ethereal style, ballet critics have called her Madame Butterfly.",
        "part": "adjective",
        "definition": "characterized by lightness and insubstantiality",
        "level": "Advanced Words"
    },
    "pragmatic": {
        "example": "Rather than make a philosophical appeal to the Congressmen, the Speaker decided to take a far more pragmatic approach, making small side-deals that would add votes to his bill.",
        "part": "adjective",
        "definition": "guided by practical experience and observation rather than theory",
        "level": "Common (High-frequency) Words"
    },
    "involved": {
        "example": "The physics lecture became so involved that the undergraduate's eyes glazed over.",
        "part": "adjective",
        "definition": "complicated, and difficult to comprehend",
        "level": "Common (High-frequency) Words"
    },
    "imponderable": {
        "example": "According to many lawmakers, the huge variety of factors affecting society make devising an efficient healthcare system an imponderable task.",
        "part": "adjective",
        "definition": "impossible to estimate or figure out",
        "level": "Basic Words"
    },
    "telltale": {
        "example": "The many telltale signs of chronic smoking include yellow teeth, and a persistent, hacking cough.",
        "part": "adjective",
        "definition": "revealing",
        "level": "Basic Words"
    },
    "ambivalent": {
        "example": "Sam was ambivalent about studying for the exam because doing so ate up a lot of his time, yet he was able to improve his analytical skills.",
        "part": "adjective",
        "definition": "mixed or conflicting emotions about something",
        "level": "Common (High-frequency) Words"
    },
    "ingratiate": {
        "example": "Even though Tom didn't like his new boss, he decided to ingratiate himself to her in order to advance his career.",
        "part": "verb",
        "definition": "gain favor with somebody by deliberate efforts",
        "level": "Common (High-frequency) Words"
    },
    "pastoral": {
        "example": "Those who imagine America's countryside as a pastoral region are often disappointed to learn that much of rural U.S. is filled with cornfields extending as far as the eye can see.",
        "part": "adjective",
        "definition": "relating to the countryside in a pleasant sense",
        "level": "Basic Words"
    },
    "unscrupulous": {
        "example": "In the courtroom, the lawyer was unscrupulous, using every manner of deceit and manipulation to secure a victory for himself.",
        "part": "adjective",
        "definition": "without scruples or principles",
        "level": "Common (High-frequency) Words"
    },
    "dictatorial": {
        "example": "The coach was dictatorial in his approach: no players could ever argue or question his approach.",
        "part": "adjective",
        "definition": "expecting unquestioning obedience; characteristic of an absolute ruler",
        "level": "Common (High-frequency) Words"
    },
    "goad": {
        "example": "Doug did not want to enter the race, but Jim, through a steady stream of taunts, goaded him into signing up for it.",
        "part": "verb",
        "definition": "urge on with unpleasant comments",
        "level": "Basic Words"
    },
    "zeitgeist": {
        "example": "Each decade has its own zeitgeist--the 1990's was a prosperous time in which the promise of the American Dream never seemed more palpable.",
        "part": "noun",
        "definition": "spirit of the times",
        "level": "Advanced Words"
    },
    "aesthete": {
        "example": "A true aesthete, Marty would spend hours at the Guggenheim Museum, staring at the same Picasso.",
        "part": "noun",
        "definition": "one who professes great sensitivity to the beauty of art and nature",
        "level": "Common (High-frequency) Words"
    },
    "transmute": {
        "example": "One of the goals of alchemy was to find the substance or process that would transmute lead into gold.",
        "part": "verb",
        "definition": "change or alter in form, appearance, or nature",
        "level": "Advanced Words"
    },
    "elucidate": {
        "example": "Youtube is great place to learn just about anything--an expert elucidates finer points so that even a complete novice can learn.",
        "part": "verb",
        "definition": "make clearer and easier to understand",
        "level": "Common (High-frequency) Words"
    },
    "ribald": {
        "example": "The speaker was famous for his ribald humor, but the high school principal asked him to keep the talk G- rated when he spoke to the student body.",
        "part": "adjective",
        "definition": "humorously vulgar",
        "level": "Advanced Words"
    },
    "anomaly": {
        "example": "After finding an anomaly in the data, she knew that she would have to conduct her experiment again.",
        "part": "noun",
        "definition": "something that is not normal, standard, or expected",
        "level": "Common (High-frequency) Words"
    },
    "rarefied": {
        "example": "Jack's vulgar jokes were not so successful in the rarefied enviroment of college professors.",
        "part": "verb",
        "definition": "make more subtle or refined",
        "level": "Advanced Words"
    },
    "guffaw": {
        "example": "Whenever the jester fell to the ground in mock pain, the king guffawed, exposing his yellow, fang-like teeth.",
        "part": "verb",
        "definition": "laugh boisterously",
        "level": "Basic Words"
    },
    "conniving": {
        "example": "The queen was so conniving that, with the help of the prince, she tried to overthrow the king.",
        "part": "verb",
        "definition": "taking part in immoral and unethical plots",
        "level": "Basic Words"
    },
    "sycophant": {
        "example": "The CEO was unaware of the damaging consequences of his choices, largely because he surrounded himself with sycophants who would never dare criticize him.",
        "part": "noun",
        "definition": "a person who tries to please someone in order to gain a personal advantage",
        "level": "Common (High-frequency) Words"
    },
    "insidious": {
        "example": "Plaque is insidious: we cannot see it, but each day it eats away at our enamel, causing cavities and other dental problems.",
        "part": "adjective",
        "definition": "working in a subtle but destructive way",
        "level": "Common (High-frequency) Words"
    },
    "tenacious": {
        "example": "Even the most tenacious advocates for gun ownership must admit some of the dangers that firearms present.",
        "part": "adjective",
        "definition": "stubbornly unyielding",
        "level": "Common (High-frequency) Words"
    },
    "besiege": {
        "example": "After discovering a priceless artifact in her backyard, Jane was besieged by phone calls, emails, and reporters all trying to buy, hold or see the rare piece of history.",
        "part": "verb",
        "definition": "harass, as with questions or requests; cause to feel distressed or worried",
        "level": "Basic Words"
    },
    "mercurial": {
        "example": "The fact that Ella's moods were as mercurial as the weather was problematic for her relationships--it didn't help that she lived in Chicago.",
        "part": "adjective",
        "definition": "(of a person) prone to unexpected and unpredictable changes in mood",
        "level": "Common (High-frequency) Words"
    },
    "prosaic": {
        "example": "Unlike the talented artists in his workshop, Paul had no such bent for the visual medium, so when it was time for him to make a stained glass painting, he ended up with a prosaic mosaic.",
        "part": "adjective",
        "definition": "dull and lacking imagination",
        "level": "Advanced Words"
    },
    "trite": {
        "example": "Many style guides recommend not using idioms in writing because these trite expressions are uninteresting and show a lack of imagination on the part of the writer.",
        "part": "adjective",
        "definition": "repeated too often; overfamiliar through overuse",
        "level": "Common (High-frequency) Words"
    },
    "copious": {
        "example": "In midsummer, there are copious popiscle stands at the beach; in the winter, there are none.",
        "part": "adjective",
        "definition": "in abundant supply",
        "level": "Common (High-frequency) Words"
    },
    "bolster": {
        "example": "The case for the suspect's innocence was bolstered considerably by the fact that neither fingerprints nor DNA were found at the scene.",
        "part": "verb",
        "definition": "support and strengthen",
        "level": "Common (High-frequency) Words"
    },
    "panacea": {
        "example": "While the company credit card has made most large purchases easier, it is no panacea: some smaller basic transactions still must be conducted in cash.",
        "part": "noun",
        "definition": "hypothetical remedy for all ills or diseases; a universal solution",
        "level": "Advanced Words"
    },
    "ascribe": {
        "example": "History ascribes The Odyssey and The Illiad to Homer, but scholars now debate whether he was a historical figure or a fictitious name.",
        "part": "verb",
        "definition": "attribute or credit to",
        "level": "Basic Words"
    },
    "juxtapose": {
        "example": "The meaning of her paintings comes from a classical style which juxtaposes modern themes.",
        "part": "verb",
        "definition": "place side by side",
        "level": "Common (High-frequency) Words"
    },
    "summit": {
        "example": "Since climate change policy has been mired in congressional fighting, this summit should help set the goals for president's next term.",
        "part": "noun",
        "definition": "a meeting of high-level leaders",
        "level": "Basic Words"
    },
    "glib": {
        "example": "I have found that the more glib the salesman, the worse the product.",
        "part": "adjective",
        "definition": "(of a person) speaking with ease but without sincerity",
        "level": "Basic Words"
    },
    "staid": {
        "example": "Frank came from a staid enviroment, so he was shocked that his college rooommate sold narcotics.",
        "part": "adjective",
        "definition": "characterized by dignity and propriety",
        "level": "Basic Words"
    },
    "meticulous": {
        "example": "The Japanese noodle maker was meticulous in making his noodles and would never let another person take over the task.",
        "part": "adjective",
        "definition": "marked by extreme care in treatment of details",
        "level": "Common (High-frequency) Words"
    },
    "surfeit": {
        "example": "There was no such thing as a surfeit of shopping for Nancy--she could stay at the outlet stores from opening to closing time.",
        "part": "noun",
        "definition": "an excessive amount of something",
        "level": "Advanced Words"
    },
    "languish": {
        "example": "Stranded in the wilderness for four days, the hiker languished, eating protein bars and nuts.",
        "part": "verb",
        "definition": "become feeble",
        "level": "Advanced Words"
    },
    "sedulous": {
        "example": "An avid numismatist, Harold sedulously amassed a collection of coins from over 100 countries--an endeavor that took over fifteen years, and to five continents.",
        "part": "adjective",
        "definition": "done diligently and carefully",
        "level": "Advanced Words"
    },
    "tout": {
        "example": "At the conference, the CEO touted the extraordinary success of his company's Research & Development division.",
        "part": "verb",
        "definition": "advertize in strongly positive terms; show off",
        "level": "Basic Words"
    },
    "remonstrate": {
        "example": "The mothers of the kidnapped victims remonstrated to the rogue government to release their children, claiming that the detention violated human rights.",
        "part": "verb",
        "definition": "to make objections while pleading",
        "level": "Advanced Words"
    },
    "bellicose": {
        "example": "Known for their bellicose ways, the Spartans were once the most feared people from Peloponnesus to Persia.",
        "part": "adjective",
        "definition": "warlike; inclined to quarrel",
        "level": "Basic Words"
    },
    "vicissitude": {
        "example": "Even great rulers have their vicissitudes--massive kingdoms have diminished overnight, and once beloved kings have faced the scorn of angry masses.",
        "part": "noun",
        "definition": "change in one\"s circumstances, usually for the worse",
        "level": "Advanced Words"
    },
    "eponym": {
        "example": "named Alexandria, Egypt is an eponym because it is named after Alexander the Great.",
        "part": "noun",
        "definition": "the name derived from a person (real or imaginary); the person for whom something is",
        "level": "Advanced Words"
    },
    "assail": {
        "example": "In the weekly paper, the editor assailed the governor for wasting hundreds of thousands of dollars in public projects that quickly failed.",
        "part": "verb",
        "definition": "attack in speech or writing",
        "level": "Basic Words"
    },
    "browbeat": {
        "example": "During the interrogation, the suspect was browbeaten into signing a false confession.",
        "part": "verb",
        "definition": "be bossy towards; discourage or frighten with threats or a domineering manner",
        "level": "Advanced Words"
    },
    "hagiographic": {
        "example": "Most accounts of Tiger Woods life were hagiographic, until, that is, his affairs made headlines.",
        "part": "adjective",
        "definition": "excessively flattering toward someone's life or work",
        "level": "Advanced Words"
    },
    "decimation": {
        "example": "The decimation after atomic bombs were dropped on Hiroshima and Nagasaki is incomprehensible.",
        "part": "noun",
        "definition": "destroying or killing a large part of the population",
        "level": "Basic Words"
    },
    "exegesis": {
        "example": "The Bible is fertile ground for exegesis--over the past five centuries there have been as many interpretations as there are pages in the Old Testament.",
        "part": "noun",
        "definition": "critical explanation or analysis, especially of a text",
        "level": "Advanced Words"
    },
    "chary": {
        "example": "Jack was wary of GRE words that looked similar, because they usually had different definitions; not so with chary, a word that he began to use interchangeably with wary.",
        "part": "adjective",
        "definition": "cautious",
        "level": "Advanced Words"
    },
    "undermine": {
        "example": "The student undermined the teacher's authority by questioning the teacher's judgment on numerous occasions.",
        "part": "adjective",
        "definition": "to weaken (usually paired with an abstract term)",
        "level": "Common (High-frequency) Words"
    },
    "probity": {
        "example": "The ideal politician would have the probity to lead, but reality gravely falls short of the ideal of morally upright leaders.",
        "part": "noun",
        "definition": "integrity, strong moral principles",
        "level": "Advanced Words"
    },
    "philistine": {
        "example": "Jane considered Al completely philistine, because he talked almost exclusive about video games; she was entirely unaware of how well read he really was.",
        "part": "adjective",
        "definition": "smug and ignorant towards artistic and cultural values",
        "level": "Advanced Words"
    },
    "proscribe": {
        "example": "My doctor proscribes that I not eat donuts with chocolate sauce and hamburger patties for breakfast.",
        "part": "verb",
        "definition": "command against",
        "level": "Advanced Words"
    },
    "pristine": {
        "example": "Drill sergeants are known for demanding pristine cabinets, uniforms, and beds, and often make new recruits clean and clean and clean until they meet the expected high standards.",
        "part": "adjective",
        "definition": "Immaculately clean and unused",
        "level": "Basic Words"
    },
    "litany": {
        "example": "Mr. Rogers spoke to a Senate committee and did not give a litany of reasons to keep funding the program, but instead, appealed to the basic human decency of all present.",
        "part": "noun",
        "definition": "any long and tedious account of something",
        "level": "Advanced Words"
    },
    "precarious": {
        "example": "People smoke to relax and forget their cares, but ironically, in terms of health risks, smoking is far more precarious than either mountain-climbing or skydiving.",
        "part": "adjective",
        "definition": "fraught with danger",
        "level": "Basic Words"
    },
    "deign": {
        "example": "The master of the house never deigned to answer questions from the servants.",
        "part": "verb",
        "definition": "do something that one considers to be below one's dignity",
        "level": "Advanced Words"
    },
    "proselytize": {
        "example": "Lisa loves her Mac but says little about it; by contrast, Jake will proselytize, interrogating anyone with an Android about why she didn't purchase an iPhone.",
        "part": "verb",
        "definition": "convert to another religion, philosophy, or perspective",
        "level": "Advanced Words"
    },
    "circumvent": {
        "example": "One way of circumventing the GRE is to apply to a grad school that does not require GRE scores.",
        "part": "verb",
        "definition": "cleverly find a way out of one's duties or obligations",
        "level": "Common (High-frequency) Words"
    },
    "gumption": {
        "example": "Wallace Stegner lamented the lack of gumption in the U.S. during the sixties, claiming that no young person knew the value of work.",
        "part": "noun",
        "definition": "resourcefulness and determination",
        "level": "Advanced Words"
    },
    "melee": {
        "example": "After enduring daily taunts about my name, I became enraged and pummeled the schoolyard bully and his sycophantic friends in a brutal melee.",
        "part": "noun",
        "definition": "a wild, confusing fight or struggle",
        "level": "Basic Words"
    },
    "phlegmatic": {
        "example": "Arnold is truly noble, remaining reserved until an issue of significance arises, but Walter is simply phlegmatic: he doesn't have the energy or inclination to care about anything.",
        "part": "adjective",
        "definition": "showing little emotion",
        "level": "Advanced Words"
    },
    "pinnacle": {
        "example": "At its pinnacle, the Roman Empire extended across most of the landmass of Eurasia, a feat not paralleled to the rise of the British Empire in the 18th and 19th century.",
        "part": "noun",
        "definition": "the highest point",
        "level": "Basic Words"
    },
    "discreet": {
        "example": "advantage The professor thought that he was discreet, subtly wiping the stain off of his shirt, but as soon as he stepped off the podium a member of the audience pointed out the large ketchup stain.",
        "part": "adjective",
        "definition": "careful to protect one's speech or actions in order to avoid offense or gain an",
        "level": "Basic Words"
    },
    "hound": {
        "example": "An implacable foe of corruption, Eliot Ness hounded out graft in all forms--he even helped nab Al Capone.",
        "part": "verb",
        "definition": "to pursue relentlessly",
        "level": "Basic Words"
    },
    "uncanny": {
        "example": "normal Reggie has an uncanny ability to connect with animals: feral cats will readily approach him, and sometimes even wild birds will land on his finger.",
        "part": "adjective",
        "definition": "suggesting the operation of supernatural influences; surpassing the ordinary or",
        "level": "Basic Words"
    },
    "engender": {
        "example": "The restrictions of the Treaty of Versailles were so severe that they engendered deep hatred and resentment in the German people.",
        "part": "verb",
        "definition": "give rise to",
        "level": "Common (High-frequency) Words"
    },
    "espouse": {
        "example": "As a college student, Charlie espoused Marxism, growing his beard out and railing against the evils of the free-market.",
        "part": "verb",
        "definition": "to adopt or support an idea or cause",
        "level": "Common (High-frequency) Words"
    },
    "askance": {
        "part": "adverb",
        "definition": "with a look of suspicion or disapproval",
        "level": "Common (High-frequency) Words"
    },
    "antiquated": {
        "example": "Aunt Betty had antiquated notions about marriage, believing that a man should court a woman for at least a year before receiving a kiss.",
        "part": "adjective",
        "definition": "old-fashioned; belonging to an earlier period in time",
        "level": "Basic Words"
    },
    "quail": {
        "example": "Craig always claimed to be a fearless outdoorsman, but when the thunderstorm engulfed the valley, he quailed at the thought of leaving the safety of his cabin.",
        "part": "verb",
        "definition": "draw back, as with fear or pain",
        "level": "Advanced Words"
    },
    "scintillating": {
        "example": "Richard Feynman was renowned for his scintillating lectures--the arcana of quantum physics was made lucid as he wrote animatedly on the chalkboard.",
        "part": "adjective",
        "definition": "describes someone who is brilliant and lively",
        "level": "Basic Words"
    },
    "anemic": {
        "example": "After three straight shows, the lead actress gave an anemic performance the fourth night, barely speaking loudly enough for those in the back rows to hear.",
        "part": "adjective",
        "definition": "lacking energy and vigor",
        "level": "Advanced Words"
    },
    "commensurate": {
        "example": "The convicted felon's life sentence was commensurate to the heinousness of his crime.",
        "part": "adjective",
        "definition": "to be in proportion or corresponding in degree or amount",
        "level": "Common (High-frequency) Words"
    },
    "colossal": {
        "example": "Few appreciate the colossal scale of the sun: if hollow, it could contain a million Earths.",
        "part": "adjective",
        "definition": "so great in size or force or extent as to elicit awe",
        "level": "Basic Words"
    },
    "commendable": {
        "example": "The efforts of the firefighters running into the burning building were commendable.",
        "part": "adjective",
        "definition": "worthy of high praise",
        "level": "Basic Words"
    },
    "inviolable": {
        "example": "Too many the grass at Wimbledon is inviolable and only greater tennis players are able to enjoy a game there.",
        "part": "adjective",
        "definition": "never to be broken, infringed, or dishonored",
        "level": "Advanced Words"
    },
    "aberrant": {
        "example": "When the financial director started screaming and throwing food at his co-workers, the police had to come in to deal with his aberrant behavior.",
        "part": "adjective",
        "definition": "markedly different from an accepted norm",
        "level": "Common (High-frequency) Words"
    },
    "inclement": {
        "example": "Marcus Aurelius, though a fair man, was inclement to Christians during his reign, persecuting them violently.",
        "part": "adjective",
        "definition": "used of persons or behavior; showing no mercy",
        "level": "Basic Words"
    },
    "stolid": {
        "example": "Elephants may appear stolid to casual observers, but they actually have passionate emotional lives.",
        "part": "adjective",
        "definition": "having or revealing little emotion or sensibility; not easily aroused or excited",
        "level": "Basic Words"
    },
    "exhort": {
        "example": "Nelson's parents exhorted him to study medicine, urging him to choose a respectable profession; intransigent, Nelson left home to become a graffiti artist.",
        "part": "verb",
        "definition": "to strongly urge on; encourage",
        "level": "Basic Words"
    },
    "unassailable": {
        "example": "Professor Williams is so self-assured as to seem arrogant, presenting each and every opinion as an unassailable fact.",
        "part": "adjective",
        "definition": "immune to attack; without flaws",
        "level": "Advanced Words"
    },
    "ferret": {
        "example": "Ever the resourceful lexicographer, Fenton was able to ferret out the word origin of highly obscure words.",
        "part": "verb",
        "definition": "to search for something persistently",
        "level": "Basic Words"
    },
    "amiable": {
        "example": "Amy's name was very apt: she was so amiable that she was twice voted class president.",
        "part": "adjective",
        "definition": "friendly",
        "level": "Basic Words"
    },
    "chagrin": {
        "example": "She never cared what others said about her appearance but was chagrined by the smallest comment from her mother.",
        "part": "verb",
        "definition": "cause to feel shame; hurt the pride of",
        "level": "Advanced Words"
    },
    "unequivocal": {
        "example": "interpretation and leading to only one conclusion The President's first statement on the subject was vague and open to competing interpretations, so when he spoke to Congress about the same subject later, he was cafeful to make his position completely unequivocal.",
        "part": "adjective",
        "definition": "admitting of no doubt or misunderstanding; having only one meaning or",
        "level": "Common (High-frequency) Words"
    },
    "cataclysm": {
        "example": "The introduction of smallpox was a cataclysm for Native Americans, killing off more than half of their population.",
        "part": "noun",
        "definition": "an event resulting in great loss and misfortune",
        "level": "Advanced Words"
    },
    "iconoclast": {
        "example": "Lady Gaga, in challenging what it means to be clothed, is an iconoclast for wearing a \"meat dress\" to a prominent awards show.",
        "part": "noun",
        "definition": "somebody who attacks cherished beliefs or institutions",
        "level": "Common (High-frequency) Words"
    },
    "jubilant": {
        "example": "My hardwork paid off, and I was jubilant to receive a perfect score on the GRE.",
        "part": "adjective",
        "definition": "full of high-spirited delight because of triumph or success",
        "level": "Common (High-frequency) Words"
    },
    "credulity": {
        "example": "Virginia's wide-eyed credulity as a five-year old was replaced by suspicion after she learned that Santa Claus didn't really exist.",
        "part": "noun",
        "definition": "tendency to believe readily",
        "level": "Basic Words"
    },
    "tribulation": {
        "example": "As of 2013, nearly 1.5 million Syrians have fled their country hoping to escape the tribulations of a civil war tearing their country to pieces.",
        "part": "noun",
        "definition": "something, especially an event, that causes difficulty and suffering",
        "level": "Basic Words"
    },
    "promulgate": {
        "example": "The President wanted to promulgate the success of the treaty negotiations, but he had to wait until Congress formally approved the agreement.",
        "part": "verb",
        "definition": "state or announce",
        "level": "Advanced Words"
    },
    "ignominious": {
        "example": "Since the politician preached ethics and morality, his texting of revealing photographs was ignominious, bringing shame on both himself and his party.",
        "part": "adjective",
        "definition": "(used of conduct or character) deserving or bringing disgrace or shame",
        "level": "Common (High-frequency) Words"
    },
    "resolve": {
        "example": "After much thought, Ted resolved not to travel abroad this summer because he didn't have much money in his bank account.",
        "part": "verb",
        "definition": "reach a conclusion after a discussion or deliberation",
        "level": "Basic Words"
    },
    "dispassionate": {
        "example": "A good scientist should be dispassionate, focusing purely on what the evidence says, without personal attachment.",
        "part": "adjective",
        "definition": "unaffected by strong emotion or prejudice",
        "level": "Common (High-frequency) Words"
    },
    "disabuse": {
        "example": "As a child, I was quickly disabused of the notion that Santa Claus was a rotund benefactor of infinite largess--one night I saw my mother diligently wrapping presents and storing them under our Christmas tree.",
        "part": "verb",
        "definition": "to persuade somebody that his/her belief is not valid",
        "level": "Advanced Words"
    },
    "evanescent": {
        "example": "The storm flashed into existence above us and lasted only a short time--an evanescent turbulence of wind and cloud.",
        "part": "adjective",
        "definition": "tending to vanish like vapor",
        "level": "Advanced Words"
    },
    "eminent": {
        "example": "Shakespeare is an eminent author in the English language, but I find his writing uninteresting and melodramatic.",
        "part": "adjective",
        "definition": "standing above others in quality or position",
        "level": "Common (High-frequency) Words"
    },
    "avaricious": {
        "example": "Since avaricious desire is similar to gluttony or lust--sins of excess--it was listed as one of the seven deadly sins by the Catholic church.",
        "part": "adjective",
        "definition": "excessively greedy",
        "level": "Common (High-frequency) Words"
    },
    "sagacious": {
        "example": "Steve Jobs is surely one of the most sagacious CEOs, making Apple the most recognizable and valuable companies in the world.",
        "part": "adjective",
        "definition": "having good judgement and acute insight",
        "level": "Advanced Words"
    },
    "junta": {
        "part": "noun",
        "definition": "an aggressive takeover by a group (usually military)",
        "level": "Basic Words"
    },
    "truculent": {
        "example": "Standing in line for six hours, she became progressively truculent, yelling at DMV employees and elbowing other people waiting in line.",
        "part": "adjective",
        "definition": "having a fierce, savage nature",
        "level": "Advanced Words"
    },
    "graft": {
        "example": "In countries with rampant graft, getting a driver's license can require no more than paying an official.",
        "part": "noun",
        "definition": "corruption, usually through bribery",
        "level": "Advanced Words"
    },
    "juggernaut": {
        "example": "Napoleon was considered a juggernaut until he decided to invade Russia in winter; after which, his once indomitable army was decimated by cold and famine.",
        "part": "noun",
        "definition": "a force that cannot be stopped",
        "level": "Advanced Words"
    },
    "diabolical": {
        "example": "The conspirators, willing to dispatch anyone who stood in their way, hatched a diabolical plan to take over the city.",
        "part": "adjective",
        "definition": "to be extremely wicked like the devil",
        "level": "Basic Words"
    },
    "maintain": {
        "example": "The scientist maintained that the extinction of dinosaurs was most likely brought about by a drastic change in climate.",
        "part": "verb",
        "definition": "to assert",
        "level": "Common (High-frequency) Words"
    },
    "empiricism": {
        "example": "as a way to gain insight and knowledge Empiricism does not always lead to knowledge; an experience or experiment may raise more questions than it answers.",
        "part": "noun",
        "definition": "any method that derives knowledge from experience, used in experimental science",
        "level": "Advanced Words"
    },
    "badger": {
        "example": "Badgered by his parents to find a job, the 30-year-old loafer instead joined a gang of itinerant musicians.",
        "part": "verb",
        "definition": "to pester",
        "level": "Basic Words"
    },
    "replete": {
        "example": "Only weeks after the hurricane made landfall, the local supermarket shelves were replete with goods, so quick was the disaster relief response.",
        "part": "adjective",
        "definition": "completely stocked or furnished with something",
        "level": "Basic Words"
    },
    "mollify": {
        "example": "In the morning, Harriat was unable to mollify Harry, if he happened to become angry, unless he had his cup of coffee.",
        "part": "verb",
        "definition": "to make someone angry less angry; placate",
        "level": "Common (High-frequency) Words"
    },
    "moribund": {
        "example": "Whether you like it or not, jazz as a genre is moribund at best, possibly already dead.",
        "part": "adjective",
        "definition": "being on the point of death; declining rapidly losing all momentum in progress",
        "level": "Advanced Words"
    },
    "despot": {
        "example": "The Emperor Claudius was regarded as a fair-minded leader; his successor, Nero, was an absolute despot.",
        "part": "noun",
        "definition": "a cruel and oppressive dictator",
        "level": "Advanced Words"
    },
    "refute": {
        "example": "No one could refute his theories or propositions, and that is why he was esteemed by all his colleagues in the philosophy department.",
        "part": "verb",
        "definition": "prove to be false or incorrect",
        "level": "Common (High-frequency) Words"
    },
    "insouciance": {
        "example": "Surprisingly, Hank had become a high-powered CEO; his high school friends remembered him as \"Hanky Panky\", who shrugged off each failed class with insouciance.",
        "part": "noun",
        "definition": "lack of concern",
        "level": "Advanced Words"
    },
    "vaunted": {
        "example": "For years, they had heard of New York City's vaunted skyline, and when they finally saw it, the spectacular cityscape did not disappoint them in the least.",
        "part": "adjective",
        "definition": "highly or widely praised or boasted about",
        "level": "Advanced Words"
    },
    "crestfallen": {
        "example": "I asked Maria on a date and she refused without a moment's thought; I was crestfallen.",
        "part": "adjective",
        "definition": "brought low in spirit",
        "level": "Advanced Words"
    },
    "tawdry": {
        "example": "Carol expected to find New York City magical, the way so many movies had portrayed it, but she was surprised how often tawdry displays took the place of genuine elegance.",
        "part": "adjective",
        "definition": "tastelessly showy; cheap and shoddy",
        "level": "Basic Words"
    },
    "turpitude": {
        "example": "During his reign, Caligula indulged in unspeakable sexual practices, so it not surprising that he will forever be remembered for his turpitude.",
        "part": "noun",
        "definition": "depravity; a depraved act",
        "level": "Advanced Words"
    },
    "rankle": {
        "example": "His constant whistling would rankle her, sometimes causing her to leave in a huff.",
        "part": "verb",
        "definition": "gnaw into; make resentful or angry",
        "level": "Basic Words"
    },
    "asperity": {
        "example": "The editor was known for his asperity, often sending severe letters of rejection to amateur writers.",
        "part": "noun",
        "definition": "harshness of manner",
        "level": "Advanced Words"
    },
    "rile": {
        "example": "Dan is usually calm and balanced, but it takes only one intense glare from Sabrina to rile him.",
        "part": "verb",
        "definition": "cause annoyance in; disturb, especially by minor irritations",
        "level": "Basic Words"
    },
    "immutable": {
        "example": "Taxes are one of the immutable laws of the land, so there is no use arguing about paying them.",
        "part": "adjective",
        "definition": "not able to be changed",
        "level": "Common (High-frequency) Words"
    },
    "expansive": {
        "example": "After a few sips of cognac, the octogenarian shed his irascible demeanor and became expansive, speaking fondly of the \"good old days\".",
        "part": "adjective",
        "definition": "communicative, and prone to talking in a sociable manner",
        "level": "Advanced Words"
    },
    "obstreperous": {
        "example": "When the teacher asked the obstreperous student simply to bus his tray, the student threw the entire tray on the floor, shouted an epithet, and walked out.",
        "part": "adjective",
        "definition": "noisily and stubbornly defiant; willfully difficult to control",
        "level": "Advanced Words"
    },
    "debase": {
        "example": "The third-rate script so debased the film that not even the flawless acting could save it from being a flop.",
        "part": "verb",
        "definition": "reduce the quality or value of something",
        "level": "Basic Words"
    },
    "decry": {
        "example": "The entire audience erupted in shouts and curses, decrying the penalty card issued by the referee.",
        "part": "verb",
        "definition": "express strong disapproval of",
        "level": "Advanced Words"
    },
    "creditable": {
        "example": "Critics agreed the movie was creditable, but few gave it more than three out of five stars.",
        "part": "adjective",
        "definition": "deserving of praise but not that amazing",
        "level": "Basic Words"
    },
    "pejorative": {
        "example": "Most psychologists object to the pejorative term \"shrink\", believing that they expand the human mind, not limit it.",
        "part": "adjective",
        "definition": "expressing disapproval (usu. refers to a term)",
        "level": "Common (High-frequency) Words"
    },
    "antithetical": {
        "example": "His deep emotional involvement with these ideas is, in fact, antithetical to the disattachment Buddhism preaches.",
        "part": "adjective",
        "definition": "sharply contrasted in character or purpose",
        "level": "Common (High-frequency) Words"
    },
    "gambit": {
        "example": "Randy played a gambit, telling his boss that he would leave at the end of the week if he didn't get a raise.",
        "part": "noun",
        "definition": "a manuveur or risk in a game or conversation, designed to secure an advantage",
        "level": "Advanced Words"
    },
    "catholic": {
        "example": "Jonah's friends said that Jonah's taste in music was eclectic; Jonah was quick to point out that not only was his taste eclectic but it was also catholic: he enjoyed music from countries as far-flung as Mali and Mongolia.",
        "part": "adjective",
        "definition": "of broad scope; universal",
        "level": "Advanced Words"
    },
    "primacy": {
        "example": "The primacy of Apple Computers is not guaranteed, as seen in the recent lawsuits and weak growth.",
        "part": "noun",
        "definition": "the state of being first in importance",
        "level": "Advanced Words"
    },
    "indifference": {
        "example": "In an effort to fight indifference, the president of the college introduced a new, stricter grading system.",
        "part": "noun",
        "definition": "the trait of seeming not to care",
        "level": "Common (High-frequency) Words"
    },
    "peevish": {
        "example": "Our office manager is peevish, so the rest of us tip-toe around him, hoping not to set off another one of his fits.",
        "part": "adjective",
        "definition": "easily irritated or annoyed",
        "level": "Basic Words"
    },
    "lachrymose": {
        "example": "Lachrymose and depressed, Alexei Alexandrovich walked two miles home in the rain after learning that his wife was having an affair.",
        "part": "adjective",
        "definition": "showing sorrow",
        "level": "Advanced Words"
    },
    "lambast": {
        "example": "Showing no patience, the manager utterly lambasted the sales team that lost the big account.",
        "part": "verb",
        "definition": "criticize severely or angrily",
        "level": "Common (High-frequency) Words"
    },
    "censor": {
        "example": "Every fall, high school English teachers are inundated by requests to censor their curriculum by removing The Catcher in the Rye and Scarlet Letter from their reading lists.",
        "part": "verb",
        "definition": "to examine and remove objectionable material",
        "level": "Basic Words"
    },
    "hegemony": {
        "example": "Until the Spanish Armada was defeated in 1587, Spain had hegemony over the seas, controlling waters stretching as far as the Americas.",
        "part": "adjective",
        "definition": "dominance over a certain area",
        "level": "Common (High-frequency) Words"
    },
    "dissolution": {
        "example": "Many Roman emporers were known for their dissolution, indulging in unspeakable desires of the flesh.",
        "part": "noun",
        "definition": "a living full of debauchery and indulgence in sensual pleasure",
        "level": "Advanced Words"
    },
    "insufferable": {
        "example": "Chester always tried to find some area in which he excelled above others; unsurprisingly, his co-workers found him insufferable and chose to exclude him from daily luncheons out.",
        "part": "adjective",
        "definition": "intolerable, difficult to endure",
        "level": "Advanced Words"
    },
    "pellucid": {
        "example": "The professor had a remarkable ability make even the most difficult concepts seem pellucid.",
        "part": "adjective",
        "definition": "transparently clear; easily understandable",
        "level": "Advanced Words"
    },
    "turgid": {
        "example": "The amount of GRE vocabulary he used increased with his years--by the time he was 60, his novels were so turgid that even his diehard fans refused to read them.",
        "part": "adjective",
        "definition": "(of language) pompous and tedious",
        "level": "Advanced Words"
    },
    "incense": {
        "example": "When Herb bought football tickets for a game on the day of their wedding anniversary, Jill was incensed.",
        "part": "verb",
        "definition": "make furious",
        "level": "Basic Words"
    },
    "vie": {
        "example": "While the other teams in the division actively vie for the championship, this team seems content simply to go through the motions of playing.",
        "part": "verb",
        "definition": "compete for something",
        "level": "Basic Words"
    },
    "obtain": {
        "example": "The custom of waiting your turn in line does not obtain in some countries, in which many people try to rush to front of the line at the same time.",
        "part": "adjective",
        "definition": "be valid, applicable, or true",
        "level": "Advanced Words"
    },
    "apocryphal": {
        "example": "The web is notorious for sandwiching apocryphal stories between actual news.",
        "part": "adjective",
        "definition": "being of questionable authenticity",
        "level": "Common (High-frequency) Words"
    },
    "hackneyed": {
        "part": "adjective",
        "definition": "lacking significance through having been overused",
        "level": "Common (High-frequency) Words"
    },
    "pillory": {
        "example": "After the candidate confessed, the press of the opposing party took the opportunity to pillory him, printing editorials with the most blatantly exaggerated accusations.",
        "part": "verb",
        "definition": "ridicule or expose to public scorn",
        "level": "Advanced Words"
    },
    "temperance": {
        "example": "Welles wasn't known for his temperance--he usually ate enough for two and drank enough for three.",
        "part": "noun",
        "definition": "the trait of avoiding excesses",
        "level": "Common (High-frequency) Words"
    },
    "blatant": {
        "example": "Allen was often punished in school for blatantly disrespecting teachers.",
        "part": "adjective",
        "definition": "without any attempt at concealment; completely obvious",
        "level": "Common (High-frequency) Words"
    },
    "serendipity": {
        "part": "noun",
        "definition": "the instance in which an accidental, fortunate discovery is made",
        "level": "Basic Words"
    },
    "aphorism": {
        "example": "Nietzsche was known for using aphorisms, sometimes encapsulating a complex philosophical thought in a mere sentence.",
        "part": "noun",
        "definition": "a short instructive saying about a general truth",
        "level": "Basic Words"
    },
    "sangfroid": {
        "example": "The hostage negotiator exhibited a sangfroid that oftentimes was more menacing than the sword at his throat, or the gun at his head.",
        "part": "noun",
        "definition": "calmness or poise in difficult situations",
        "level": "Advanced Words"
    },
    "diminutive": {
        "example": "When he put on his father's suit and shoes, his appearance was that of a diminutive youth.",
        "part": "adjective",
        "definition": "very small",
        "level": "Advanced Words"
    },
    "presumption": {
        "example": "The new neighbor quickly gained a reptuation for her presumption; she had invited herself to several of the neighbors homes, often stopping over at inopportune times and asking for a drink.",
        "part": "noun",
        "definition": "audacious (even arrogant) behavior that you have no right to",
        "level": "Basic Words"
    },
    "vacillate": {
        "example": "action Some students vacillate between schools when deciding which to attend, while others focus only on one school.",
        "part": "verb",
        "definition": "be undecided about something; waver between conflicting positions or courses of",
        "level": "Common (High-frequency) Words"
    },
    "benighted": {
        "example": "Far from being a period of utter benightedness, The Medieval Ages produced some great works of theological speculation.",
        "part": "adjective",
        "definition": "fallen into a state of ignorance",
        "level": "Advanced Words"
    },
    "arch": {
        "example": "The baroness was arch, making playful asides to the townspeople; yet because they couldn't pick up on her dry humor, they thought her supercilious.",
        "part": "adjective",
        "definition": "to be deliberately teasing",
        "level": "Advanced Words"
    },
    "celerity": {
        "example": "We aim to respond to customers' questions with celerity and accuracy, with no longer than a 24 hour wait time.",
        "part": "noun",
        "definition": "speed, rapidity",
        "level": "Advanced Words"
    },
    "powwow": {
        "example": "Before the team takes the field, the coach always calls for a powwow so that he can make sure all the players are mentally in the right place.",
        "part": "noun",
        "definition": "an informal meeting or discussion",
        "level": "Basic Words"
    },
    "opaque": {
        "example": "The meaning of the professor's new research was opaque to most people, so no one asked any questions.",
        "part": "adjective",
        "definition": "not clearly understood or expressed",
        "level": "Common (High-frequency) Words"
    },
    "presumptuous": {
        "example": "Many felt that Barney was presumptuous in moving into the large office before the management even made any official announcement of his promotion.",
        "part": "adjective",
        "definition": "excessively forward",
        "level": "Basic Words"
    },
    "gerrymander": {
        "example": "Years ago, savvy politicians had gerrymandered the city center to ensure their re-election.",
        "part": "verb",
        "definition": "to manipulate voting districts in order to favor a particular political party",
        "level": "Advanced Words"
    },
    "dissemble": {
        "example": "To get close to the senator, the assassin dissembled his intentions, convincing many people that he was a reporter for a well-known newspaper.",
        "part": "verb",
        "definition": "conceal one's true motives, usually through deceit",
        "level": "Advanced Words"
    },
    "excruciating": {
        "example": "After the boulder rolled a couple of feet, pinning my friend's arm, he experienced excruciating pain.",
        "part": "adjective",
        "definition": "extremely painful",
        "level": "Basic Words"
    },
    "detrimental": {
        "example": "Many know that smoking is detrimental to your health, but processed sugar in large quantities is equally bad.",
        "part": "adjective",
        "definition": "(sometimes followed by \"to\") causing harm or injury",
        "level": "Basic Words"
    },
    "burgeon": {
        "example": "China's housing market is burgeoning, but some predict that the growth is merely a bubble and will burst much like the U.S. real estate bubble of 2008.",
        "part": "verb",
        "definition": "grow and flourish",
        "level": "Common (High-frequency) Words"
    },
    "complementary": {
        "example": "The head waiter was careful to tell the amateur diners that red wine was complementary with beef, each bringing out subtle taste notes in the other.",
        "part": "adjective",
        "definition": "enhancing each other's qualities (for two things or more).",
        "level": "Basic Words"
    },
    "conspicuous": {
        "example": "American basketball players are always conspicuous when they go abroad--not only are they American, but some are over seven feet tall.",
        "part": "adjective",
        "definition": "without any attempt at concealment; completely obvious",
        "level": "Common (High-frequency) Words"
    },
    "imprudent": {
        "example": "Hitler, like Napoleon, made the imprudent move of invading Russia in winter, suffering even more casualties than Napoleon had.",
        "part": "adjective",
        "definition": "not wise",
        "level": "Common (High-frequency) Words"
    },
    "thoroughgoing": {
        "example": "As a thoroughgoing bibliophile, one who had turned his house into a veritable library, he shocked his friends when he bought a Kindle.",
        "part": "adjective",
        "definition": "very thorough; complete",
        "level": "Basic Words"
    },
    "grandiloquent": {
        "example": "The dictator was known for his grandiloquent speeches, puffing his chest out and using big, important- sounding words.",
        "part": "adjective",
        "definition": "puffed up with vanity",
        "level": "Advanced Words"
    },
    "abstain": {
        "example": "Considered a health nut, Jessica abstained from anything containing sugar--even chocolate.",
        "part": "verb",
        "definition": "choose not to consume or take part in (particularly something enjoyable)",
        "level": "Common (High-frequency) Words"
    },
    "mettlesome": {
        "example": "For its raid on the Bin Laden's compound in Abbottabad, Seal Team Six has become, for many Americans, the embodiment of mettle.",
        "part": "adjective",
        "definition": "filled with courage or valor",
        "level": "Advanced Words"
    },
    "myopic": {
        "example": "The company ultimately went out of business because the myopic managers couldn't predict the changes in their industry.",
        "part": "adjective",
        "definition": "lacking foresight or imagination",
        "level": "Common (High-frequency) Words"
    },
    "arbitrary": {
        "example": "One of the arbitrary decrees in place during the emperor's rule is that all citizens pay him weekly homage at his palace.",
        "part": "adjective",
        "definition": "based on a random, groundless decision",
        "level": "Common (High-frequency) Words"
    },
    "prodigious": {
        "example": "After the relatively small homerun totals in the \"dead ball\" era, Babe Ruth's homerun totals were truly prodigious: every year, he set a new all-time record.",
        "part": "adjective",
        "definition": "so great in size or force or extent as to elicit awe",
        "level": "Common (High-frequency) Words"
    },
    "accolade": {
        "example": "Jean Paul-Sartre was not a fan of accolades, and as such, he refused to accept the Nobel Prize for Literature in 1964.",
        "part": "noun",
        "definition": "an award or praise granted as a special honor",
        "level": "Common (High-frequency) Words"
    },
    "irresolute": {
        "example": "He stood irresolute at the split in the trail, not sure which route would lead back to the camp.",
        "part": "adjective",
        "definition": "uncertain how to act or proceed",
        "level": "Basic Words"
    },
    "laborious": {
        "example": "The most laborious job I've had was working 20 hours a day as a fisherman in King Salmon, Alaska.",
        "part": "adjective",
        "definition": "characterized by effort to the point of exhaustion; especially physical effort",
        "level": "Basic Words"
    },
    "extrapolate": {
        "example": "By extrapolating from the data on the past three months, we can predict a 5% increase in traffic to our website.",
        "part": "verb",
        "definition": "draw from specific cases for more general cases",
        "level": "Advanced Words"
    },
    "moot": {
        "example": "Since the Board just terminated Steve as the CEO, what the finance committe might have thought of his proposed marketing plan for next year is now a moot point.",
        "part": "adjective",
        "definition": "open to argument or debate; undecidable in a meaningless or irrelevant way",
        "level": "Basic Words"
    },
    "rebuke": {
        "example": "The police chief rebuked the two officers whose irresponsible decisions almost led to the deaths of seven innocent by-standers.",
        "part": "verb",
        "definition": "criticize severely or angrily; censure",
        "level": "Common (High-frequency) Words"
    },
    "haughty": {
        "example": "unworthy The haughty manager didn't believe that any of his subordinates could ever have an insight as brilliant his own.",
        "part": "adjective",
        "definition": "having or showing arrogant superiority to and disdain of those one views as",
        "level": "Common (High-frequency) Words"
    },
    "convoluted": {
        "example": "Instead of solving the math problem in three simple steps, Kumar used a convoluted solution requiring fifteen steps.",
        "part": "adjective",
        "definition": "highly complex or intricate",
        "level": "Basic Words"
    },
    "laconic": {
        "example": "While Martha always swooned over the hunky, laconic types in romantic comedies, her boyfriends inevitably were very talkative--and not very hunky.",
        "part": "adjective",
        "definition": "one who says very few words",
        "level": "Common (High-frequency) Words"
    },
    "malevolent": {
        "example": "Villians are known for their malevolent nature, oftentimes inflicting cruetly on others just for enjoyment.",
        "part": "adjective",
        "definition": "wishing or appearing to wish evil to others; arising from intense ill will or hatred",
        "level": "Basic Words"
    },
    "duress": {
        "example": "The witness said he signed the contract under duress and argued that the court should cancel the agreement.",
        "part": "noun",
        "definition": "compulsory force or threat",
        "level": "Common (High-frequency) Words"
    },
    "evasive": {
        "example": "Every time I call the bank, I receive the same evasive answers about our mortgage and never get a clear response.",
        "part": "adjective",
        "definition": "deliberately vague or ambiguous",
        "level": "Basic Words"
    },
    "proponent": {
        "example": "Ironically, the leading proponent of Flat-Earth Theory flies all over the world in an effort to win more adherents.",
        "part": "noun",
        "definition": "a person who pleads for a cause or propounds an idea",
        "level": "Basic Words"
    },
    "coalesce": {
        "example": "Over time, the various tribes coalesced into a single common culture with one universal language.",
        "part": "verb",
        "definition": "fuse or cause to grow together",
        "level": "Basic Words"
    },
    "lethargic": {
        "example": "Nothing can make a person more lethargic than a big turkey dinner.",
        "part": "adjective",
        "definition": "lacking energy",
        "level": "Basic Words"
    },
    "largess": {
        "example": "Uncle Frank was known for his largess, so his nephew was sad when he did not receive a present for his birthday.",
        "part": "noun",
        "definition": "extreme generosity and giving",
        "level": "Common (High-frequency) Words"
    },
    "antipathy": {
        "example": "Maria had an antipathy for tour groups, often bolting to the other side of the museum as soon as she saw a chaperone leading a group of wide-eyed tourists.",
        "part": "noun",
        "definition": "an intense feeling of dislike or aversion",
        "level": "Common (High-frequency) Words"
    },
    "efficacious": {
        "example": "Since Maggie's cough syrup, which had expired five years back, was no longer efficacious, she coughed through the night.",
        "part": "adjective",
        "definition": "producing the intended result",
        "level": "Common (High-frequency) Words"
    },
    "consummate": {
        "example": "The restoration of the ancient church was only consummated after a twenty years of labor.",
        "part": "verb",
        "definition": "to make perfect and complete in every respect",
        "level": "Basic Words"
    },
    "oblique": {
        "example": "Herbert never explicitly revealed anything negative about Tom's past, but at times he would obliquely suggest that Tom was not as innocent as he seemed.",
        "part": "adjective",
        "definition": "not straightforward; indirect",
        "level": "Advanced Words"
    },
    "perquisite": {
        "example": "official right) Even as the dishwasher at the French restaurant, Josh quickly learned that he had the perquisite of being able to eat terrific food for half the price diners would pay.",
        "part": "noun",
        "definition": "a right reserved exclusively by a particular person or group (especially a hereditary or",
        "level": "Basic Words"
    },
    "predilection": {
        "example": "Monte had a predilection for the fine things in life: Cuban cigars, 200 dollar bottles of wine, and trips to the French Riviera.",
        "part": "noun",
        "definition": "a strong liking",
        "level": "Common (High-frequency) Words"
    },
    "lugubrious": {
        "example": "At the funeral, lugubrious songs filled the small church.",
        "part": "adjective",
        "definition": "excessively mournful",
        "level": "Advanced Words"
    },
    "dilapidated": {
        "example": "The main house has been restored but the gazebo is still dilapidated and unuseable.",
        "part": "adjective",
        "definition": "in terrible condition",
        "level": "Basic Words"
    },
    "bilious": {
        "example": "Rex was bilious all morning, and his face would only take on a look of contentedness when he'd had his morning cup of coffee.",
        "part": "adjective",
        "definition": "irritable; always angry",
        "level": "Advanced Words"
    },
    "misconstrue": {
        "example": "The politician never trusted journalists because he though that they misconstrue his words and misrepresent his positions.",
        "part": "verb",
        "definition": "interpret in the wrong way",
        "level": "Common (High-frequency) Words"
    },
    "saturnine": {
        "example": "Deprived of sunlight, humans become saturnine; that's why in very northerly territories people are encouraged to sit under an extremely powerful lamp, lest they become morose.",
        "part": "adjective",
        "definition": "morose or gloomy",
        "level": "Advanced Words"
    },
    "macabre": {
        "example": "Edgar Allen Poe was considered the master of the macabre; his stories vividly describe the moment leading up to--and often those moments after--a grisly death.",
        "part": "adjective",
        "definition": "suggesting the horror of death and decay; gruesome",
        "level": "Basic Words"
    },
    "elusive": {
        "example": "Many first time skydivers say that describing the act of falling from the sky is elusive.",
        "part": "adjective",
        "definition": "difficult to capture or difficult to remember",
        "level": "Basic Words"
    },
    "artful": {
        "example": "Bernie Madoff's artful Ponzi scheme stole billions of dollars from investors and is considered the largest financial fraud in U.S. history.",
        "part": "adjective",
        "definition": "clever in a cunning way",
        "level": "Common (High-frequency) Words"
    },
    "modicum": {
        "example": "If my sister had even a modicum of sense, she wouldn't be engaged to that barbarian.",
        "part": "noun",
        "definition": "a small or moderate or token amount",
        "level": "Advanced Words"
    },
    "chauvinist": {
        "example": "The chauvinist lives on both sides of the political spectrum, outright shunning anybody whose ideas are not consistent with his own.",
        "part": "noun",
        "definition": "a person who believes in the superiority of their group",
        "level": "Basic Words"
    },
    "rescind": {
        "example": "The man's driver's license was rescinded after his tenth car accident, which meant he would never be allowed to legally drive again.",
        "part": "verb",
        "definition": "cancel officially",
        "level": "Common (High-frequency) Words"
    },
    "truculence": {
        "example": "When the boss confronted Aaron about his earlier remarks, Aaron responded with utter truculence, simply throwing a glass of water in the boss' face and walking away.",
        "part": "noun",
        "definition": "defiant aggressiveness",
        "level": "Advanced Words"
    },
    "vanquish": {
        "example": "For years, Argentina would dominate in World Cup qualifying matches, only to be vanquished by one of the European countries during the late stages of the tournament.",
        "part": "verb",
        "definition": "come out better in a competition, race, or conflict",
        "level": "Basic Words"
    },
    "unruly": {
        "example": "authority Walk in to any preschool and I am sure that you will find an unruly and chaotic scene--unless it's nap time.",
        "part": "adjective",
        "definition": "(of persons) noisy and lacking in restraint or discipline; unwilling to submit to",
        "level": "Basic Words"
    },
    "amenable": {
        "example": "Even though she did not like the outdoors, Shirley was generally amenable and so her brother was able to persuade her to go camping.",
        "part": "adjective",
        "definition": "easily persuaded",
        "level": "Common (High-frequency) Words"
    },
    "conflate": {
        "example": "In her recent book, the author conflates several genres--the detective story, the teen thriller, and the vampire romance--to create a memorable read.",
        "part": "verb",
        "definition": "mix together different elements or concepts",
        "level": "Advanced Words"
    },
    "cryptic": {
        "example": "Since Sarah did not want her husband to guess the Christmas present she had bought him, she only answered cryptically when he would ask her questions about it.",
        "part": "adjective",
        "definition": "mysterious or vague, usually intentionally",
        "level": "Common (High-frequency) Words"
    },
    "surly": {
        "example": "Every morning, Bhavin was a surly unhappy person, but once he ate breakfast, he became loving, laughing, and a joy to be around.",
        "part": "adjective",
        "definition": "inclined to anger or bad feelings with overtones of menace",
        "level": "Basic Words"
    },
    "denigrate": {
        "example": "someone Count Rumford denigrated the new theory of heat, demonstrating that it was wholly inadequate to explain the observations.",
        "part": "verb",
        "definition": "charge falsely or with malicious intent; attack the good name and reputation of",
        "level": "Common (High-frequency) Words"
    },
    "reprobate": {
        "example": "Those old reprobates drinking all day down by the river--they are not going to amount to much.",
        "part": "noun",
        "definition": "a person who is disapproved of",
        "level": "Basic Words"
    },
    "banal": {
        "example": "The professor used such banal expression that many students in the class either fell asleep from bordeom or stayed awake to complete his sentences and humor friends.",
        "part": "adjective",
        "definition": "repeated too often; overfamiliar through overuse",
        "level": "Common (High-frequency) Words"
    },
    "imbroglio": {
        "example": "The chef cook-off featured one gourmand who had the unfortunate distinction of mixing the wrong broths, creating an imbroglio that diners would not soon forget.",
        "part": "noun",
        "definition": "a confusing and potentially embarrassing situation",
        "level": "Advanced Words"
    },
    "tirade": {
        "example": "In terms of political change, a tirade oftentimes does little more than make the person speaking red in the face.",
        "part": "noun",
        "definition": "an angry speech",
        "level": "Basic Words"
    },
    "entice": {
        "example": "Harold enticed his wife, Maude, to go on a vacation to Hawaii, with promises of luaus on the beach and all-you-can-eat seafood buffets.",
        "part": "verb",
        "definition": "get someone to do something through (often false or exaggerated) promises",
        "level": "Basic Words"
    },
    "adamant": {
        "example": "Civil rights icon Rosa Parks will forever be remembered for adamantly refusing to give up her seat on a public bus--even after the bus driver insisted, she remained rooted in place.",
        "part": "adjective",
        "definition": "refusing to change one's mind",
        "level": "Common (High-frequency) Words"
    },
    "lascivious": {
        "example": "Lolita is a challenging novel for many, not necessarily because of the elevated prose style but because of the depravity of the main character, Humbert Humbert, who, as an old, lascivious man, falls in love with a girl.",
        "part": "adjective",
        "definition": "lecherous; sexually perverted",
        "level": "Advanced Words"
    },
    "sullen": {
        "example": "Herbert took board games too seriously, often appearing sullen after losing.",
        "part": "adjective",
        "definition": "showing a brooding ill humor",
        "level": "Common (High-frequency) Words"
    },
    "inequity": {
        "example": "After decades of racial inequity, the \"separate but equal\" doctrine was successfully overturned.",
        "part": "noun",
        "definition": "injustice by virtue of not conforming with rules or standards",
        "level": "Advanced Words"
    },
    "doleful": {
        "example": "No event is more doleful than the passing of my mother; she was a shining star in my life, and it brings me great sadness to think that she is now gone.",
        "part": "adjective",
        "definition": "filled with or evoking sadness",
        "level": "Advanced Words"
    },
    "finagle": {
        "example": "Steven was able to finagle one of the last seats on the train by convincing the conductor that his torn stub was actually a valid ticket.",
        "part": "verb",
        "definition": "achieve something by means of trickery or devious methods",
        "level": "Basic Words"
    },
    "fastidious": {
        "example": "Whitney is fastidious about her shoes, arranging them on a shelf in a specific order, each pair evenly spaced.",
        "part": "adjective",
        "definition": "overly concerned with details; fussy",
        "level": "Common (High-frequency) Words"
    },
    "pernicious": {
        "example": "The most successful viruses are pernicious: an infected person may feel perfectly healthy for several months while incubating and spreading the virus.",
        "part": "adjective",
        "definition": "exceedingly harmful; working or spreading in a hidden and injurious way",
        "level": "Common (High-frequency) Words"
    },
    "enmity": {
        "example": "Charles rude remark toward Sarah yesterday was due to his illness, not due to any real enmity toward Sarah.",
        "part": "noun",
        "definition": "a state of deep-seated ill-will",
        "level": "Basic Words"
    },
    "impending": {
        "example": "The impending doom of our world has been a discussed and debated for 2000 years--maybe even longer.",
        "part": "adjective",
        "definition": "close in time; about to occur",
        "level": "Basic Words"
    },
    "glean": {
        "example": "Herb has given us no formal statement about his background, but from various hints, I have gleaned that he grew up in difficult circumstances.",
        "part": "verb",
        "definition": "collect information bit by bit",
        "level": "Basic Words"
    },
    "magisterial": {
        "example": "Though she was only a third grade teacher, Ms. Martinet was magisterial in dealing with her class, lording over them like a queen.",
        "part": "adjective",
        "definition": "offensively self-assured or given to exercising unwarranted power",
        "level": "Advanced Words"
    },
    "palatable": {
        "example": "MIkey didn't partake much in his friends' conversations, but found their presence palatable.",
        "part": "adjective",
        "definition": "acceptable to the taste or mind",
        "level": "Advanced Words"
    },
    "untrammeled": {
        "example": "The whole notion of living untrammeled inspired the American Revolution and was enshrined in the Declaration of Independence and the Constitution.",
        "part": "adjective",
        "definition": "not confined or limited",
        "level": "Advanced Words"
    },
    "gregarious": {
        "example": "Often we think that great leaders are those who are gregarious, always in the middle of a large group of people; yet, as Mahatma Gandhi and many others have shown us, leaders can also be introverted.",
        "part": "adjective",
        "definition": "to be likely to socialize with others",
        "level": "Common (High-frequency) Words"
    },
    "martinet": {
        "example": "The job seemed perfect to Rebecca, until she found out that her boss was a total martinet; after each project the boss would come by to scrutinize--and inevitably criticize--every little detail of the work Rebecca had done.",
        "part": "noun",
        "definition": "a strict disciplinarian",
        "level": "Advanced Words"
    },
    "buttress": {
        "example": "China's economy has been buttressed by a global demand for the electronic parts the country manufactures.",
        "part": "verb",
        "definition": "make stronger or defensible",
        "level": "Basic Words"
    },
    "fledgling": {
        "example": "Murray has years of experience in family practice, but he is just a fledgling in surgery.",
        "part": "adjective",
        "definition": "young and inexperienced; describing any new participant in some activity",
        "level": "Basic Words"
    },
    "countermand": {
        "example": "By the time the colonel countermanded his soldiers not to land in enemy territory, a few helicopters had already touched down amid heavy gunfire.",
        "part": "verb",
        "definition": "a contrary command cancelling or reversing a previous command",
        "level": "Advanced Words"
    },
    "aesthetic": {
        "example": "movement. The artist operated according to a peculiar aesthetic, not considering any photograph to be worth publishing unless it contained a marine mammal.",
        "part": "noun",
        "definition": "a set of principles underlying and guiding the work of a particular artist or artistic",
        "level": "Common (High-frequency) Words"
    },
    "pugnacious": {
        "part": "adjective",
        "definition": "eager to fight or argue; verbally combative",
        "level": "Basic Words"
    },
    "jaundice": {
        "example": "Shelly was jaundiced towards Olivia; though the two had once been best friends, Olivia had become class president, prom queen, and, to make matters worse, the girlfriend of the one boy Shelly liked.",
        "part": "adjective",
        "definition": "to be biased against due to envy or prejudice",
        "level": "Advanced Words"
    },
    "veracious": {
        "example": "While we elect our leaders in the hope that every word they speak  will be veracious, history has shown that such a hope is naive.",
        "part": "adjective",
        "definition": "truthful",
        "level": "Common (High-frequency) Words"
    },
    "diffident": {
        "example": "As a young girl she was diffident and reserved, but now as an adult, she is confident and assertive.",
        "part": "adjective",
        "definition": "showing modest reserve; lacking self-confidence",
        "level": "Common (High-frequency) Words"
    },
    "preemptive": {
        "example": "Just as Martha was about to take the only cookie left on the table, Noah preemptively swiped it.",
        "part": "adjective",
        "definition": "done before someone else can do it",
        "level": "Basic Words"
    },
    "arcane": {
        "example": "Most college fraternities are known for arcane rituals that those hoping to the join the fraterntiy must learn.",
        "part": "adjective",
        "definition": "requiring secret or mysterious knowledge",
        "level": "Common (High-frequency) Words"
    },
    "prolixity": {
        "example": "I loved my grandfather dearly, but his prolixity would put me to sleep, regardless of the topic.",
        "part": "noun",
        "definition": "boring verbosity",
        "level": "Advanced Words"
    },
    "vacuous": {
        "example": "To the journalist's pointed question, the senator gave a vacuous response, mixing a few of his overall campaign slogans with platitudes and completely avoiding the controversial subject of the question.",
        "part": "adjective",
        "definition": "devoid of intelligence, matter, or significance",
        "level": "Basic Words"
    },
    "equitable": {
        "example": "The equitable distribution of ice cream to a group of 5 year olds will ensure little to no fighting--at least until the ice cream is gone.",
        "part": "adjective",
        "definition": "fair to all parties as dictated by reason and conscience",
        "level": "Advanced Words"
    },
    "ambiguous": {
        "example": "The coach told his team, \"Move towards that side of the field\"; because he did not point, his directions were ambiguous, and the team had no idea to which side he was referring.",
        "part": "adjective",
        "definition": "open to more than one interpretation",
        "level": "Common (High-frequency) Words"
    },
    "reconcile": {
        "example": "Peggy was unable to reconcile her kind friend Jane with the cruel and merciless character Jane played on television.",
        "part": "verb",
        "definition": "make (one thing) compatible with (another)",
        "level": "Common (High-frequency) Words"
    },
    "charlatan": {
        "example": "You may call him a \"motivational speaker,\" but I call him a charlatan--he doesn't have any idea what he's really talking about.",
        "part": "noun",
        "definition": "a flamboyant deceiver; one who attracts customers with tricks or jokes",
        "level": "Advanced Words"
    },
    "inundate": {
        "example": "The newsroom was inundated with false reports that only made it more difficult for the newscasters to provide an objective account of the bank robbery.",
        "part": "verb",
        "definition": "to flood or overwhelm",
        "level": "Basic Words"
    },
    "bleak": {
        "example": "Unremitting overcast skies tend to lead people to create bleak literature and lugubrious music -- compare England's band Radiohead to any band from Southern California.",
        "part": "adjective",
        "definition": "having a depressing or gloomy outlook",
        "level": "Basic Words"
    },
    "unviable": {
        "example": "The plan was obviously unviable considering that it lead to complete environmental destruction in the river valley.",
        "part": "adjective",
        "definition": "not able to work, survive, or succeed (also spelled inviable).",
        "level": "Advanced Words"
    },
    "implausible": {
        "example": "The teacher found it implausible that the student was late to school because he had been kidnapped by outlaws on horseback.",
        "part": "adjective",
        "definition": "describing a statement that is not believable",
        "level": "Common (High-frequency) Words"
    },
    "derisive": {
        "example": "I was surprised by her derisive tone; usually, she is sweet, soft spoken, and congenial.",
        "part": "adjective",
        "definition": "abusing vocally; expressing contempt or ridicule",
        "level": "Basic Words"
    },
    "genial": {
        "example": "Betty is a genial young woman: everyone she meets is put at ease by her elegance and grace.",
        "part": "adjective",
        "definition": "agreeable, conducive to comfort",
        "level": "Basic Words"
    },
    "execrate": {
        "example": "Though the new sitcom did decently in the ratings, Nelson railed against the show, saying that it was nothing more than an execrable pastiche of tired clichÃ©'s and canned laughter.",
        "part": "verb",
        "definition": "to curse and hiss at",
        "level": "Advanced Words"
    },
    "err": {
        "example": "He erred in thinking that \"indigent\" and \"indignant\" were synonyms.",
        "part": "verb",
        "definition": "to make an error",
        "level": "Basic Words"
    },
    "beatific": {
        "example": "Often we imagine all monks to wear the beatific smile of the Buddha, but, like any of us, a monk can have a bad day and not look very happy.",
        "part": "adjective",
        "definition": "blissfully happy",
        "level": "Basic Words"
    },
    "unflappable": {
        "example": "composure The house shook and the ground quaked, but my dad was unflappable and comforted the family.",
        "part": "adjective",
        "definition": "not easily perturbed or excited or upset; marked by extreme calm and",
        "level": "Advanced Words"
    },
    "heretic": {
        "example": "Though everybody at the gym told Mikey to do cardio before weights, Mikey was a heretic and always did the reverse.",
        "part": "noun",
        "definition": "a person who holds unorthodox opinions in any field (not merely religion)",
        "level": "Common (High-frequency) Words"
    },
    "placid": {
        "example": "Doug is normally placid, so we were all shocked to see him yelling at the television when the Mets lost the game.",
        "part": "adjective",
        "definition": "not easily irritated",
        "level": "Basic Words"
    },
    "rakish": {
        "example": "As soon as he arrived in the city, the rakish young man bought some drugs and headed straight for the seedy parts of town.",
        "part": "adjective",
        "definition": "marked by a carefree unconventionality or disreputableness",
        "level": "Basic Words"
    },
    "discrete": {
        "example": "What was once known as Czechoslovakia has since split into two discrete, independent nations.",
        "part": "adjective",
        "definition": "constituting a separate entity or part",
        "level": "Common (High-frequency) Words"
    },
    "paucity": {
        "example": "There is a paucity of jobs hiring today that require menial skills, since most jobs have either been automated or outsourced.",
        "part": "noun",
        "definition": "a lack of something",
        "level": "Basic Words"
    },
    "phantasmagorical": {
        "example": "Those suffering from malaria fall into a feverish sleep, their world a whirligig of phantasmagoria; if they recover, they are unsure of what actually took place and what was simply a product of their febrile imaginations.",
        "part": "adjective",
        "definition": "illusive; unreal",
        "level": "Advanced Words"
    },
    "stipend": {
        "example": "He was hoping for a monthly allowance loan from the government, but after no such stipend was forthcoming he realized he would have to seek other means of paying for his college tuition.",
        "part": "noun",
        "definition": "a regular allowance (of money)",
        "level": "Basic Words"
    },
    "eke": {
        "example": "Stranded in a cabin over the winter, Terry was able to eke out an existence on canned food.",
        "part": "verb",
        "definition": "To live off meager resources, to scrape by",
        "level": "Basic Words"
    },
    "eclectic": {
        "example": "Joey was known for his eclectic tastes in music, one moment dancing to disco the next \"air conducting\" along to Beethoven's 9th symphony.",
        "part": "adjective",
        "definition": "comprised of a variety of styles",
        "level": "Common (High-frequency) Words"
    },
    "hector": {
        "example": "The boss's hectoring manner put off many employees, some of whom quit as soon as they found new jobs.",
        "part": "verb",
        "definition": "to bully or intimidate",
        "level": "Advanced Words"
    },
    "frustrate": {
        "example": "I thought I would finish writing the paper by lunchtime, but a number of urgent interruptions served to frustrate my plan.",
        "part": "verb",
        "definition": "hinder or prevent (the efforts, plans, or desires) of",
        "level": "Common (High-frequency) Words"
    },
    "sanguine": {
        "example": "With the prospect of having to learn 3,000 words during the course of the summer, Paul was anything but sanguine.",
        "part": "adjective",
        "definition": "cheerful; optimistic",
        "level": "Basic Words"
    },
    "analogous": {
        "example": "In many ways, the Internet's transformative effect on society has been analogous to that of the printing press.",
        "part": "adjective",
        "definition": "similar in some respects but otherwise different",
        "level": "Basic Words"
    },
    "destitute": {
        "example": "Now that the mine is closed, the town is destitute of any economic activity.",
        "part": "adjective",
        "definition": "completely wanting or lacking (usually \"destitute of\")",
        "level": "Basic Words"
    },
    "cosseted": {
        "example": "The king and queen cosseted the young prince, giving him a prized miniature pony for his fifth birthday.",
        "part": "verb",
        "definition": "treat with excessive indulgence",
        "level": "Advanced Words"
    },
    "expound": {
        "example": "The CEO refused to expound on the decision to merge our department with another one, and so I quit.",
        "part": "verb",
        "definition": "add details or explanation; clarify the meaning; state in depth",
        "level": "Common (High-frequency) Words"
    },
    "cow": {
        "part": "verb",
        "definition": "to intimidate",
        "level": "Advanced Words"
    },
    "acrimony": {
        "example": "The acrimonious dispute between the president and vice-president sent a clear signal to voters: the health of the current administration was imperiled.",
        "part": "noun",
        "definition": "bitterness and ill will",
        "level": "Common (High-frequency) Words"
    },
    "schadenfreude": {
        "example": "From his warm apartment window, Stanley reveled in schadenfreude as he laughed at the figures below, huddled together in the arctic chill.",
        "part": "noun",
        "definition": "joy from watching the suffering of others",
        "level": "Advanced Words"
    },
    "sanctimonious": {
        "example": "Even during the quiet sanctity of evening prayer, she held her chin high, a sanctimonious sneer forming on her face as she eyed those who were attending church for the first time.",
        "part": "adjective",
        "definition": "making a show of being pious; holier-than-thou",
        "level": "Basic Words"
    },
    "feckless": {
        "example": "Two years after graduation, Charlie still lived with his parents and had no job, becoming more feckless with each passing day.",
        "part": "adjective",
        "definition": "lazy and irresponsible",
        "level": "Advanced Words"
    },
    "bridle": {
        "example": "The hostess bridled at the tactless dinner guests who insisted on eating before everybody had gotten their food.",
        "part": "verb",
        "definition": "anger or take offense",
        "level": "Advanced Words"
    },
    "duplicity": {
        "example": "A life of espionage is one of duplicity: an agent must pretend to be a totally different person than who she or he actually is.",
        "part": "noun",
        "definition": "deceitfulness, pretending to want one thing but interested in something else",
        "level": "Advanced Words"
    },
    "profusion": {
        "example": "When Maria reported that she had been visited by Jesus Christ and had proof, a profusion of reporters and journalists descended on the town.",
        "part": "noun",
        "definition": "the property of being extremely abundant",
        "level": "Basic Words"
    },
    "immaterial": {
        "example": "The judge found the defendant's comments immaterial to the trial, and summarily dismissed him from the witness stand.",
        "part": "adjective",
        "definition": "not relevant",
        "level": "Basic Words"
    },
    "patronize": {
        "example": "She says she genuinely wanted to help me, but instead she patronized me, constantly pointing out how I was inferior to her.",
        "part": "verb",
        "definition": "treat condescendingly",
        "level": "Basic Words"
    },
    "reverent": {
        "example": "The professor could speak objectively about the other composers, but he always lectured about Brahms with a particularly reverent air, unable to offer a single criticism of his compositions.",
        "part": "adjective",
        "definition": "feeling or showing profound respect or veneration",
        "level": "Common (High-frequency) Words"
    },
    "apothegm": {
        "part": "noun",
        "definition": "a short, pithy instructive saying",
        "level": "Advanced Words"
    },
    "elude": {
        "example": "Even a basic understanding of physics can elude most high schools students.",
        "part": "verb",
        "definition": "escape understanding",
        "level": "Basic Words"
    },
    "artlessness": {
        "example": "I, personally, found the artlessness of her speech charming.",
        "part": "noun",
        "definition": "the quality of innocence",
        "level": "Advanced Words"
    },
    "exasperate": {
        "example": "As a child, I exasperated my mother with strings of never-ending questions.",
        "part": "verb",
        "definition": "to irritate intensely",
        "level": "Basic Words"
    },
    "aberration": {
        "example": "Aberrations in climate have become the norm: rarely a week goes by without some meteorological phenomenon making headlines.",
        "part": "noun",
        "definition": "a deviation from what is normal or expected",
        "level": "Common (High-frequency) Words"
    },
    "unpropitious": {
        "example": "With only a bottle of water and a sandwich, the hikers faced an unpropitious task: ascending a huge mountain that took most two days to climb.",
        "part": "adjective",
        "definition": "(of a circumstance) with little chance of success",
        "level": "Advanced Words"
    },
    "churlish": {
        "example": "The manager was unnecessarily churlish to his subordinates, rarely deigning to say hello, but always quick with a sartorial jab if someone happened to be wearing anything even slightly mismatching.",
        "part": "adjective",
        "definition": "lacking manners or refinement",
        "level": "Advanced Words"
    },
    "precocious": {
        "example": "Though only seven years old, she was a precocious chess prodigy, able to beat players twice her age.",
        "part": "adjective",
        "definition": "characterized by or characteristic of exceptionally early development or maturity (especially in mental aptitude)",
        "level": "Common (High-frequency) Words"
    },
    "jingoist": {
        "part": "noun",
        "definition": "a person who thinks that their country should be at war",
        "level": "Advanced Words"
    },
    "debunk": {
        "example": "Richard Dawkins tries to debunk religious belief, but his ridicule tends to push people away from his points rather than convince them.",
        "part": "verb",
        "definition": "expose as false ideas and claims, especially while ridiculing",
        "level": "Basic Words"
    },
    "obscure": {
        "example": "Many of the biggest movie stars were once obscure actors who got only bit roles in long forgotten films.",
        "part": "adjective",
        "definition": "known by only a few",
        "level": "Common (High-frequency) Words"
    },
    "mendacity": {
        "example": "I can forgive her for her mendacity but only because she is a child and is seeing what she can get away with.",
        "part": "noun",
        "definition": "the tendency to be untruthful",
        "level": "Common (High-frequency) Words"
    },
    "anodyne": {
        "example": "Wilbur enjoyed a spicy Mexican breakfast, but Jill prefered a far more anodyne meal in the mornings.",
        "part": "adjective",
        "definition": "inoffensive",
        "level": "Advanced Words"
    },
    "impregnable": {
        "example": "As a child, Amy would build pillow castles and pretend they were impregnable fotresses.",
        "part": "adjective",
        "definition": "immune to attack; incapable of being tampered with",
        "level": "Basic Words"
    },
    "lionize": {
        "example": "Students in the U.S. learn to lionize Jefferson, Franklin, and Washington because they are the founding fathers of the nation.",
        "part": "verb",
        "definition": "assign great social importance to",
        "level": "Common (High-frequency) Words"
    },
    "propitious": {
        "example": "The child's heartbeat is still weak, but I am seeing many propitious signs and I think that she may be healing.",
        "part": "adjective",
        "definition": "presenting favorable circumstances; likely to result in or show signs of success",
        "level": "Common (High-frequency) Words"
    },
    "mulct": {
        "example": "The so-called magical diet cure simply ended up mulcting Maria out of hundreds of dollars, but did nothing for her weight.",
        "part": "verb",
        "definition": "to defraud or swindle",
        "level": "Advanced Words"
    },
    "disaffected": {
        "example": "After watching his superior take rations from the soliders, he quickly became disaffected and rebeled.",
        "part": "adjective",
        "definition": "discontented as toward authority",
        "level": "Common (High-frequency) Words"
    },
    "protean": {
        "example": "Peter Sellers was truly a protean actor--in Doctor Strangelove he played three very different roles: a jingoist general, a sedate President and a deranged scientist.",
        "part": "adjective",
        "definition": "readily taking on different roles; versatile",
        "level": "Advanced Words"
    },
    "discriminate": {
        "example": "Sarah couldn't discriminate between a good wine and a bad wine, so she avoided wine tastings.",
        "part": "verb",
        "definition": "recognize or perceive the difference",
        "level": "Basic Words"
    },
    "cede": {
        "example": "Eventually, all parents must cede control of their growing childrens' educations and allow their offspring some autonomy.",
        "part": "verb",
        "definition": "relinquish possession or control over",
        "level": "Advanced Words"
    },
    "errant": {
        "example": "Unlike his peers, who spent their hours studying in the library, Matthew preferred errant walks through the university campus.",
        "part": "adjective",
        "definition": "to be wandering; not sticking to a circumscribed path",
        "level": "Basic Words"
    },
    "contingent": {
        "example": "Whether the former world champions can win again this year is contingent upon none of its star players getting injured.",
        "part": "adjective",
        "definition": "possible but not certain to occur",
        "level": "Common (High-frequency) Words"
    },
    "venerate": {
        "example": "The professor, despite his soporific lectures, was venerated amongst his colleagues, publishing more papers yearly than all of his peers combined.",
        "part": "verb",
        "definition": "to respect deeply",
        "level": "Common (High-frequency) Words"
    },
    "facetious": {
        "example": "Facetious behavior will not be tolerated during sex eduation class; it's time for all of you to treat these matters like mature adults.",
        "part": "adjective",
        "definition": "cleverly amusing in tone",
        "level": "Basic Words"
    },
    "cadaverous": {
        "example": "Some actors take challenging roles in which they have to lose so much weight that they appear cadaverous.",
        "part": "adjective",
        "definition": "emaciated; gaunt",
        "level": "Basic Words"
    },
    "illustrious": {
        "example": "Einstein was possibly the most illustrious scientist in recent history.",
        "part": "adjective",
        "definition": "widely known and esteemed; having or conferring glory",
        "level": "Advanced Words"
    },
    "audacious": {
        "example": "As all of the other campers cowered in their tents, Bill, armed only with a flashlight, audaciously tracked down the bear that had raided their food.",
        "part": "adjective",
        "definition": "willing to be bold in social situations or to take risks",
        "level": "Common (High-frequency) Words"
    },
    "ravenous": {
        "example": "John didn't each much at all during the week he had the flu, so now that he is regaining his health, it's not surpring that he has a ravenous appetite.",
        "part": "adjective",
        "definition": "extremely hungry; devouring or craving food in great quantities",
        "level": "Common (High-frequency) Words"
    },
    "garrulous": {
        "example": "Lynne was garrulous: once, she had a fifteen minute conversation with a stranger before she realized the woman didn't speak English.",
        "part": "adjective",
        "definition": "full of trivial conversation",
        "level": "Common (High-frequency) Words"
    },
    "aplomb": {
        "example": "Nancy acted with aplomb during dangerous situations--she once calmly climbed up an oak tree to save a cat.",
        "part": "noun",
        "definition": "great coolness and composure under strain",
        "level": "Advanced Words"
    },
    "derivative": {
        "example": "work of another person Because the movies were utterly derivative of other popular movies, they did well at the box office.",
        "part": "adjective",
        "definition": "(or a creative product, e.g. music, writing, etc.) not original but drawing on the",
        "level": "Common (High-frequency) Words"
    },
    "upbraid": {
        "example": "Bob took a risk walking into the \"Students Barbershop\"--in the end he had to upbraid the apparently drunk barber for giving him an uneven bowl cut.",
        "part": "verb",
        "definition": "to reproach; to scold",
        "level": "Common (High-frequency) Words"
    },
    "hobble": {
        "example": "Bad weather has hobbled rescue efforts, making it difficult for crews to find bodies in the wreckage.",
        "part": "verb",
        "definition": "to hold back  the progress of something",
        "level": "Advanced Words"
    },
    "nettlesome": {
        "example": "Maria found her coworkers cell phone nettlesome, because every few minutes it would buzz to life with another text message.",
        "part": "adjective",
        "definition": "causing irritation or annoyance",
        "level": "Advanced Words"
    },
    "parvenu": {
        "example": "higher class The theater was full of parvenus who each thought that they were surrounded by true aristocrats.",
        "part": "noun",
        "definition": "a person who has suddenly become wealthy, but not socially accepted as part of a",
        "level": "Advanced Words"
    },
    "respite": {
        "example": "Every afternoon, the small company has a respite in which workers play foosball or board games.",
        "part": "noun",
        "definition": "a pause from doing something (as work)",
        "level": "Basic Words"
    },
    "foible": {
        "example": "When their new roommate sat staring at an oak tree for an hour, Marcia thought it indicated a mental problem, but Jeff assured her it was a harmless foible.",
        "part": "noun",
        "definition": "a behavioral attribute that is distinctive and peculiar to an individual",
        "level": "Basic Words"
    },
    "fickle": {
        "example": "She was so fickle in her politics, it was hard to pinpoint her beliefs; one week she would embrace a side, and the next week she would denounce it.",
        "part": "adjective",
        "definition": "liable to sudden unpredictable change, esp. in affections or attachments",
        "level": "Basic Words"
    },
    "unseemly": {
        "example": "He acted in an unseemly manner, insulting the hostess and then speaking ill of her deceased husband.",
        "part": "adjective",
        "definition": "not in keeping with accepted standards of what is right or proper in polite society",
        "level": "Basic Words"
    },
    "carping": {
        "example": "What seemed like incessant nagging and carping about my behavior from my mother turned out to be wise and useful advice that has served me well.",
        "part": "adjective",
        "definition": "persistently petty and unjustified criticism",
        "level": "Basic Words"
    },
    "tact": {
        "example": "In a tremendous display of tact, Shelly was able to maintain a strong friendship with Marcia, even though Marcia's husband, Frank, confessed to finding Shelley more attractive than Marcia.",
        "part": "noun",
        "definition": "consideration in dealing with others and avoiding giving offense",
        "level": "Basic Words"
    },
    "fete": {
        "example": "After World War II, war heroes were feted at first but quickly forgotten.",
        "part": "verb",
        "definition": "to celebrate a person",
        "level": "Basic Words"
    },
    "picayune": {
        "example": "English teachers are notorious for being picayune; however, the English language is so nuanced and sophisticated that often such teachers are not being contrary but are only adhering to the rules.",
        "part": "adjective",
        "definition": "trifling or petty (a person)",
        "level": "Advanced Words"
    },
    "belie": {
        "example": "The smile on her face belies the pain she must feel after the death of her husband.",
        "part": "verb",
        "definition": "to give a false representation to; misrepresent",
        "level": "Common (High-frequency) Words"
    },
    "abjure": {
        "example": "While the church believed that Galileo abjured the heliocentric theory under threat of torture, he later wrote a book clearly supporting the theory.",
        "part": "verb",
        "definition": "formally reject or give up (as a belief)",
        "level": "Advanced Words"
    },
    "augment": {
        "example": "Ideally, the restaurant's augmented menu will expand its clientele and increase its profits.",
        "part": "verb",
        "definition": "enlarge or increase; improve",
        "level": "Basic Words"
    },
    "mitigate": {
        "example": "If it weren't for the mitigating circumstances, he would have certainly lost his job.",
        "part": "verb",
        "definition": "lessen the severity of an offense",
        "level": "Common (High-frequency) Words"
    },
    "elegiac": {
        "example": "Few can listen to the elegiac opening bars of the Moonlight sonata without feeling the urge to cry.",
        "part": "adjective",
        "definition": "expressing sorrow",
        "level": "Advanced Words"
    },
    "appurtenant": {
        "example": "In hiking Mt. Everest, sherpas are appurtenant, helping climbers both carry gear and navigate treacherous paths.",
        "part": "adjective",
        "definition": "supply added support",
        "level": "Advanced Words"
    },
    "apogee": {
        "example": "The apogee of the Viennese style of music, Mozart's music continues to mesmerize audiences well into the 21st century.",
        "part": "noun",
        "definition": "the highest point",
        "level": "Advanced Words"
    },
    "prolific": {
        "example": "Schubert was the most prolific composer, producing hundreds of hours of music before he died at the age of 31.",
        "part": "adjective",
        "definition": "intellectually productive",
        "level": "Common (High-frequency) Words"
    },
    "acerbic": {
        "example": "Most movie critics are acerbic towards summer blockbusters, often referring to them as garbage.",
        "part": "adjective",
        "definition": "harsh in tone",
        "level": "Common (High-frequency) Words"
    },
    "imbibe": {
        "example": "Plato imbibed Socrates' teachings to such an extent that he was able to write volumes of work that he directly attributed, sometimes word for word, to Socrates.",
        "part": "verb",
        "definition": "to drink or absorb as if drinking",
        "level": "Advanced Words"
    },
    "reprisal": {
        "example": "The Old Testament doctrine of an eye for an eye is not the kind of retaliation practiced in war; rather, an arm, a leg, and both ears are the reprisal for the smallest scratch.",
        "part": "noun",
        "definition": "a retaliatory action against an enemy in wartime",
        "level": "Advanced Words"
    },
    "innocuous": {
        "example": "Everyone found Nancy's banter innocuous--except for Mike, who felt like she was intentionally picking on him.",
        "part": "adjective",
        "definition": "harmless and doesn\"t produce any ill effects",
        "level": "Common (High-frequency) Words"
    },
    "tempered": {
        "example": "The wide-eyed optimism of her youth was now tempered after she had worked many years in the criminal justice system.",
        "part": "adjective",
        "definition": "moderated in effect",
        "level": "Common (High-frequency) Words"
    },
    "subterfuge": {
        "example": "Finally deciding to abandon all subterfuge, Arthur revealed to Cindy everything about his secret affair over the past two years.",
        "part": "noun",
        "definition": "something intended to misrepresent the true nature of an activity",
        "level": "Advanced Words"
    },
    "rash": {
        "example": "Although Bruce was able to make the delivery in time with a nightime motorcycle ride in the rain, Susan criticized his actions as rash.",
        "part": "adjective",
        "definition": "marked by defiant disregard for danger or consequences; imprudently incurring risk",
        "level": "Basic Words"
    },
    "enumerate": {
        "example": "I sat and listened as she enumerated all of the things she did not like about the past three months.",
        "part": "verb",
        "definition": "specify individually, one by one",
        "level": "Basic Words"
    },
    "gaffe": {
        "example": "In a famous gaffe, Vice President Quayle attempted to correct the spelling of a grade school student, only to find that the child was correct.",
        "part": "noun",
        "definition": "a socially awkward or tactless act",
        "level": "Advanced Words"
    },
    "jingoism": {
        "example": "North Korea maintains intense control over its population through a combination of jingoism and cult of personality.",
        "part": "noun",
        "definition": "fanatical patriotism",
        "level": "Common (High-frequency) Words"
    },
    "itinerant": {
        "example": "Doctors used to be itinerant, traveling between patients' homes.",
        "part": "adjective",
        "definition": "traveling from place to place to work",
        "level": "Common (High-frequency) Words"
    },
    "furtive": {
        "example": "While at work, George and his boss Regina felt the need to be as furtive as possible about their romantic relationship.",
        "part": "adjective",
        "definition": "marked by quiet and caution and secrecy; taking pains to avoid being observed",
        "level": "Common (High-frequency) Words"
    },
    "capricious": {
        "example": "Nearly every month our capricious CEO had a new plan to turn the company around, and none of them worked because we never gave them the time they needed to succeed.",
        "part": "adjective",
        "definition": "determined by chance or impulse or whim rather than by necessity or reason",
        "level": "Common (High-frequency) Words"
    },
    "exacerbate": {
        "example": "Her sleeplessness exacerbated her cold--when she woke up the next day, her sinuses were completely blocked.",
        "part": "verb",
        "definition": "make worse",
        "level": "Common (High-frequency) Words"
    }
}